[{"text": "This is a Wikipedia passage about rick mahler. Rick Mahler (born Richard Alan Mahler on April 18, 1957 in Atlanta, Georgia) was an American professional baseball pitcher who played for the Atlanta Braves, Cincinnati Reds, Montreal Expos, and Minnesota Twins of Major League Baseball (MLB) from 1978 to 1990. He was a two-time All-Star and won the National League (NL) ERA title in 1985.", "labels": "Mahler was drafted by the Braves in the first round of the 1975 amateur draft.", "concept": "rick mahler"}, {"text": "This is a Wikipedia passage about tim finchem. Tim Finchem (born August 24, 1947) is an American businessman and former Commissioner of the PGA Tour.", "labels": "He served as Commissioner from 1994 to 2016.", "concept": "tim finchem"}, {"text": "This is a Wikipedia passage about tim finchem. Tim Finchem (born August 24, 1947) is an American businessman and former Commissioner of the PGA Tour. He served as Commissioner from 1994 to 2016. Finchem was born in Washington, D.C., and grew up in Bethesda, Maryland. He graduated from the University of Maryland in 1969 with a degree in business administration. He then attended the University of Virginia School of Law, where he earned his Juris Doctor degree in 1972. Finchem began his career in the golf industry in 1975, when he joined the PGA Tour as its first full-time legal counsel.", "labels": "He was promoted to Deputy Commissioner in 1988 and Commissioner in 1994.", "concept": "tim finchem"}, {"text": "This is a Wikipedia passage about tim finchem. Tim Finchem (born August 24, 1947) is an American businessman and former Commissioner of the PGA Tour. He served as Commissioner from 1994 to 2016. Finchem was born in Washington, D.C., and grew up in Bethesda, Maryland. He graduated from the University of Maryland in 1969 with a degree in business administration. He then attended the University of Virginia School of Law, where he earned his Juris Doctor degree in 1972. Finchem began his career in the golf industry in 1975, when he joined the PGA Tour as its first full-time legal counsel. He was promoted to Deputy Commissioner in 1988 and Commissioner in 1994. During his tenure, the PGA Tour grew from a domestic tour to an international tour, with events in more than 30 countries.", "labels": "He also oversaw the introduction of the FedEx Cup, a season-long points competition that culminates in a four-tournament playoff.", "concept": "tim finchem"}, {"text": "This is a Wikipedia passage about tim finchem. Tim Finchem (born August 24, 1947) is an American businessman and former Commissioner of the PGA Tour. He served as Commissioner from 1994 to 2016. Finchem was born in Washington, D.C., and grew up in Bethesda, Maryland. He graduated from the University of Maryland in 1969 with a degree in business administration. He then attended the University of Virginia School of Law, where he earned his Juris Doctor degree in 1972. Finchem began his career in the golf industry in 1975, when he joined the PGA Tour as its first full-time legal counsel. He was promoted to Deputy Commissioner in 1988 and Commissioner in 1994. During his tenure, the PGA Tour grew from a domestic tour to an international tour, with events in more than 30 countries. He also oversaw the introduction of the FedEx Cup, a season-long points competition that culminates in a four-tournament playoff.", "labels": "Finchem retired as Commissioner in 2016 and was succeeded by Jay Monahan.", "concept": "tim finchem"}, {"text": "This is a Wikipedia passage about akila dananjaya. Akila Dananjaya (born 2 August 1995) is a Sri Lankan cricketer. He made his international debut for the Sri Lankan cricket team in August 2018. He is a right-arm off-spinner and right-handed batsman. Dananjaya made his first-class debut for Sri Lanka Army Sports Club in the 2013–14 Premier League Tournament. He was the leading wicket-taker in the tournament, taking 32 wickets in seven matches. He made his List A debut for Sri Lanka Army Sports Club in the 2014–15 Premier Limited Overs Tournament.", "labels": "In August 2018, he was named in the Sri Lankan squad for the 2018 Asia Cup.", "concept": "akila dananjaya"}, {"text": "This is a Wikipedia passage about akila dananjaya. Akila Dananjaya (born 2 August 1995) is a Sri Lankan cricketer. He made his international debut for the Sri Lankan cricket team in August 2018. He is a right-arm off-spinner and right-handed batsman. Dananjaya made his first-class debut for Sri Lanka Army Sports Club in the 2013–14 Premier League Tournament. He was the leading wicket-taker in the tournament, taking 32 wickets in seven matches. He made his List A debut for Sri Lanka Army Sports Club in the 2014–15 Premier Limited Overs Tournament. In August 2018, he was named in the Sri Lankan squad for the 2018 Asia Cup. He made his One Day International (ODI) debut for Sri Lanka against Bangladesh on 15 September 2018.", "labels": "In October 2018, he was named in Sri Lanka's Test squad for their series against England, but he did not play.", "concept": "akila dananjaya"}, {"text": "This is a Wikipedia passage about wilhelm windelband. Wilhelm Windelband (15 March 1848 – 18 September 1915) was a German philosopher of the late 19th and early 20th centuries.", "labels": "He is now remembered mainly for the terms \"nomothetic\" and \"idiographic,\" which he introduced.", "concept": "wilhelm windelband"}, {"text": "This is a Wikipedia passage about wilhelm windelband. Wilhelm Windelband (15 March 1848 – 18 September 1915) was a German philosopher of the late 19th and early 20th centuries. He is now remembered mainly for the terms \"nomothetic\" and \"idiographic,\" which he introduced.", "labels": "He also wrote on history, psychology, the philosophy of religion, values, and other topics.", "concept": "wilhelm windelband"}, {"text": "This is a Wikipedia passage about wilhelm windelband. Wilhelm Windelband (15 March 1848 – 18 September 1915) was a German philosopher of the late 19th and early 20th centuries. He is now remembered mainly for the terms \"nomothetic\" and \"idiographic,\" which he introduced. He also wrote on history, psychology, the philosophy of religion, values, and other topics.", "labels": "He was a neo-Kantian who protested other neo-Kantians of his time and maintained a critical position towards psychologism.", "concept": "wilhelm windelband"}, {"text": "This is a Wikipedia passage about wilhelm windelband. Wilhelm Windelband (15 March 1848 – 18 September 1915) was a German philosopher of the late 19th and early 20th centuries. He is now remembered mainly for the terms \"nomothetic\" and \"idiographic,\" which he introduced. He also wrote on history, psychology, the philosophy of religion, values, and other topics. He was a neo-Kantian who protested other neo-Kantians of his time and maintained a critical position towards psychologism.", "labels": "Windelband is known as one of the founders of the \"Baden School\" of neo-Kantianism.", "concept": "wilhelm windelband"}, {"text": "This is a Wikipedia passage about freddie frith. Freddie Frith (1917–1994) was an English motorcycle racer who competed in the Isle of Man TT races and other international events. He was born in London and began racing in the 1930s. He won the Isle of Man TT in 1938 and 1939, and was the first rider to win the Senior TT twice in succession. He also won the North West 200 in 1938 and 1939, and the Ulster Grand Prix in 1938 and 1939.", "labels": "Frith was a popular figure in the racing world, and was known for his daring and aggressive riding style.", "concept": "freddie frith"}, {"text": "This is a Wikipedia passage about marshall manesh. Marshall Manesh (born October 24, 1956) is an American actor. He is best known for his roles as Ranjit on the CBS sitcom How I Met Your Mother and as Dr. Ravi Kapoor on the ABC sitcom Dharma & Greg. Manesh was born in Tehran, Iran, and moved to the United States in 1975. He attended the University of California, Los Angeles, where he earned a degree in theater. He began his acting career in the late 1980s, appearing in television shows such as L.A. Law, Cheers, and Seinfeld. He has also appeared in films such as The Big Lebowski and The Wedding Planner. Manesh has been married to actress Shohreh Aghdashloo since 1992. They have two children.", "labels": "He currently resides in Los Angeles, California.", "concept": "marshall manesh"}, {"text": "This is a Wikipedia passage about eleanor arnason. ", "labels": "Eleanor Arnason (born 1942) is an American science fiction and fantasy writer.", "concept": "eleanor arnason"}, {"text": "This is a Wikipedia passage about eleanor arnason. Eleanor Arnason (born 1942) is an American science fiction and fantasy writer.", "labels": "She is best known for her novel A Woman of the Iron People (1991), which won the James Tiptree, Jr. Award and was a finalist for the Nebula Award for Best Novel.", "concept": "eleanor arnason"}, {"text": "This is a Wikipedia passage about eleanor arnason. Eleanor Arnason (born 1942) is an American science fiction and fantasy writer. She is best known for her novel A Woman of the Iron People (1991), which won the James Tiptree, Jr. Award and was a finalist for the Nebula Award for Best Novel. Her other works include Ring of Swords (1993), The Sword Smith (1998), and The Hound of Merin (2002). She has also written several short stories, including \"Dapple\" (1991), which won the Nebula Award for Best Novelette. Arnason's work often focuses on themes of gender, ecology, and Native American culture.", "labels": "She has been praised for her ability to combine elements of science fiction and fantasy with traditional storytelling.", "concept": "eleanor arnason"}, {"text": "This is a Wikipedia passage about carter harrison , sr. .. ", "labels": "Carter Henry Harrison Sr.", "concept": "carter harrison , sr. ."}, {"text": "This is a Wikipedia passage about carter harrison , sr. .. Carter Henry Harrison Sr. (August 15, 1825 – October 28, 1893) was an American politician who served five terms as the mayor of Chicago, Illinois, from 1879 to 1887 and again from 1889 to 1893. He was the son of the city's first mayor, Carter Henry Harrison I. Harrison was a Democrat and a strong supporter of labor unions.", "labels": "He was assassinated by a disgruntled office seeker in 1893.", "concept": "carter harrison , sr. ."}, {"text": "This is a Wikipedia passage about carter harrison , sr. .. Carter Henry Harrison Sr. (August 15, 1825 – October 28, 1893) was an American politician who served five terms as the mayor of Chicago, Illinois, from 1879 to 1887 and again from 1889 to 1893. He was the son of the city's first mayor, Carter Henry Harrison I. Harrison was a Democrat and a strong supporter of labor unions. He was assassinated by a disgruntled office seeker in 1893. Harrison was born in Lexington, Kentucky, and moved to Chicago in 1853. He was elected to the Illinois House of Representatives in 1864 and served until 1872.", "labels": "He was elected mayor of Chicago in 1879 and served until 1887.", "concept": "carter harrison , sr. ."}, {"text": "This is a Wikipedia passage about carter harrison , sr. .. Carter Henry Harrison Sr. (August 15, 1825 – October 28, 1893) was an American politician who served five terms as the mayor of Chicago, Illinois, from 1879 to 1887 and again from 1889 to 1893. He was the son of the city's first mayor, Carter Henry Harrison I. Harrison was a Democrat and a strong supporter of labor unions. He was assassinated by a disgruntled office seeker in 1893. Harrison was born in Lexington, Kentucky, and moved to Chicago in 1853. He was elected to the Illinois House of Representatives in 1864 and served until 1872. He was elected mayor of Chicago in 1879 and served until 1887. During his tenure, he was a strong advocate for labor unions and was instrumental in the passage of the Eight-Hour Law in 1885. He was re-elected in 1889 and served until his assassination in 1893.", "labels": "He was a popular mayor and was known for his support of the working class.", "concept": "carter harrison , sr. ."}, {"text": "This is a Wikipedia passage about carter harrison , sr. .. Carter Henry Harrison Sr. (August 15, 1825 – October 28, 1893) was an American politician who served five terms as the mayor of Chicago, Illinois, from 1879 to 1887 and again from 1889 to 1893. He was the son of the city's first mayor, Carter Henry Harrison I. Harrison was a Democrat and a strong supporter of labor unions. He was assassinated by a disgruntled office seeker in 1893. Harrison was born in Lexington, Kentucky, and moved to Chicago in 1853. He was elected to the Illinois House of Representatives in 1864 and served until 1872. He was elected mayor of Chicago in 1879 and served until 1887. During his tenure, he was a strong advocate for labor unions and was instrumental in the passage of the Eight-Hour Law in 1885. He was re-elected in 1889 and served until his assassination in 1893. He was a popular mayor and was known for his support of the working class. He was also a strong advocate for civil rights and was a vocal opponent of the city's corrupt political machine.", "labels": "He was assassinated by a disgruntled office seeker in 1893.", "concept": "carter harrison , sr. ."}, {"text": "This is a Wikipedia passage about winnebago deal. Winnebago Deal is an American indie rock band from Brooklyn, New York. The band was formed in 2006 by singer/guitarist/songwriter/producer Chris Diken and drummer/producer/engineer/songwriter/multi-instrumentalist Matt Schulz.", "labels": "The band has released three full-length albums, two EPs, and a handful of singles.", "concept": "winnebago deal"}, {"text": "This is a Wikipedia passage about noel hogan. ", "labels": "Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer.", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer.", "labels": "He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries.", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer. He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries.", "labels": "Hogan formed the band in 1989 with vocalist Dolores O'Riordan, bassist Mike Hogan and drummer Fergal Lawler.", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer. He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries. Hogan formed the band in 1989 with vocalist Dolores O'Riordan, bassist Mike Hogan and drummer Fergal Lawler.", "labels": "The band achieved international success in the 1990s with their debut album Everybody Else Is Doing It, So Why Can't We?", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer. He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries. Hogan formed the band in 1989 with vocalist Dolores O'Riordan, bassist Mike Hogan and drummer Fergal Lawler. The band achieved international success in the 1990s with their debut album Everybody Else Is Doing It, So Why Can't We?", "labels": "and the hit singles \"Linger\" and \"Zombie\".", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer. He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries. Hogan formed the band in 1989 with vocalist Dolores O'Riordan, bassist Mike Hogan and drummer Fergal Lawler. The band achieved international success in the 1990s with their debut album Everybody Else Is Doing It, So Why Can't We? and the hit singles \"Linger\" and \"Zombie\".", "labels": "Hogan wrote or co-wrote the majority of the band's material, including their biggest hits.", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer. He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries. Hogan formed the band in 1989 with vocalist Dolores O'Riordan, bassist Mike Hogan and drummer Fergal Lawler. The band achieved international success in the 1990s with their debut album Everybody Else Is Doing It, So Why Can't We? and the hit singles \"Linger\" and \"Zombie\". Hogan wrote or co-wrote the majority of the band's material, including their biggest hits.", "labels": "He also produced the band's albums Bury the Hatchet (1999) and Wake Up and Smell the Coffee (2001).", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about noel hogan. Noel Anthony Hogan (born 25 December 1971) is an Irish musician, singer-songwriter and record producer. He is best known as the lead guitarist and co-songwriter of the alternative rock band The Cranberries. Hogan formed the band in 1989 with vocalist Dolores O'Riordan, bassist Mike Hogan and drummer Fergal Lawler. The band achieved international success in the 1990s with their debut album Everybody Else Is Doing It, So Why Can't We? and the hit singles \"Linger\" and \"Zombie\". Hogan wrote or co-wrote the majority of the band's material, including their biggest hits. He also produced the band's albums Bury the Hatchet (1999) and Wake Up and Smell the Coffee (2001). After The Cranberries disbanded in 2003, Hogan formed the band Mono Band and released two albums, Mono Band (2005) and Mono Band 2 (2008). He has also released two solo albums, The Sky Road (2009) and Ten Songs (2013).", "labels": "Hogan has also produced albums for other artists, including The Cranberries' Something Else (2017) and Noel Gallagher's High", "concept": "noel hogan"}, {"text": "This is a Wikipedia passage about dawn landes. Dawn Landes (born August 8, 1979) is an American singer-songwriter, multi-instrumentalist, and producer.", "labels": "She has released five solo albums, and has collaborated with a variety of artists, including Sufjan Stevens, Will Oldham, and Iron & Wine.", "concept": "dawn landes"}, {"text": "This is a Wikipedia passage about dawn landes. Dawn Landes (born August 8, 1979) is an American singer-songwriter, multi-instrumentalist, and producer. She has released five solo albums, and has collaborated with a variety of artists, including Sufjan Stevens, Will Oldham, and Iron & Wine. She has also composed music for film and television, including the score for the feature film The Cake Eaters.", "labels": "Landes was born in Louisville, Kentucky, and grew up in New York City.", "concept": "dawn landes"}, {"text": "This is a Wikipedia passage about bill quinn. William \"Bill\" Quinn (April 28, 1912 – April 22, 1994) was an American actor, best known for his role as Ralph Hourback on the CBS television series The Rifleman.", "labels": "Quinn was born in New York City and began his career in the 1930s as a radio actor.", "concept": "bill quinn"}, {"text": "This is a Wikipedia passage about bill quinn. William \"Bill\" Quinn (April 28, 1912 – April 22, 1994) was an American actor, best known for his role as Ralph Hourback on the CBS television series The Rifleman. Quinn was born in New York City and began his career in the 1930s as a radio actor. He appeared in numerous films, including The Man Who Shot Liberty Valance (1962), The Music Man (1962), and The Sting (1973). He also appeared in television series such as The Andy Griffith Show, The Untouchables, and The Twilight Zone. Quinn was a regular on The Rifleman, appearing in all 168 episodes of the series. He also directed several episodes of the show.", "labels": "Quinn died in 1994 at the age of 81.", "concept": "bill quinn"}, {"text": "This is a Wikipedia passage about gia carangi. ", "labels": "Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model during the late 1970s and early 1980s.", "concept": "gia carangi"}, {"text": "This is a Wikipedia passage about gia carangi. Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model during the late 1970s and early 1980s.", "labels": "Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.", "concept": "gia carangi"}, {"text": "This is a Wikipedia passage about gia carangi. Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent.", "labels": "Carangi's life was marred by drug addiction and depression, leading to her death from AIDS-related complications at the age of 26.", "concept": "gia carangi"}, {"text": "This is a Wikipedia passage about gia carangi. Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent. Carangi's life was marred by drug addiction and depression, leading to her death from AIDS-related complications at the age of 26.", "labels": "She is considered to be one of the first famous women to die of the disease.", "concept": "gia carangi"}, {"text": "This is a Wikipedia passage about gia carangi. Gia Marie Carangi (January 29, 1960 – November 18, 1986) was an American model during the late 1970s and early 1980s. Considered by some to be the first supermodel, she was featured on the cover of fashion magazines, including multiple editions of Vogue and Cosmopolitan, and appeared in advertising campaigns for such fashion houses as Armani, Christian Dior, Versace, and Yves Saint Laurent. Carangi's life was marred by drug addiction and depression, leading to her death from AIDS-related complications at the age of 26. She is considered to be one of the first famous women to die of the disease.", "labels": "Her life was the subject of the 1998 biographical television film Gia, starring Angelina Jolie in the title role.", "concept": "gia carangi"}, {"text": "This is a Wikipedia passage about nigel milsom. Nigel Milsom (born 1979) is an Australian artist. He is known for his large-scale figurative paintings, which often depict people from his local area in Sydney's western suburbs.", "labels": "His works are held in the collections of the Art Gallery of New South Wales, the National Gallery of Australia, and the Museum of Contemporary Art Australia.", "concept": "nigel milsom"}, {"text": "This is a Wikipedia passage about rod morgenstein. Rod Morgenstein (born April 18, 1959) is an American drummer, composer, and educator.", "labels": "He is best known for his work with the progressive rock band Winger, which he joined in 1987.", "concept": "rod morgenstein"}, {"text": "This is a Wikipedia passage about rod morgenstein. Rod Morgenstein (born April 18, 1959) is an American drummer, composer, and educator. He is best known for his work with the progressive rock band Winger, which he joined in 1987.", "labels": "He has also performed and recorded with Dixie Dregs, Steve Morse Band, Jordan Rudess, and many other artists.", "concept": "rod morgenstein"}, {"text": "This is a Wikipedia passage about rod morgenstein. Rod Morgenstein (born April 18, 1959) is an American drummer, composer, and educator. He is best known for his work with the progressive rock band Winger, which he joined in 1987. He has also performed and recorded with Dixie Dregs, Steve Morse Band, Jordan Rudess, and many other artists. Morgenstein began playing drums at the age of nine, and by the time he was in high school, he was playing professionally. He attended the Berklee College of Music in Boston, Massachusetts, where he studied with drummers Alan Dawson and Joe Hunt. After graduating in 1981, he moved to Atlanta, Georgia, where he joined the Dixie Dregs.", "labels": "He has since toured and recorded with the band on several occasions.", "concept": "rod morgenstein"}, {"text": "This is a Wikipedia passage about rod morgenstein. Rod Morgenstein (born April 18, 1959) is an American drummer, composer, and educator. He is best known for his work with the progressive rock band Winger, which he joined in 1987. He has also performed and recorded with Dixie Dregs, Steve Morse Band, Jordan Rudess, and many other artists. Morgenstein began playing drums at the age of nine, and by the time he was in high school, he was playing professionally. He attended the Berklee College of Music in Boston, Massachusetts, where he studied with drummers Alan Dawson and Joe Hunt. After graduating in 1981, he moved to Atlanta, Georgia, where he joined the Dixie Dregs. He has since toured and recorded with the band on several occasions.", "labels": "In 1987, Morgenstein joined Winger, with whom he has recorded six studio albums and toured extensively.", "concept": "rod morgenstein"}, {"text": "This is a Wikipedia passage about rod morgenstein. Rod Morgenstein (born April 18, 1959) is an American drummer, composer, and educator. He is best known for his work with the progressive rock band Winger, which he joined in 1987. He has also performed and recorded with Dixie Dregs, Steve Morse Band, Jordan Rudess, and many other artists. Morgenstein began playing drums at the age of nine, and by the time he was in high school, he was playing professionally. He attended the Berklee College of Music in Boston, Massachusetts, where he studied with drummers Alan Dawson and Joe Hunt. After graduating in 1981, he moved to Atlanta, Georgia, where he joined the Dixie Dregs. He has since toured and recorded with the band on several occasions. In 1987, Morgenstein joined Winger, with whom he has recorded six studio albums and toured extensively. He has also released two solo albums, The Rod Morgenstein Project (1995) and Rod Morgenstein's Winger (1998).", "labels": "In addition to his work with Winger, he has also performed and recorded with Steve Morse Band, Jordan Rudess, and many other artists", "concept": "rod morgenstein"}, {"text": "This is a Wikipedia passage about terry alderman. Terry Alderman (born 28 April 1952) is a former Australian cricketer who played in 41 Tests and 53 One Day Internationals between 1979 and 1991.", "labels": "He was a right-arm fast-medium bowler and a right-handed batsman.", "concept": "terry alderman"}, {"text": "This is a Wikipedia passage about frank a. mclain. Frank A. McLain (1890–1962) was an American lawyer and politician from the state of Florida. He served as a member of the Florida House of Representatives from 1923 to 1925, and as a member of the Florida Senate from 1925 to 1929.", "labels": "He was a member of the Democratic Party.", "concept": "frank a. mclain"}, {"text": "This is a Wikipedia passage about rich williams. Rich Williams (born Richard Williams, October 19, 1949) is an American guitarist, singer, songwriter, and record producer.", "labels": "He is best known as the lead guitarist and a founding member of the rock band Kansas.", "concept": "rich williams"}, {"text": "This is a Wikipedia passage about rich williams. Rich Williams (born Richard Williams, October 19, 1949) is an American guitarist, singer, songwriter, and record producer. He is best known as the lead guitarist and a founding member of the rock band Kansas. Williams has been with the band since its inception in 1973 and is the only original member still with the group.", "labels": "He has written or co-written several of the band's biggest hits, including \"Carry On Wayward Son\" and \"Dust in the Wind\".", "concept": "rich williams"}, {"text": "This is a Wikipedia passage about rich williams. Rich Williams (born Richard Williams, October 19, 1949) is an American guitarist, singer, songwriter, and record producer. He is best known as the lead guitarist and a founding member of the rock band Kansas. Williams has been with the band since its inception in 1973 and is the only original member still with the group. He has written or co-written several of the band's biggest hits, including \"Carry On Wayward Son\" and \"Dust in the Wind\".", "labels": "He has also released several solo albums and collaborated with other artists.", "concept": "rich williams"}, {"text": "This is a Wikipedia passage about torry castellano. Torry Castellano (born August 21, 1979) is an American musician, best known as the drummer for the punk rock band The Donnas.", "labels": "She was born in Los Angeles, California and grew up in the San Francisco Bay Area.", "concept": "torry castellano"}, {"text": "This is a Wikipedia passage about torry castellano. Torry Castellano (born August 21, 1979) is an American musician, best known as the drummer for the punk rock band The Donnas. She was born in Los Angeles, California and grew up in the San Francisco Bay Area.", "labels": "Castellano began playing drums at the age of 11, and joined The Donnas in 1993, when she was 14.", "concept": "torry castellano"}, {"text": "This is a Wikipedia passage about thomas harriot. ", "labels": "Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about thomas harriot. Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries.", "labels": "He is sometimes credited with the introduction of the potato to the British Isles.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about thomas harriot. Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries. He is sometimes credited with the introduction of the potato to the British Isles.", "labels": "Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about thomas harriot. Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries. He is sometimes credited with the introduction of the potato to the British Isles. Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo.", "labels": "He was an important figure in the scientific revolution of the 17th century.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about thomas harriot. Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries. He is sometimes credited with the introduction of the potato to the British Isles. Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo. He was an important figure in the scientific revolution of the 17th century. Harriot was born in Oxford in 1560 and educated at St Mary Hall, Oxford, and later at the University of Padua.", "labels": "He studied mathematics, astronomy, optics, and navigation.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about thomas harriot. Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries. He is sometimes credited with the introduction of the potato to the British Isles. Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo. He was an important figure in the scientific revolution of the 17th century. Harriot was born in Oxford in 1560 and educated at St Mary Hall, Oxford, and later at the University of Padua. He studied mathematics, astronomy, optics, and navigation.", "labels": "He was employed by Sir Walter Raleigh to lead an expedition to the New World in 1585, and he made observations of the flora, fauna, and native peoples of the area.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about thomas harriot. Thomas Harriot (c. 1560 – 2 July 1621) was an English astronomer, mathematician, ethnographer and translator who made advances within the scientific field during the late 16th and early 17th centuries. He is sometimes credited with the introduction of the potato to the British Isles. Harriot was the first person to make a drawing of the Moon through a telescope, on 26 July 1609, over four months before Galileo. He was an important figure in the scientific revolution of the 17th century. Harriot was born in Oxford in 1560 and educated at St Mary Hall, Oxford, and later at the University of Padua. He studied mathematics, astronomy, optics, and navigation. He was employed by Sir Walter Raleigh to lead an expedition to the New World in 1585, and he made observations of the flora, fauna, and native peoples of the area.", "labels": "He also made astronomical observations of the Moon and stars, and wrote a treatise on navigation.", "concept": "thomas harriot"}, {"text": "This is a Wikipedia passage about tadeusz szeligowski. Tadeusz Szeligowski (1896–1963) was a Polish composer, conductor, and music teacher. He was born in the small town of Łańcut, in the south-eastern part of Poland. He studied at the Lviv Conservatory and the Warsaw Conservatory, and later at the Paris Conservatory. He was a professor at the Warsaw Conservatory from 1929 to 1939.", "labels": "Szeligowski was a prolific composer, writing in a variety of genres, including symphonies, concertos, chamber music, and vocal works.", "concept": "tadeusz szeligowski"}, {"text": "This is a Wikipedia passage about gordon strachan. ", "labels": "Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about gordon strachan. Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player.", "labels": "He is the manager of the Scotland national team.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about gordon strachan. Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player. He is the manager of the Scotland national team.", "labels": "Strachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about gordon strachan. Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player. He is the manager of the Scotland national team. Strachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team.", "labels": "He has also managed Coventry City, Southampton, Celtic and Middlesbrough.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about gordon strachan. Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player. He is the manager of the Scotland national team. Strachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has also managed Coventry City, Southampton, Celtic and Middlesbrough. Strachan began his managerial career at Coventry City in 1996, leading them to the 1997 FA Cup Final, where they lost to Tottenham Hotspur.", "labels": "He then moved to Southampton in 2001, where he guided them to the 2003 FA Cup Final, which they lost to Arsenal.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about gordon strachan. Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player. He is the manager of the Scotland national team. Strachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has also managed Coventry City, Southampton, Celtic and Middlesbrough. Strachan began his managerial career at Coventry City in 1996, leading them to the 1997 FA Cup Final, where they lost to Tottenham Hotspur. He then moved to Southampton in 2001, where he guided them to the 2003 FA Cup Final, which they lost to Arsenal.", "labels": "In 2005, he was appointed manager of Celtic, where he won three consecutive Scottish Premier League titles and the Scottish League Cup twice.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about gordon strachan. Gordon David Strachan (born 9 February 1957) is a Scottish football manager and former player. He is the manager of the Scotland national team. Strachan played for Dundee, Aberdeen, Manchester United, Leeds United and Coventry City, as well as the Scotland national team. He has also managed Coventry City, Southampton, Celtic and Middlesbrough. Strachan began his managerial career at Coventry City in 1996, leading them to the 1997 FA Cup Final, where they lost to Tottenham Hotspur. He then moved to Southampton in 2001, where he guided them to the 2003 FA Cup Final, which they lost to Arsenal. In 2005, he was appointed manager of Celtic, where he won three consecutive Scottish Premier League titles and the Scottish League Cup twice. He left Celtic in 2009 and was appointed manager of Middlesbrough in October 2010. He left Middlesbrough in October 2013.", "labels": "In January 2013, Strachan was appointed manager of the Scotland national team.", "concept": "gordon strachan"}, {"text": "This is a Wikipedia passage about steven threet. Steven Threet (born August 8, 1985) is a former American football quarterback.", "labels": "He played college football at the University of Michigan and Arizona State University.", "concept": "steven threet"}, {"text": "This is a Wikipedia passage about adja yunkers. Adja Yunkers (1921–1983) was a Latvian-born American artist and designer. He was born in Riga, Latvia, and studied at the Academy of Fine Arts in Riga. He moved to the United States in 1949 and settled in New York City.", "labels": "Yunkers was a prolific artist, working in a variety of media including painting, sculpture, photography, and printmaking.", "concept": "adja yunkers"}, {"text": "This is a Wikipedia passage about king zhuang of chu. \"Zhuang of Chu (died 621 BC) was the last ruler of the state of Chu during the Spring and Autumn period of ancient China. He was the son of King Huai of Chu and the younger brother of King Huai II. He succeeded his brother in 613 BC and reigned until his death in 621 BC. During his reign, Zhuang of Chu faced numerous challenges from the other states of the Zhou dynasty. He was forced to cede territory to the state of Jin and was defeated by the state of Qin in 614 BC. He also faced internal strife from his own ministers, who were divided into two factions.", "labels": "Despite these challenges, Zhuang of Chu was able to maintain the independence of Chu and kept it from being annexed by the other states.", "concept": "king zhuang of chu"}, {"text": "This is a Wikipedia passage about king zhuang of chu. \"Zhuang of Chu (died 621 BC) was the last ruler of the state of Chu during the Spring and Autumn period of ancient China. He was the son of King Huai of Chu and the younger brother of King Huai II. He succeeded his brother in 613 BC and reigned until his death in 621 BC. During his reign, Zhuang of Chu faced numerous challenges from the other states of the Zhou dynasty. He was forced to cede territory to the state of Jin and was defeated by the state of Qin in 614 BC. He also faced internal strife from his own ministers, who were divided into two factions. Despite these challenges, Zhuang of Chu was able to maintain the independence of Chu and kept it from being annexed by the other states.", "labels": "He was also able to expand Chu's territory and strengthen its economy.", "concept": "king zhuang of chu"}, {"text": "This is a Wikipedia passage about king zhuang of chu. \"Zhuang of Chu (died 621 BC) was the last ruler of the state of Chu during the Spring and Autumn period of ancient China. He was the son of King Huai of Chu and the younger brother of King Huai II. He succeeded his brother in 613 BC and reigned until his death in 621 BC. During his reign, Zhuang of Chu faced numerous challenges from the other states of the Zhou dynasty. He was forced to cede territory to the state of Jin and was defeated by the state of Qin in 614 BC. He also faced internal strife from his own ministers, who were divided into two factions. Despite these challenges, Zhuang of Chu was able to maintain the independence of Chu and kept it from being annexed by the other states. He was also able to expand Chu's territory and strengthen its economy.", "labels": "Zhuang of Chu was a wise and capable ruler who was respected by his contemporaries.", "concept": "king zhuang of chu"}, {"text": "This is a Wikipedia passage about king zhuang of chu. \"Zhuang of Chu (died 621 BC) was the last ruler of the state of Chu during the Spring and Autumn period of ancient China. He was the son of King Huai of Chu and the younger brother of King Huai II. He succeeded his brother in 613 BC and reigned until his death in 621 BC. During his reign, Zhuang of Chu faced numerous challenges from the other states of the Zhou dynasty. He was forced to cede territory to the state of Jin and was defeated by the state of Qin in 614 BC. He also faced internal strife from his own ministers, who were divided into two factions. Despite these challenges, Zhuang of Chu was able to maintain the independence of Chu and kept it from being annexed by the other states. He was also able to expand Chu's territory and strengthen its economy. Zhuang of Chu was a wise and capable ruler who was respected by his contemporaries.", "labels": "He was known for his generosity and kindness, and was praised for his ability to maintain peace and stability in Chu.", "concept": "king zhuang of chu"}, {"text": "This is a Wikipedia passage about k. s. manilal. K. S. Manilal (1925–2006) was an Indian botanist and plant taxonomist who specialized in the study of the flora of the Western Ghats.", "labels": "He was a professor at the University of Calicut and the founder of the Centre for Advanced Studies in Botany at the University.", "concept": "k. s. manilal"}, {"text": "This is a Wikipedia passage about k. s. manilal. K. S. Manilal (1925–2006) was an Indian botanist and plant taxonomist who specialized in the study of the flora of the Western Ghats. He was a professor at the University of Calicut and the founder of the Centre for Advanced Studies in Botany at the University. He was a Fellow of the Indian Academy of Sciences and the Indian National Science Academy.", "labels": "He was also a recipient of the Padma Shri, the fourth highest civilian award in India.", "concept": "k. s. manilal"}, {"text": "This is a Wikipedia passage about k. s. manilal. K. S. Manilal (1925–2006) was an Indian botanist and plant taxonomist who specialized in the study of the flora of the Western Ghats. He was a professor at the University of Calicut and the founder of the Centre for Advanced Studies in Botany at the University. He was a Fellow of the Indian Academy of Sciences and the Indian National Science Academy. He was also a recipient of the Padma Shri, the fourth highest civilian award in India. Manilal was born in 1925 in the village of Kallar in Kerala. He obtained his B.Sc. degree from the University of Madras in 1945 and his M.Sc. degree from the University of Kerala in 1947. He then joined the University of Calicut as a lecturer in Botany in 1948. He was promoted to professor in 1962 and served as the Head of the Department of Botany from 1965 to 1975.", "labels": "He was also the founder of the Centre for Advanced Studies in Botany at the University.", "concept": "k. s. manilal"}, {"text": "This is a Wikipedia passage about k. s. manilal. K. S. Manilal (1925–2006) was an Indian botanist and plant taxonomist who specialized in the study of the flora of the Western Ghats. He was a professor at the University of Calicut and the founder of the Centre for Advanced Studies in Botany at the University. He was a Fellow of the Indian Academy of Sciences and the Indian National Science Academy. He was also a recipient of the Padma Shri, the fourth highest civilian award in India. Manilal was born in 1925 in the village of Kallar in Kerala. He obtained his B.Sc. degree from the University of Madras in 1945 and his M.Sc. degree from the University of Kerala in 1947. He then joined the University of Calicut as a lecturer in Botany in 1948. He was promoted to professor in 1962 and served as the Head of the Department of Botany from 1965 to 1975. He was also the founder of the Centre for Advanced Studies in Botany at the University.", "labels": "Manilal was a prolific researcher and published over 200 research papers in various journals.", "concept": "k. s. manilal"}, {"text": "This is a Wikipedia passage about seyi shay. ", "labels": "Seyi Shay (born Deborah Oluwaseyi Joshua; 21 December 1985) is a Nigerian singer, songwriter, and actress.", "concept": "seyi shay"}, {"text": "This is a Wikipedia passage about seyi shay. Seyi Shay (born Deborah Oluwaseyi Joshua; 21 December 1985) is a Nigerian singer, songwriter, and actress. She started her career as a backup singer for various artists, and released her debut studio album, Seyi or Shay, in 2014. The album spawned the hit single \"Irawo\", which earned her two nominations at the 2015 Nigeria Entertainment Awards.", "labels": "She has since released several singles, including \"Yolo Yolo\", \"Right Now\", and \"Gimme Love\".", "concept": "seyi shay"}, {"text": "This is a Wikipedia passage about seyi shay. Seyi Shay (born Deborah Oluwaseyi Joshua; 21 December 1985) is a Nigerian singer, songwriter, and actress. She started her career as a backup singer for various artists, and released her debut studio album, Seyi or Shay, in 2014. The album spawned the hit single \"Irawo\", which earned her two nominations at the 2015 Nigeria Entertainment Awards. She has since released several singles, including \"Yolo Yolo\", \"Right Now\", and \"Gimme Love\".", "labels": "She has collaborated with several artists, including Wizkid, Olamide, and Runtown.", "concept": "seyi shay"}, {"text": "This is a Wikipedia passage about hilda kuper. Hilda Kuper (1908–2002) was a South African anthropologist and author. She was born in Johannesburg, South Africa, and studied at the University of the Witwatersrand, where she obtained a B.A. in English and History in 1929.", "labels": "She then went on to study anthropology at the London School of Economics, where she obtained a Ph.D. in 1936.", "concept": "hilda kuper"}, {"text": "This is a Wikipedia passage about stuart scott. ", "labels": "Stuart Scott (July 19, 1965 – January 4, 2015) was an American sportscaster and anchor on ESPN, most notably on the network's SportsCenter.", "concept": "stuart scott"}, {"text": "This is a Wikipedia passage about stuart scott. Stuart Scott (July 19, 1965 – January 4, 2015) was an American sportscaster and anchor on ESPN, most notably on the network's SportsCenter.", "labels": "Well known for his hip-hop style and use of catchphrases such as \"Boo-yah!\"", "concept": "stuart scott"}, {"text": "This is a Wikipedia passage about stuart scott. Stuart Scott (July 19, 1965 – January 4, 2015) was an American sportscaster and anchor on ESPN, most notably on the network's SportsCenter. Well known for his hip-hop style and use of catchphrases such as \"Boo-yah!\"", "labels": "and \"As cool as the other side of the pillow\", Scott was a regular presence on SportsCenter from 1993 until his death in 2015.", "concept": "stuart scott"}, {"text": "This is a Wikipedia passage about stuart scott. Stuart Scott (July 19, 1965 – January 4, 2015) was an American sportscaster and anchor on ESPN, most notably on the network's SportsCenter. Well known for his hip-hop style and use of catchphrases such as \"Boo-yah!\" and \"As cool as the other side of the pillow\", Scott was a regular presence on SportsCenter from 1993 until his death in 2015.", "labels": "He was also a contributor to ESPN's Sunday NFL Countdown, NBA Countdown and Baseball Tonight.", "concept": "stuart scott"}, {"text": "This is a Wikipedia passage about stuart scott. Stuart Scott (July 19, 1965 – January 4, 2015) was an American sportscaster and anchor on ESPN, most notably on the network's SportsCenter. Well known for his hip-hop style and use of catchphrases such as \"Boo-yah!\" and \"As cool as the other side of the pillow\", Scott was a regular presence on SportsCenter from 1993 until his death in 2015. He was also a contributor to ESPN's Sunday NFL Countdown, NBA Countdown and Baseball Tonight.", "labels": "He was honored with the Jimmy V Award for Perseverance at the 2014 ESPY Awards.", "concept": "stuart scott"}, {"text": "This is a Wikipedia passage about philippe dodard. ", "labels": "Philippe Dodard (born in 1954 in Port-au-Prince, Haiti) is a Haitian artist, sculptor, and painter.", "concept": "philippe dodard"}, {"text": "This is a Wikipedia passage about philippe dodard. Philippe Dodard (born in 1954 in Port-au-Prince, Haiti) is a Haitian artist, sculptor, and painter.", "labels": "He is known for his vibrant and colorful works that often depict Haitian culture and history.", "concept": "philippe dodard"}, {"text": "This is a Wikipedia passage about philippe dodard. Philippe Dodard (born in 1954 in Port-au-Prince, Haiti) is a Haitian artist, sculptor, and painter. He is known for his vibrant and colorful works that often depict Haitian culture and history.", "labels": "He is considered one of the most important contemporary Haitian artists.", "concept": "philippe dodard"}, {"text": "This is a Wikipedia passage about philippe dodard. Philippe Dodard (born in 1954 in Port-au-Prince, Haiti) is a Haitian artist, sculptor, and painter. He is known for his vibrant and colorful works that often depict Haitian culture and history. He is considered one of the most important contemporary Haitian artists. Dodard studied at the École des Beaux-Arts in Port-au-Prince and the École des Beaux-Arts in Paris. He has exhibited his work in numerous galleries and museums around the world, including the Centre d'Art in Port-au-Prince, the Museum of Modern Art in New York, and the Musée d'Art Moderne in Paris. Dodard's work is often inspired by Haitian folklore and mythology, as well as the country's history and culture. He often uses bright colors and bold shapes to create powerful images that evoke emotion and tell stories.", "labels": "He has also created sculptures and installations that explore the relationship between art and nature.", "concept": "philippe dodard"}, {"text": "This is a Wikipedia passage about mackenzie caquatto. Mackenzie Caquatto (born August 20, 1994) is an American former artistic gymnast. She was a member of the U.S. Women's Gymnastics team, and competed at the 2012 Summer Olympics in London.", "labels": "Caquatto was born in Naperville, Illinois, and began gymnastics at the age of three.", "concept": "mackenzie caquatto"}, {"text": "This is a Wikipedia passage about mackenzie caquatto. Mackenzie Caquatto (born August 20, 1994) is an American former artistic gymnast. She was a member of the U.S. Women's Gymnastics team, and competed at the 2012 Summer Olympics in London. Caquatto was born in Naperville, Illinois, and began gymnastics at the age of three. She trained at Legacy Elite Gymnastics in Aurora, Illinois, under coaches Mike and Kristen Maloney.", "labels": "She was a member of the U.S. National Team from 2009 to 2012.", "concept": "mackenzie caquatto"}, {"text": "This is a Wikipedia passage about lionel aldridge. Lionel Aldridge (born October 28, 1940) is a former American football player.", "labels": "He played defensive end for the Green Bay Packers of the National Football League (NFL) from 1963 to 1971.", "concept": "lionel aldridge"}, {"text": "This is a Wikipedia passage about lionel aldridge. Lionel Aldridge (born October 28, 1940) is a former American football player. He played defensive end for the Green Bay Packers of the National Football League (NFL) from 1963 to 1971.", "labels": "He was a member of the Packers teams that won three consecutive NFL championships from 1965 to 1967 and the first two Super Bowls in 1967 and 1968.", "concept": "lionel aldridge"}, {"text": "This is a Wikipedia passage about irena sendler. ", "labels": "Irena Sendler (née Krzyżanowska; 15 February 1910 – 12 May 2008) was a Polish nurse, social worker, and humanitarian who served in the Polish Underground Resistance during World War II in German-occupied Warsaw.", "concept": "irena sendler"}, {"text": "This is a Wikipedia passage about irena sendler. Irena Sendler (née Krzyżanowska; 15 February 1910 – 12 May 2008) was a Polish nurse, social worker, and humanitarian who served in the Polish Underground Resistance during World War II in German-occupied Warsaw.", "labels": "She was part of the Polish Underground's Żegota resistance organization, and was responsible for saving the lives of 2,500 Jewish children by smuggling them out of the Warsaw Ghetto and providing them with false identity documents and shelter in individual and group children's homes in the city.", "concept": "irena sendler"}, {"text": "This is a Wikipedia passage about irena sendler. Irena Sendler (née Krzyżanowska; 15 February 1910 – 12 May 2008) was a Polish nurse, social worker, and humanitarian who served in the Polish Underground Resistance during World War II in German-occupied Warsaw. She was part of the Polish Underground's Żegota resistance organization, and was responsible for saving the lives of 2,500 Jewish children by smuggling them out of the Warsaw Ghetto and providing them with false identity documents and shelter in individual and group children's homes in the city.", "labels": "She was nominated for the Nobel Peace Prize in 2007.", "concept": "irena sendler"}, {"text": "This is a Wikipedia passage about ronnie barker. ", "labels": "Ronald William George Barker, OBE (25 September 1929 – 3 October 2005), was an English actor, comedian, and writer.", "concept": "ronnie barker"}, {"text": "This is a Wikipedia passage about ronnie barker. Ronald William George Barker, OBE (25 September 1929 – 3 October 2005), was an English actor, comedian, and writer.", "labels": "He was known for roles in British comedy television series such as Porridge, The Two Ronnies, and Open All Hours.", "concept": "ronnie barker"}, {"text": "This is a Wikipedia passage about ronnie barker. Ronald William George Barker, OBE (25 September 1929 – 3 October 2005), was an English actor, comedian, and writer. He was known for roles in British comedy television series such as Porridge, The Two Ronnies, and Open All Hours. Barker's acting career began in repertory theatre and, in the early 1960s, he appeared in several episodes of the BBC's police series Z-Cars. He also had minor roles in films such as The Magnificent Seven (1960) and The Wrong Arm of the Law (1963).", "labels": "In 1965, he was cast in the lead role of the BBC's sitcom The Frost Report, which also featured John Cleese, Ronnie Corbett, and other future stars of British comedy.", "concept": "ronnie barker"}, {"text": "This is a Wikipedia passage about ronnie barker. Ronald William George Barker, OBE (25 September 1929 – 3 October 2005), was an English actor, comedian, and writer. He was known for roles in British comedy television series such as Porridge, The Two Ronnies, and Open All Hours. Barker's acting career began in repertory theatre and, in the early 1960s, he appeared in several episodes of the BBC's police series Z-Cars. He also had minor roles in films such as The Magnificent Seven (1960) and The Wrong Arm of the Law (1963). In 1965, he was cast in the lead role of the BBC's sitcom The Frost Report, which also featured John Cleese, Ronnie Corbett, and other future stars of British comedy.", "labels": "Barker's career reached its peak in the 1970s with the BBC sketch show The Two Ronnies, which he co-wrote and performed with Ronnie Corbett.", "concept": "ronnie barker"}, {"text": "This is a Wikipedia passage about ronnie barker. Ronald William George Barker, OBE (25 September 1929 – 3 October 2005), was an English actor, comedian, and writer. He was known for roles in British comedy television series such as Porridge, The Two Ronnies, and Open All Hours. Barker's acting career began in repertory theatre and, in the early 1960s, he appeared in several episodes of the BBC's police series Z-Cars. He also had minor roles in films such as The Magnificent Seven (1960) and The Wrong Arm of the Law (1963). In 1965, he was cast in the lead role of the BBC's sitcom The Frost Report, which also featured John Cleese, Ronnie Corbett, and other future stars of British comedy. Barker's career reached its peak in the 1970s with the BBC sketch show The Two Ronnies, which he co-wrote and performed with Ronnie Corbett.", "labels": "The show ran for 16 years and earned Barker two BAFTA awards.", "concept": "ronnie barker"}, {"text": "This is a Wikipedia passage about honoré iii , prince of monaco. Honoré III (14 October 1720 – 15 February 1795) was Prince of Monaco from 1731 to 1793.", "labels": "He was born in Paris, the son of Jacques I, Prince of Monaco, and his wife, Louise Hippolyte Grimaldi.", "concept": "honoré iii , prince of monaco"}, {"text": "This is a Wikipedia passage about tom izzo. ", "labels": "Tom Izzo (born January 30, 1955) is an American college basketball coach.", "concept": "tom izzo"}, {"text": "This is a Wikipedia passage about tom izzo. Tom Izzo (born January 30, 1955) is an American college basketball coach.", "labels": "He has been the head coach for the Michigan State Spartans men's basketball team since 1995.", "concept": "tom izzo"}, {"text": "This is a Wikipedia passage about tom izzo. Tom Izzo (born January 30, 1955) is an American college basketball coach. He has been the head coach for the Michigan State Spartans men's basketball team since 1995. Under Izzo, the Spartans have won one national championship (in 2000), eight Big Ten Conference championships, and made seven Final Four appearances, including five in a row from 1999 to 2003.", "labels": "He was elected to the Naismith Basketball Hall of Fame in 2016.", "concept": "tom izzo"}, {"text": "This is a Wikipedia passage about tom izzo. Tom Izzo (born January 30, 1955) is an American college basketball coach. He has been the head coach for the Michigan State Spartans men's basketball team since 1995. Under Izzo, the Spartans have won one national championship (in 2000), eight Big Ten Conference championships, and made seven Final Four appearances, including five in a row from 1999 to 2003. He was elected to the Naismith Basketball Hall of Fame in 2016.", "labels": "Izzo is considered one of the most successful and respected college basketball coaches of all time.", "concept": "tom izzo"}, {"text": "This is a Wikipedia passage about tommy nutter. ", "labels": "Tommy Nutter (1943–1992) was a British tailor who was a major figure in the fashion world of the late 1960s and early 1970s.", "concept": "tommy nutter"}, {"text": "This is a Wikipedia passage about tommy nutter. Tommy Nutter (1943–1992) was a British tailor who was a major figure in the fashion world of the late 1960s and early 1970s.", "labels": "He was known for his flamboyant style and his work with the Rolling Stones, Elton John, and other celebrities.", "concept": "tommy nutter"}, {"text": "This is a Wikipedia passage about tommy nutter. Tommy Nutter (1943–1992) was a British tailor who was a major figure in the fashion world of the late 1960s and early 1970s. He was known for his flamboyant style and his work with the Rolling Stones, Elton John, and other celebrities. He was born in London and began his career as an apprentice tailor at the age of 15.", "labels": "He opened his own shop, Nutters of Savile Row, in 1969.", "concept": "tommy nutter"}, {"text": "This is a Wikipedia passage about tommy nutter. Tommy Nutter (1943–1992) was a British tailor who was a major figure in the fashion world of the late 1960s and early 1970s. He was known for his flamboyant style and his work with the Rolling Stones, Elton John, and other celebrities. He was born in London and began his career as an apprentice tailor at the age of 15. He opened his own shop, Nutters of Savile Row, in 1969.", "labels": "His designs were known for their bold colors and patterns, and he was one of the first to introduce the \"peacock look\" to men's fashion.", "concept": "tommy nutter"}, {"text": "This is a Wikipedia passage about tommy nutter. Tommy Nutter (1943–1992) was a British tailor who was a major figure in the fashion world of the late 1960s and early 1970s. He was known for his flamboyant style and his work with the Rolling Stones, Elton John, and other celebrities. He was born in London and began his career as an apprentice tailor at the age of 15. He opened his own shop, Nutters of Savile Row, in 1969. His designs were known for their bold colors and patterns, and he was one of the first to introduce the \"peacock look\" to men's fashion.", "labels": "He was also one of the first to use denim in men's suits.", "concept": "tommy nutter"}, {"text": "This is a Wikipedia passage about tommy nutter. Tommy Nutter (1943–1992) was a British tailor who was a major figure in the fashion world of the late 1960s and early 1970s. He was known for his flamboyant style and his work with the Rolling Stones, Elton John, and other celebrities. He was born in London and began his career as an apprentice tailor at the age of 15. He opened his own shop, Nutters of Savile Row, in 1969. His designs were known for their bold colors and patterns, and he was one of the first to introduce the \"peacock look\" to men's fashion. He was also one of the first to use denim in men's suits. He was a major influence on the punk and new wave fashion movements of the late 1970s and early 1980s.", "labels": "He died of AIDS-related complications in 1992.", "concept": "tommy nutter"}, {"text": "This is a Wikipedia passage about jearl walker. ", "labels": "Jearl Walker (born July 25, 1945) is an American physicist and author.", "concept": "jearl walker"}, {"text": "This is a Wikipedia passage about jearl walker. Jearl Walker (born July 25, 1945) is an American physicist and author.", "labels": "He is a professor emeritus of physics at Cleveland State University and a Fellow of the American Physical Society.", "concept": "jearl walker"}, {"text": "This is a Wikipedia passage about jearl walker. Jearl Walker (born July 25, 1945) is an American physicist and author. He is a professor emeritus of physics at Cleveland State University and a Fellow of the American Physical Society.", "labels": "He is best known for his popular science books on physics, including The Flying Circus of Physics, The Amateur Scientist, and The Physics Teacher.", "concept": "jearl walker"}, {"text": "This is a Wikipedia passage about jearl walker. Jearl Walker (born July 25, 1945) is an American physicist and author. He is a professor emeritus of physics at Cleveland State University and a Fellow of the American Physical Society. He is best known for his popular science books on physics, including The Flying Circus of Physics, The Amateur Scientist, and The Physics Teacher. He has also written several textbooks on physics, including Fundamentals of Physics and The Physics of Everyday Phenomena. Walker has appeared on television and radio programs, including the PBS series Scientific American Frontiers and the BBC program Horizon.", "labels": "He has also written articles for Scientific American and other magazines.", "concept": "jearl walker"}, {"text": "This is a Wikipedia passage about tera van beilen. Tera Van Beilen (born April 28, 1992) is a Canadian competitive swimmer. She won a bronze medal in the 100-metre breaststroke at the 2012 Summer Olympics in London. She also won a gold medal in the 4×100-metre medley relay at the 2011 Pan American Games in Guadalajara, Mexico. Van Beilen was born in Oakville, Ontario.", "labels": "She began swimming at the age of five and was a member of the Oakville Aquatic Club.", "concept": "tera van beilen"}, {"text": "This is a Wikipedia passage about tera van beilen. Tera Van Beilen (born April 28, 1992) is a Canadian competitive swimmer. She won a bronze medal in the 100-metre breaststroke at the 2012 Summer Olympics in London. She also won a gold medal in the 4×100-metre medley relay at the 2011 Pan American Games in Guadalajara, Mexico. Van Beilen was born in Oakville, Ontario. She began swimming at the age of five and was a member of the Oakville Aquatic Club. She attended White Oaks Secondary School in Oakville.", "labels": "She is currently a student at the University of British Columbia.", "concept": "tera van beilen"}, {"text": "This is a Wikipedia passage about david kappos. David Kappos (born December 28, 1958) is an American lawyer and former Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office (USPTO).", "labels": "He was appointed by President Barack Obama on August 7, 2009, and sworn in on August 13, 2009.", "concept": "david kappos"}, {"text": "This is a Wikipedia passage about david kappos. David Kappos (born December 28, 1958) is an American lawyer and former Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office (USPTO). He was appointed by President Barack Obama on August 7, 2009, and sworn in on August 13, 2009.", "labels": "He served until February 2013.", "concept": "david kappos"}, {"text": "This is a Wikipedia passage about david kappos. David Kappos (born December 28, 1958) is an American lawyer and former Under Secretary of Commerce for Intellectual Property and Director of the United States Patent and Trademark Office (USPTO). He was appointed by President Barack Obama on August 7, 2009, and sworn in on August 13, 2009. He served until February 2013. Kappos was born in 1958 in New York City. He received a Bachelor of Science degree in electrical engineering from Rensselaer Polytechnic Institute in 1980 and a Juris Doctor degree from the University of Virginia School of Law in 1983.", "labels": "He is a member of the New York Bar.", "concept": "david kappos"}, {"text": "This is a Wikipedia passage about pattern is movement. ", "labels": "Pattern is Movement is an American indie rock band from Philadelphia, Pennsylvania.", "concept": "pattern is movement"}, {"text": "This is a Wikipedia passage about pattern is movement. Pattern is Movement is an American indie rock band from Philadelphia, Pennsylvania.", "labels": "The band consists of Andrew Thiboldeaux (vocals, guitar, drums, percussion, keyboards) and Chris Ward (vocals, bass, guitar, keyboards).", "concept": "pattern is movement"}, {"text": "This is a Wikipedia passage about pattern is movement. Pattern is Movement is an American indie rock band from Philadelphia, Pennsylvania. The band consists of Andrew Thiboldeaux (vocals, guitar, drums, percussion, keyboards) and Chris Ward (vocals, bass, guitar, keyboards).", "labels": "The band has released four full-length albums, two EPs, and several singles.", "concept": "pattern is movement"}, {"text": "This is a Wikipedia passage about kévin gameiro. ", "labels": "Kévin Gameiro (born 9 May 1987) is a French professional footballer who plays as a striker for Spanish club Valencia CF and the France national team.", "concept": "kévin gameiro"}, {"text": "This is a Wikipedia passage about kévin gameiro. Kévin Gameiro (born 9 May 1987) is a French professional footballer who plays as a striker for Spanish club Valencia CF and the France national team.", "labels": "He began his career at Strasbourg, before moving to Lorient in 2008.", "concept": "kévin gameiro"}, {"text": "This is a Wikipedia passage about kévin gameiro. Kévin Gameiro (born 9 May 1987) is a French professional footballer who plays as a striker for Spanish club Valencia CF and the France national team. He began his career at Strasbourg, before moving to Lorient in 2008. After two successful seasons at Lorient, he joined Paris Saint-Germain in 2011. He spent three seasons at the club, winning the Ligue 1 title in 2013. In 2014, he joined Sevilla, where he won the UEFA Europa League in 2015 and 2016. In 2017, he joined Atlético Madrid, before moving to Valencia in 2018.", "labels": "Gameiro has represented France at various youth levels, and made his senior international debut in 2010.", "concept": "kévin gameiro"}, {"text": "This is a Wikipedia passage about lee hsien loong. ", "labels": "Lee Hsien Loong (born 10 February 1952) is a Singaporean politician who is the current Prime Minister of Singapore.", "concept": "lee hsien loong"}, {"text": "This is a Wikipedia passage about lee hsien loong. Lee Hsien Loong (born 10 February 1952) is a Singaporean politician who is the current Prime Minister of Singapore.", "labels": "He took office on 12 August 2004, succeeding Goh Chok Tong.", "concept": "lee hsien loong"}, {"text": "This is a Wikipedia passage about lee hsien loong. Lee Hsien Loong (born 10 February 1952) is a Singaporean politician who is the current Prime Minister of Singapore. He took office on 12 August 2004, succeeding Goh Chok Tong.", "labels": "He is the eldest son of Singapore's first Prime Minister, Lee Kuan Yew.", "concept": "lee hsien loong"}, {"text": "This is a Wikipedia passage about lee hsien loong. Lee Hsien Loong (born 10 February 1952) is a Singaporean politician who is the current Prime Minister of Singapore. He took office on 12 August 2004, succeeding Goh Chok Tong. He is the eldest son of Singapore's first Prime Minister, Lee Kuan Yew.", "labels": "Lee is the Secretary-General of the People's Action Party (PAP), which has been the ruling party in Singapore since 1959.", "concept": "lee hsien loong"}, {"text": "This is a Wikipedia passage about lucien turcotte pacaud. Lucien Turcotte Pacaud (1890–1962) was a Canadian lawyer, politician, and judge.", "labels": "He was born in Montreal, Quebec, and studied law at Université Laval.", "concept": "lucien turcotte pacaud"}, {"text": "This is a Wikipedia passage about makiko esumi. Makiko Esumi (江角真紀子, Esumi Makiko, born April 8, 1965) is a Japanese actress and former fashion model. She is best known for her roles in the television series Gokusen (2002–2005) and Hanazakari no Kimitachi e (2007). She has also appeared in several films, including the award-winning Departures (2008). Esumi was born in Tokyo, Japan. She began her career as a fashion model in the 1980s, and made her acting debut in the television drama series Kaze no Naka no Shōjo (1991).", "labels": "She has since appeared in numerous television dramas, films, and stage productions.", "concept": "makiko esumi"}, {"text": "This is a Wikipedia passage about kate deines. Kate Deines (born April 15, 1988) is an American professional soccer player who currently plays for Reign FC of the National Women's Soccer League (NWSL).", "labels": "She previously played for the Seattle Sounders Women of the W-League, the Washington Spirit of the NWSL, and the Seattle Reign FC of the NWSL.", "concept": "kate deines"}, {"text": "This is a Wikipedia passage about kate deines. Kate Deines (born April 15, 1988) is an American professional soccer player who currently plays for Reign FC of the National Women's Soccer League (NWSL). She previously played for the Seattle Sounders Women of the W-League, the Washington Spirit of the NWSL, and the Seattle Reign FC of the NWSL. Deines was born in Seattle, Washington and attended Newport High School in Bellevue, Washington. She played college soccer at the University of Washington from 2006 to 2009.", "labels": "During her college career, she was named to the All-Pac-10 First Team in 2008 and 2009.", "concept": "kate deines"}, {"text": "This is a Wikipedia passage about kate deines. Kate Deines (born April 15, 1988) is an American professional soccer player who currently plays for Reign FC of the National Women's Soccer League (NWSL). She previously played for the Seattle Sounders Women of the W-League, the Washington Spirit of the NWSL, and the Seattle Reign FC of the NWSL. Deines was born in Seattle, Washington and attended Newport High School in Bellevue, Washington. She played college soccer at the University of Washington from 2006 to 2009. During her college career, she was named to the All-Pac-10 First Team in 2008 and 2009. Deines was drafted by the Washington Freedom in the 2010 WPS Draft. She made her professional debut on April 11, 2010, in a match against the Atlanta Beat. She played for the Freedom until the team folded in 2011.", "labels": "In 2012, Deines signed with the Seattle Sounders Women of the W-League.", "concept": "kate deines"}, {"text": "This is a Wikipedia passage about honoré iv , prince of monaco. Honoré IV (born Honoré Grimaldi; 14 November 1758 – 3 October 1819) was Prince of Monaco and Duke of Valentinois from 1795 to 1819.", "labels": "He was the son of Prince Honoré III and his wife, Maria Caterina Brignole.", "concept": "honoré iv , prince of monaco"}, {"text": "This is a Wikipedia passage about honoré iv , prince of monaco. Honoré IV (born Honoré Grimaldi; 14 November 1758 – 3 October 1819) was Prince of Monaco and Duke of Valentinois from 1795 to 1819. He was the son of Prince Honoré III and his wife, Maria Caterina Brignole. He was born in Paris, where his father was living in exile, and was baptized at the church of Saint-Sulpice.", "labels": "Honoré IV was a member of the House of Grimaldi, a Genoese family that had ruled Monaco since 1297.", "concept": "honoré iv , prince of monaco"}, {"text": "This is a Wikipedia passage about tristan rogers. ", "labels": "Tristan Rogers (born 3 June 1946) is an Australian actor.", "concept": "tristan rogers"}, {"text": "This is a Wikipedia passage about tristan rogers. Tristan Rogers (born 3 June 1946) is an Australian actor. He is best known for his roles as Robert Scorpio on the American daytime soap opera General Hospital, and as Colin Atkinson on the Australian soap opera The Young Doctors.", "labels": "Rogers was born in Melbourne, Australia.", "concept": "tristan rogers"}, {"text": "This is a Wikipedia passage about tristan rogers. Tristan Rogers (born 3 June 1946) is an Australian actor. He is best known for his roles as Robert Scorpio on the American daytime soap opera General Hospital, and as Colin Atkinson on the Australian soap opera The Young Doctors. Rogers was born in Melbourne, Australia. He began his career in the early 1970s, appearing in the Australian television series Homicide and Division 4. In 1976, he moved to the United States and began appearing in American television series, including The Rockford Files, Charlie's Angels, and Fantasy Island.", "labels": "In 1980, Rogers joined the cast of General Hospital as Robert Scorpio, a role he played until 1992.", "concept": "tristan rogers"}, {"text": "This is a Wikipedia passage about tristan rogers. Tristan Rogers (born 3 June 1946) is an Australian actor. He is best known for his roles as Robert Scorpio on the American daytime soap opera General Hospital, and as Colin Atkinson on the Australian soap opera The Young Doctors. Rogers was born in Melbourne, Australia. He began his career in the early 1970s, appearing in the Australian television series Homicide and Division 4. In 1976, he moved to the United States and began appearing in American television series, including The Rockford Files, Charlie's Angels, and Fantasy Island. In 1980, Rogers joined the cast of General Hospital as Robert Scorpio, a role he played until 1992. He returned to the show in 1995 and has been playing the role ever since.", "labels": "He also appeared in the spin-off series General Hospital: Night Shift.", "concept": "tristan rogers"}, {"text": "This is a Wikipedia passage about tristan rogers. Tristan Rogers (born 3 June 1946) is an Australian actor. He is best known for his roles as Robert Scorpio on the American daytime soap opera General Hospital, and as Colin Atkinson on the Australian soap opera The Young Doctors. Rogers was born in Melbourne, Australia. He began his career in the early 1970s, appearing in the Australian television series Homicide and Division 4. In 1976, he moved to the United States and began appearing in American television series, including The Rockford Files, Charlie's Angels, and Fantasy Island. In 1980, Rogers joined the cast of General Hospital as Robert Scorpio, a role he played until 1992. He returned to the show in 1995 and has been playing the role ever since. He also appeared in the spin-off series General Hospital: Night Shift.", "labels": "In addition to his work on General Hospital, Rogers has appeared in a number of other television series, including The Bold and the Beautiful, The Young and the Restless, and The Bay.", "concept": "tristan rogers"}, {"text": "This is a Wikipedia passage about john burnham cricketer. John Burnham (born 28 August 1845) was an English cricketer who played for Derbyshire between 1871 and 1876. Burnham was born in Derby, the son of John Burnham, a lace manufacturer. He was educated at Repton School and at Trinity College, Cambridge.", "labels": "He made his debut for Derbyshire in the 1871 season against Lancashire.", "concept": "john burnham cricketer"}, {"text": "This is a Wikipedia passage about nate saint. ", "labels": "Nate Saint (August 28, 1923 – January 8, 1956) was an American Christian missionary pilot and one of five martyrs killed while attempting to evangelize the Huaorani people of eastern Ecuador.", "concept": "nate saint"}, {"text": "This is a Wikipedia passage about nate saint. Nate Saint (August 28, 1923 – January 8, 1956) was an American Christian missionary pilot and one of five martyrs killed while attempting to evangelize the Huaorani people of eastern Ecuador. Saint was born in Fort Wayne, Indiana, and grew up in Florida.", "labels": "He attended Wheaton College in Illinois, where he studied aeronautical engineering and earned his pilot's license.", "concept": "nate saint"}, {"text": "This is a Wikipedia passage about nate saint. Nate Saint (August 28, 1923 – January 8, 1956) was an American Christian missionary pilot and one of five martyrs killed while attempting to evangelize the Huaorani people of eastern Ecuador. Saint was born in Fort Wayne, Indiana, and grew up in Florida. He attended Wheaton College in Illinois, where he studied aeronautical engineering and earned his pilot's license. After graduating in 1947, he worked as a pilot for Mission Aviation Fellowship (MAF) in the Belgian Congo. In 1950, he returned to the United States and married Marj Saint. In 1953, Saint and four other missionaries—Jim Elliot, Peter Fleming, Ed McCully, and Roger Youderian—formed the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission.", "labels": "The group's goal was to evangelize the Huaorani people, a tribe of hunter-gatherers living in the Amazon rainforest.", "concept": "nate saint"}, {"text": "This is a Wikipedia passage about nate saint. Nate Saint (August 28, 1923 – January 8, 1956) was an American Christian missionary pilot and one of five martyrs killed while attempting to evangelize the Huaorani people of eastern Ecuador. Saint was born in Fort Wayne, Indiana, and grew up in Florida. He attended Wheaton College in Illinois, where he studied aeronautical engineering and earned his pilot's license. After graduating in 1947, he worked as a pilot for Mission Aviation Fellowship (MAF) in the Belgian Congo. In 1950, he returned to the United States and married Marj Saint. In 1953, Saint and four other missionaries—Jim Elliot, Peter Fleming, Ed McCully, and Roger Youderian—formed the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission. The group's goal was to evangelize the Huaorani people, a tribe of hunter-gatherers living in the Amazon rainforest.", "labels": "On January 8, 1956, Saint and the other four missionaries were killed by Huaorani warriors while attempting to make contact with the tribe.", "concept": "nate saint"}, {"text": "This is a Wikipedia passage about thutmose iii. ", "labels": "Thutmose III (sometimes read as Thutmosis or Tuthmosis III, Thothmes in older history works; c. 1479–1425 BC) was the sixth Pharaoh of the Eighteenth Dynasty.", "concept": "thutmose iii"}, {"text": "This is a Wikipedia passage about thutmose iii. Thutmose III (sometimes read as Thutmosis or Tuthmosis III, Thothmes in older history works; c. 1479–1425 BC) was the sixth Pharaoh of the Eighteenth Dynasty.", "labels": "He is generally regarded as the greatest monarch of the New Kingdom of Egypt, and was one of the most powerful figures in Egyptian history.", "concept": "thutmose iii"}, {"text": "This is a Wikipedia passage about thutmose iii. Thutmose III (sometimes read as Thutmosis or Tuthmosis III, Thothmes in older history works; c. 1479–1425 BC) was the sixth Pharaoh of the Eighteenth Dynasty. He is generally regarded as the greatest monarch of the New Kingdom of Egypt, and was one of the most powerful figures in Egyptian history.", "labels": "He was a strong and ambitious ruler who reigned for 54 years.", "concept": "thutmose iii"}, {"text": "This is a Wikipedia passage about thutmose iii. Thutmose III (sometimes read as Thutmosis or Tuthmosis III, Thothmes in older history works; c. 1479–1425 BC) was the sixth Pharaoh of the Eighteenth Dynasty. He is generally regarded as the greatest monarch of the New Kingdom of Egypt, and was one of the most powerful figures in Egyptian history. He was a strong and ambitious ruler who reigned for 54 years.", "labels": "He expanded Egypt's army and wielded it with great success to consolidate the empire created by his predecessors.", "concept": "thutmose iii"}, {"text": "This is a Wikipedia passage about a. p. j. abdul kalam. ", "labels": "A. P. J. Abdul Kalam (15 October 1931 – 27 July 2015) was an Indian scientist and politician who served as the 11th President of India from 2002 to 2007.", "concept": "a. p. j. abdul kalam"}, {"text": "This is a Wikipedia passage about a. p. j. abdul kalam. A. P. J. Abdul Kalam (15 October 1931 – 27 July 2015) was an Indian scientist and politician who served as the 11th President of India from 2002 to 2007.", "labels": "He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering.", "concept": "a. p. j. abdul kalam"}, {"text": "This is a Wikipedia passage about a. p. j. abdul kalam. A. P. J. Abdul Kalam (15 October 1931 – 27 July 2015) was an Indian scientist and politician who served as the 11th President of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering.", "labels": "He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts.", "concept": "a. p. j. abdul kalam"}, {"text": "This is a Wikipedia passage about a. p. j. abdul kalam. A. P. J. Abdul Kalam (15 October 1931 – 27 July 2015) was an Indian scientist and politician who served as the 11th President of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts.", "labels": "He thus came to be known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology.", "concept": "a. p. j. abdul kalam"}, {"text": "This is a Wikipedia passage about a. p. j. abdul kalam. A. P. J. Abdul Kalam (15 October 1931 – 27 July 2015) was an Indian scientist and politician who served as the 11th President of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts. He thus came to be known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology.", "labels": "He also played a pivotal organisational, technical, and political role in India's Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974.", "concept": "a. p. j. abdul kalam"}, {"text": "This is a Wikipedia passage about moisés kaufman. ", "labels": "Moisés Kaufman (born November 21, 1963) is a Venezuelan-American director, playwright, and screenwriter.", "concept": "moisés kaufman"}, {"text": "This is a Wikipedia passage about moisés kaufman. Moisés Kaufman (born November 21, 1963) is a Venezuelan-American director, playwright, and screenwriter.", "labels": "He is best known for his play The Laramie Project, which was adapted into an HBO movie.", "concept": "moisés kaufman"}, {"text": "This is a Wikipedia passage about moisés kaufman. Moisés Kaufman (born November 21, 1963) is a Venezuelan-American director, playwright, and screenwriter. He is best known for his play The Laramie Project, which was adapted into an HBO movie.", "labels": "Kaufman was born in Caracas, Venezuela, to a Jewish family.", "concept": "moisés kaufman"}, {"text": "This is a Wikipedia passage about moisés kaufman. Moisés Kaufman (born November 21, 1963) is a Venezuelan-American director, playwright, and screenwriter. He is best known for his play The Laramie Project, which was adapted into an HBO movie. Kaufman was born in Caracas, Venezuela, to a Jewish family. He moved to the United States in 1977 and attended the High School of Performing Arts in New York City. He graduated from New York University's Tisch School of the Arts in 1985.", "labels": "Kaufman is the founder and artistic director of Tectonic Theater Project, a New York-based theater company dedicated to developing innovative works that explore theatrical language and form, foster an artistic dialogue with the social issues of our time, and embrace the exploration of new ideas.", "concept": "moisés kaufman"}, {"text": "This is a Wikipedia passage about moisés kaufman. Moisés Kaufman (born November 21, 1963) is a Venezuelan-American director, playwright, and screenwriter. He is best known for his play The Laramie Project, which was adapted into an HBO movie. Kaufman was born in Caracas, Venezuela, to a Jewish family. He moved to the United States in 1977 and attended the High School of Performing Arts in New York City. He graduated from New York University's Tisch School of the Arts in 1985. Kaufman is the founder and artistic director of Tectonic Theater Project, a New York-based theater company dedicated to developing innovative works that explore theatrical language and form, foster an artistic dialogue with the social issues of our time, and embrace the exploration of new ideas.", "labels": "He has written and directed numerous plays, including Gross Indecency:", "concept": "moisés kaufman"}, {"text": "This is a Wikipedia passage about moisés kaufman. Moisés Kaufman (born November 21, 1963) is a Venezuelan-American director, playwright, and screenwriter. He is best known for his play The Laramie Project, which was adapted into an HBO movie. Kaufman was born in Caracas, Venezuela, to a Jewish family. He moved to the United States in 1977 and attended the High School of Performing Arts in New York City. He graduated from New York University's Tisch School of the Arts in 1985. Kaufman is the founder and artistic director of Tectonic Theater Project, a New York-based theater company dedicated to developing innovative works that explore theatrical language and form, foster an artistic dialogue with the social issues of our time, and embrace the exploration of new ideas. He has written and directed numerous plays, including Gross Indecency:", "labels": "The Three Trials of Oscar Wilde, 33 Variations, and I Am My Own Wife.", "concept": "moisés kaufman"}, {"text": "This is a Wikipedia passage about robert holgate. ", "labels": "Robert Holgate (c. 1481 – 1555) was an English prelate and statesman who served as Archbishop of York from 1545 until his death in 1555.", "concept": "robert holgate"}, {"text": "This is a Wikipedia passage about robert holgate. Robert Holgate (c. 1481 – 1555) was an English prelate and statesman who served as Archbishop of York from 1545 until his death in 1555. He was a leading figure in the English Reformation, and was responsible for introducing Protestantism to the north of England. He was also a prominent member of the Privy Council of England, and was involved in the negotiations for the marriage of King Henry VIII to Anne of Cleves. Holgate was born in York, the son of a wealthy merchant. He was educated at the University of Cambridge, and was ordained a priest in 1510. He rose quickly through the ranks of the Church, becoming Bishop of Llandaff in 1523 and Bishop of Exeter in 1525.", "labels": "In 1545, he was appointed Archbishop of York, and was one of the most influential figures in the English Reformation.", "concept": "robert holgate"}, {"text": "This is a Wikipedia passage about robert holgate. Robert Holgate (c. 1481 – 1555) was an English prelate and statesman who served as Archbishop of York from 1545 until his death in 1555. He was a leading figure in the English Reformation, and was responsible for introducing Protestantism to the north of England. He was also a prominent member of the Privy Council of England, and was involved in the negotiations for the marriage of King Henry VIII to Anne of Cleves. Holgate was born in York, the son of a wealthy merchant. He was educated at the University of Cambridge, and was ordained a priest in 1510. He rose quickly through the ranks of the Church, becoming Bishop of Llandaff in 1523 and Bishop of Exeter in 1525. In 1545, he was appointed Archbishop of York, and was one of the most influential figures in the English Reformation.", "labels": "He was a strong advocate of the Protestant faith, and was responsible for introducing Protestantism to the north of England.", "concept": "robert holgate"}, {"text": "This is a Wikipedia passage about saul david. Saul David (born 1962) is a British historian, author and broadcaster. He is Professor of Military History at the University of Buckingham and a Senior Fellow at the Royal United Services Institute.", "labels": "He is the author of several books on military history, including Zulu: The Heroism and Tragedy of the Zulu War of 1879, and Victoria's Wars: The Rise of Empire.", "concept": "saul david"}, {"text": "This is a Wikipedia passage about tomasz lis. Tomasz Lis (born 28 April 1962) is a Polish journalist, television presenter and editor-in-chief of the Polish weekly news magazine Wprost.", "labels": "He is one of the most popular and influential journalists in Poland.", "concept": "tomasz lis"}, {"text": "This is a Wikipedia passage about tomasz lis. Tomasz Lis (born 28 April 1962) is a Polish journalist, television presenter and editor-in-chief of the Polish weekly news magazine Wprost. He is one of the most popular and influential journalists in Poland. He is known for his strong opinions and his confrontational style of interviewing.", "labels": "He is also a regular contributor to the Polish edition of Newsweek.", "concept": "tomasz lis"}, {"text": "This is a Wikipedia passage about véra korène. Véra Korène (1890–1956) was a Russian-born French actress and singer. She was born in Moscow, Russia, and moved to Paris in 1912. She began her career as a singer in the cabarets of Montmartre, and later became a successful actress in the French theater and cinema. She was best known for her roles in the films La Grande Illusion (1937) and La Règle du Jeu (1939).", "labels": "She was also a popular recording artist, releasing several albums of popular songs.", "concept": "véra korène"}, {"text": "This is a Wikipedia passage about nodar kumaritashvili. Nodar Kumaritashvili (Georgian: ნოდარ ქუმარითაშვილი; 12 December 1988 – 12 February 2010) was a Georgian luger who died during a training run prior to the 2010 Winter Olympics in Vancouver. He was the first athlete to die in competition at the Olympic Games since the death of Danish cyclist Knud Enemark Jensen at the 1960 Summer Olympics. Kumaritashvili was born in Bakuriani, Georgia, and began competing in luge in 2003. He was the Georgian national champion in 2008 and 2009, and was the 2009 Junior World Champion. He was considered a medal contender for the 2010 Winter Olympics.", "labels": "On 12 February 2010, Kumaritashvili was killed during a training run at the Whistler Sliding Centre, the venue for the luge events at the 2010 Winter Olympics.", "concept": "nodar kumaritashvili"}, {"text": "This is a Wikipedia passage about nodar kumaritashvili. Nodar Kumaritashvili (Georgian: ნოდარ ქუმარითაშვილი; 12 December 1988 – 12 February 2010) was a Georgian luger who died during a training run prior to the 2010 Winter Olympics in Vancouver. He was the first athlete to die in competition at the Olympic Games since the death of Danish cyclist Knud Enemark Jensen at the 1960 Summer Olympics. Kumaritashvili was born in Bakuriani, Georgia, and began competing in luge in 2003. He was the Georgian national champion in 2008 and 2009, and was the 2009 Junior World Champion. He was considered a medal contender for the 2010 Winter Olympics. On 12 February 2010, Kumaritashvili was killed during a training run at the Whistler Sliding Centre, the venue for the luge events at the 2010 Winter Olympics.", "labels": "He lost control of his sled at", "concept": "nodar kumaritashvili"}, {"text": "This is a Wikipedia passage about alfred fischer ss officer. Alfred Fischer (1899–1945) was a German SS officer during World War II. He was a member of the SS-Totenkopfverbände and was the commandant of the Auschwitz concentration camp from May 1944 to November 1944. Fischer was born in 1899 in the small town of Schmiedeberg in Silesia.", "labels": "He joined the Nazi Party in 1933 and the SS in 1934.", "concept": "alfred fischer ss officer"}, {"text": "This is a Wikipedia passage about kermit davis. Kermit Davis (born April 28, 1959) is an American college basketball coach and the current head coach of the Mississippi State Bulldogs men's basketball team.", "labels": "He was previously the head coach of the Middle Tennessee Blue Raiders men's basketball team from 2002 to 2018.", "concept": "kermit davis"}, {"text": "This is a Wikipedia passage about daniel ménard. Daniel Ménard (born October 28, 1959) is a Canadian retired military officer and former commander of the Canadian Forces in Afghanistan. He was the first francophone to command the Canadian Forces in Afghanistan. Ménard was born in Montreal, Quebec, and joined the Canadian Forces in 1979. He graduated from the Royal Military College of Canada in 1983 and was commissioned as an infantry officer.", "labels": "He served in various command and staff positions in Canada and abroad, including a tour of duty in Bosnia and Herzegovina.", "concept": "daniel ménard"}, {"text": "This is a Wikipedia passage about modibo adama. Modibo Adama (1830–1883) was a West African ruler who founded the Adamawa Emirate in what is now northeastern Nigeria and northern Cameroon.", "labels": "He was born in the village of Yola, in present-day Adamawa State, Nigeria, and was a member of the Fulani ethnic group.", "concept": "modibo adama"}, {"text": "This is a Wikipedia passage about modibo adama. Modibo Adama (1830–1883) was a West African ruler who founded the Adamawa Emirate in what is now northeastern Nigeria and northern Cameroon. He was born in the village of Yola, in present-day Adamawa State, Nigeria, and was a member of the Fulani ethnic group.", "labels": "He was a religious leader and a warrior, and is credited with unifying the various Fulani clans in the region and establishing the Adamawa Emirate.", "concept": "modibo adama"}, {"text": "This is a Wikipedia passage about modibo adama. Modibo Adama (1830–1883) was a West African ruler who founded the Adamawa Emirate in what is now northeastern Nigeria and northern Cameroon. He was born in the village of Yola, in present-day Adamawa State, Nigeria, and was a member of the Fulani ethnic group. He was a religious leader and a warrior, and is credited with unifying the various Fulani clans in the region and establishing the Adamawa Emirate.", "labels": "He was also a successful military leader, leading his forces in a number of successful campaigns against the neighboring Bantu-speaking peoples.", "concept": "modibo adama"}, {"text": "This is a Wikipedia passage about mushahid hussain syed. Mushahid Hussain Syed (born 1 April 1947) is a Pakistani politician and journalist who served as a Senator from 1985 to 2018. He was the Secretary General of the Pakistan Muslim League (PML) from 2002 to 2008 and the Minister for Information and Broadcasting from 2008 to 2013.", "labels": "He is currently the Chairman of the Pakistan-China Institute, a think tank dedicated to promoting bilateral relations between the two countries.", "concept": "mushahid hussain syed"}, {"text": "This is a Wikipedia passage about mushahid hussain syed. Mushahid Hussain Syed (born 1 April 1947) is a Pakistani politician and journalist who served as a Senator from 1985 to 2018. He was the Secretary General of the Pakistan Muslim League (PML) from 2002 to 2008 and the Minister for Information and Broadcasting from 2008 to 2013. He is currently the Chairman of the Pakistan-China Institute, a think tank dedicated to promoting bilateral relations between the two countries. He is also the Chairman of the Senate Standing Committee on Foreign Affairs.", "labels": "He is a former member of the National Assembly of Pakistan and a former member of the Senate of Pakistan.", "concept": "mushahid hussain syed"}, {"text": "This is a Wikipedia passage about mushahid hussain syed. Mushahid Hussain Syed (born 1 April 1947) is a Pakistani politician and journalist who served as a Senator from 1985 to 2018. He was the Secretary General of the Pakistan Muslim League (PML) from 2002 to 2008 and the Minister for Information and Broadcasting from 2008 to 2013. He is currently the Chairman of the Pakistan-China Institute, a think tank dedicated to promoting bilateral relations between the two countries. He is also the Chairman of the Senate Standing Committee on Foreign Affairs. He is a former member of the National Assembly of Pakistan and a former member of the Senate of Pakistan.", "labels": "He is a prominent leader of the Pakistan Muslim League (Nawaz).", "concept": "mushahid hussain syed"}, {"text": "This is a Wikipedia passage about kia joorabchian. Kia Joorabchian (born 1972) is an Iranian-born British-based businessman, investor, and philanthropist. He is the founder and chairman of the investment group, the Joorabchian Group, and is the chairman of the Premier League football club, West Ham United.", "labels": "He is also the founder and chairman of the sports marketing company, Media Sports Investment (MSI).", "concept": "kia joorabchian"}, {"text": "This is a Wikipedia passage about kia joorabchian. Kia Joorabchian (born 1972) is an Iranian-born British-based businessman, investor, and philanthropist. He is the founder and chairman of the investment group, the Joorabchian Group, and is the chairman of the Premier League football club, West Ham United. He is also the founder and chairman of the sports marketing company, Media Sports Investment (MSI). Joorabchian was born in Tehran, Iran, and moved to London in 1989. He studied at the London School of Economics and Political Science, and graduated with a degree in economics and finance. He then went on to work in the banking sector, before founding the Joorabchian Group in 2002.", "labels": "The group has investments in a variety of sectors, including real estate, technology, and sports.", "concept": "kia joorabchian"}, {"text": "This is a Wikipedia passage about kia joorabchian. Kia Joorabchian (born 1972) is an Iranian-born British-based businessman, investor, and philanthropist. He is the founder and chairman of the investment group, the Joorabchian Group, and is the chairman of the Premier League football club, West Ham United. He is also the founder and chairman of the sports marketing company, Media Sports Investment (MSI). Joorabchian was born in Tehran, Iran, and moved to London in 1989. He studied at the London School of Economics and Political Science, and graduated with a degree in economics and finance. He then went on to work in the banking sector, before founding the Joorabchian Group in 2002. The group has investments in a variety of sectors, including real estate, technology, and sports. Joorabchian is a major investor in the Premier League football club, West Ham United, and is the chairman of the club.", "labels": "He is also the founder and chairman of the sports marketing company, Media Sports Investment (MSI).", "concept": "kia joorabchian"}, {"text": "This is a Wikipedia passage about kia joorabchian. Kia Joorabchian (born 1972) is an Iranian-born British-based businessman, investor, and philanthropist. He is the founder and chairman of the investment group, the Joorabchian Group, and is the chairman of the Premier League football club, West Ham United. He is also the founder and chairman of the sports marketing company, Media Sports Investment (MSI). Joorabchian was born in Tehran, Iran, and moved to London in 1989. He studied at the London School of Economics and Political Science, and graduated with a degree in economics and finance. He then went on to work in the banking sector, before founding the Joorabchian Group in 2002. The group has investments in a variety of sectors, including real estate, technology, and sports. Joorabchian is a major investor in the Premier League football club, West Ham United, and is the chairman of the club. He is also the founder and chairman of the sports marketing company, Media Sports Investment (MSI).", "labels": "MSI has investments in a number of football clubs, including Corinthians in Brazil,", "concept": "kia joorabchian"}, {"text": "This is a Wikipedia passage about vitaliano brancati. ", "labels": "Vitaliano Brancati (1907–1954) was an Italian novelist, playwright, screenwriter, and journalist.", "concept": "vitaliano brancati"}, {"text": "This is a Wikipedia passage about emperor wenxuan of northern qi. ", "labels": "Emperor Wenxuan of Northern Qi (Chinese: 北齊文宣帝; pinyin: Běi Qí Wén Xuān Dì; Wade–Giles: Pei Ch'i Wen-hsüan", "concept": "emperor wenxuan of northern qi"}, {"text": "This is a Wikipedia passage about johan christian dahl. Johan Christian Dahl (also known as John Christopher Dahl, Danish: [dɑːl]; 12 November 1788 – 14 October 1857) was a Norwegian artist.", "labels": "He is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting.", "concept": "johan christian dahl"}, {"text": "This is a Wikipedia passage about johan christian dahl. Johan Christian Dahl (also known as John Christopher Dahl, Danish: [dɑːl]; 12 November 1788 – 14 October 1857) was a Norwegian artist. He is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting.", "labels": "He was also the first acquire genuine fame and cultural renown abroad.", "concept": "johan christian dahl"}, {"text": "This is a Wikipedia passage about johan christian dahl. Johan Christian Dahl (also known as John Christopher Dahl, Danish: [dɑːl]; 12 November 1788 – 14 October 1857) was a Norwegian artist. He is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting. He was also the first acquire genuine fame and cultural renown abroad.", "labels": "Dahl is often described as \"the father of Norwegian landscape painting\" and is regarded as one of the great European Romantic painters.", "concept": "johan christian dahl"}, {"text": "This is a Wikipedia passage about johan christian dahl. Johan Christian Dahl (also known as John Christopher Dahl, Danish: [dɑːl]; 12 November 1788 – 14 October 1857) was a Norwegian artist. He is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting. He was also the first acquire genuine fame and cultural renown abroad. Dahl is often described as \"the father of Norwegian landscape painting\" and is regarded as one of the great European Romantic painters.", "labels": "His work has influenced various generations of later Norwegian artists.", "concept": "johan christian dahl"}, {"text": "This is a Wikipedia passage about johan christian dahl. Johan Christian Dahl (also known as John Christopher Dahl, Danish: [dɑːl]; 12 November 1788 – 14 October 1857) was a Norwegian artist. He is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting. He was also the first acquire genuine fame and cultural renown abroad. Dahl is often described as \"the father of Norwegian landscape painting\" and is regarded as one of the great European Romantic painters. His work has influenced various generations of later Norwegian artists.", "labels": "Dahl studied in Copenhagen under the Flemish history painter, Christian August Lorentzen, and in 1818 he went to Dresden to study with the German landscape painter, Caspar David Friedrich.", "concept": "johan christian dahl"}, {"text": "This is a Wikipedia passage about johan christian dahl. Johan Christian Dahl (also known as John Christopher Dahl, Danish: [dɑːl]; 12 November 1788 – 14 October 1857) was a Norwegian artist. He is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting. He was also the first acquire genuine fame and cultural renown abroad. Dahl is often described as \"the father of Norwegian landscape painting\" and is regarded as one of the great European Romantic painters. His work has influenced various generations of later Norwegian artists. Dahl studied in Copenhagen under the Flemish history painter, Christian August Lorentzen, and in 1818 he went to Dresden to study with the German landscape painter, Caspar David Friedrich. He was inspired by the art of the Norwegian \"golden age\" of the 17th century as well as the Dutch Golden Age and the German Romanticism. His early works are often dark and gloomy, but after 1820 he began to paint more brightly coloured landscapes.", "labels": "He is best known for his paintings of Norwegian fjords and mountains, and he often depicted wild storms and dramatic light", "concept": "johan christian dahl"}, {"text": "This is a Wikipedia passage about david king australian rules footballer. David King (born 28 April 1971) is a former Australian rules footballer who played for the North Melbourne Football Club in the Australian Football League (AFL). He was drafted by North Melbourne with the fourth selection in the 1989 VFL Draft. King played as a ruckman and forward, and was a key member of North Melbourne's 1996 and 1999 premiership teams. He was a three-time All-Australian, in 1996, 1998 and 1999, and won the Syd Barker Medal as North Melbourne's best and fairest player in 1998.", "labels": "He was also a member of the AFL's Team of the Century.", "concept": "david king australian rules footballer"}, {"text": "This is a Wikipedia passage about david king australian rules footballer. David King (born 28 April 1971) is a former Australian rules footballer who played for the North Melbourne Football Club in the Australian Football League (AFL). He was drafted by North Melbourne with the fourth selection in the 1989 VFL Draft. King played as a ruckman and forward, and was a key member of North Melbourne's 1996 and 1999 premiership teams. He was a three-time All-Australian, in 1996, 1998 and 1999, and won the Syd Barker Medal as North Melbourne's best and fairest player in 1998. He was also a member of the AFL's Team of the Century. King retired at the end of the 2003 season, having played a total of 270 games for North Melbourne.", "labels": "He is currently a commentator for Fox Footy.", "concept": "david king australian rules footballer"}, {"text": "This is a Wikipedia passage about danny smith coach. Danny Smith (born October 28, 1956) is an American football coach who is currently the special teams coordinator for the Washington Football Team of the National Football League (NFL). He was previously the special teams coordinator for the Pittsburgh Steelers from 2007 to 2018. Smith has also served as the special teams coordinator for the Jacksonville Jaguars, Tampa Bay Buccaneers, and Chicago Bears. He has also been an assistant coach for the Detroit Lions, Miami Dolphins, and Cleveland Browns. Smith has been coaching in the NFL since 1993.", "labels": "Smith is known for his ability to develop special teams units that consistently rank among the best in the NFL.", "concept": "danny smith coach"}, {"text": "This is a Wikipedia passage about hope cooke. Hope Cooke (born October 8, 1940) is an American socialite and former queen consort of Sikkim.", "labels": "She was the second wife of the Chogyal (king) of Sikkim, Palden Thondup Namgyal.", "concept": "hope cooke"}, {"text": "This is a Wikipedia passage about hope cooke. Hope Cooke (born October 8, 1940) is an American socialite and former queen consort of Sikkim. She was the second wife of the Chogyal (king) of Sikkim, Palden Thondup Namgyal. Cooke was born in New York City to an American father and a Burmese mother.", "labels": "She was educated at the Chapin School in New York City and at the Madeira School in McLean, Virginia.", "concept": "hope cooke"}, {"text": "This is a Wikipedia passage about hope cooke. Hope Cooke (born October 8, 1940) is an American socialite and former queen consort of Sikkim. She was the second wife of the Chogyal (king) of Sikkim, Palden Thondup Namgyal. Cooke was born in New York City to an American father and a Burmese mother. She was educated at the Chapin School in New York City and at the Madeira School in McLean, Virginia. In 1963, Cooke met the Chogyal of Sikkim, Palden Thondup Namgyal, while he was on a visit to the United States.", "labels": "They married in 1963 and she moved to Sikkim, becoming the queen consort of Sikkim.", "concept": "hope cooke"}, {"text": "This is a Wikipedia passage about hope cooke. Hope Cooke (born October 8, 1940) is an American socialite and former queen consort of Sikkim. She was the second wife of the Chogyal (king) of Sikkim, Palden Thondup Namgyal. Cooke was born in New York City to an American father and a Burmese mother. She was educated at the Chapin School in New York City and at the Madeira School in McLean, Virginia. In 1963, Cooke met the Chogyal of Sikkim, Palden Thondup Namgyal, while he was on a visit to the United States. They married in 1963 and she moved to Sikkim, becoming the queen consort of Sikkim.", "labels": "She was the first American woman to become a queen consort in Asia.", "concept": "hope cooke"}, {"text": "This is a Wikipedia passage about hope cooke. Hope Cooke (born October 8, 1940) is an American socialite and former queen consort of Sikkim. She was the second wife of the Chogyal (king) of Sikkim, Palden Thondup Namgyal. Cooke was born in New York City to an American father and a Burmese mother. She was educated at the Chapin School in New York City and at the Madeira School in McLean, Virginia. In 1963, Cooke met the Chogyal of Sikkim, Palden Thondup Namgyal, while he was on a visit to the United States. They married in 1963 and she moved to Sikkim, becoming the queen consort of Sikkim. She was the first American woman to become a queen consort in Asia. Cooke was instrumental in the modernization of Sikkim and the introduction of democracy to the country. She was also a strong advocate for the rights of women and children in Sikkim.", "labels": "In 1975, Sikkim was annexed by India and the monarchy was abolished.", "concept": "hope cooke"}, {"text": "This is a Wikipedia passage about tathagata satpathy. Tathagata Satpathy (born 28 August 1956) is an Indian politician and a Member of Parliament in the Lok Sabha from the Biju Janata Dal (BJD) representing the Dhenkanal constituency of Odisha.", "labels": "He is a former journalist and editor of the Odia daily Dharitri.", "concept": "tathagata satpathy"}, {"text": "This is a Wikipedia passage about tathagata satpathy. Tathagata Satpathy (born 28 August 1956) is an Indian politician and a Member of Parliament in the Lok Sabha from the Biju Janata Dal (BJD) representing the Dhenkanal constituency of Odisha. He is a former journalist and editor of the Odia daily Dharitri.", "labels": "He was elected to the Lok Sabha in the 2014 Indian general election.", "concept": "tathagata satpathy"}, {"text": "This is a Wikipedia passage about tathagata satpathy. Tathagata Satpathy (born 28 August 1956) is an Indian politician and a Member of Parliament in the Lok Sabha from the Biju Janata Dal (BJD) representing the Dhenkanal constituency of Odisha. He is a former journalist and editor of the Odia daily Dharitri. He was elected to the Lok Sabha in the 2014 Indian general election.", "labels": "Satpathy is a strong advocate of the Odia language and culture.", "concept": "tathagata satpathy"}, {"text": "This is a Wikipedia passage about tathagata satpathy. Tathagata Satpathy (born 28 August 1956) is an Indian politician and a Member of Parliament in the Lok Sabha from the Biju Janata Dal (BJD) representing the Dhenkanal constituency of Odisha. He is a former journalist and editor of the Odia daily Dharitri. He was elected to the Lok Sabha in the 2014 Indian general election. Satpathy is a strong advocate of the Odia language and culture.", "labels": "He has been a vocal critic of the central government's policies on language and culture.", "concept": "tathagata satpathy"}, {"text": "This is a Wikipedia passage about michel mathieu canadian politician. Michel Mathieu (born October 28, 1945) is a Canadian politician. He was a Member of the National Assembly of Quebec for the riding of L'Assomption from 2003 to 2007. He was a member of the Parti Québécois.", "labels": "Mathieu was born in L'Assomption, Quebec.", "concept": "michel mathieu canadian politician"}, {"text": "This is a Wikipedia passage about mario monti. ", "labels": "Mario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.", "concept": "mario monti"}, {"text": "This is a Wikipedia passage about mario monti. Mario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.", "labels": "Monti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004.", "concept": "mario monti"}, {"text": "This is a Wikipedia passage about mario monti. Mario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis. Monti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004.", "labels": "Monti has also been Rector and President of Bocconi University in Milan for many years.", "concept": "mario monti"}, {"text": "This is a Wikipedia passage about mario monti. Mario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis. Monti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been Rector and President of Bocconi University in Milan for many years. From November 2011 until April 2013 Monti was the President of Civic Choice, a centrist political party.", "labels": "He was commonly referred to as \"Super Mario\" in the Italian media during his tenure as Prime Minister.", "concept": "mario monti"}, {"text": "This is a Wikipedia passage about mario monti. Mario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis. Monti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been Rector and President of Bocconi University in Milan for many years. From November 2011 until April 2013 Monti was the President of Civic Choice, a centrist political party. He was commonly referred to as \"Super Mario\" in the Italian media during his tenure as Prime Minister.", "labels": "He is widely respected in Europe for his economic reforms and austerity policies, which he put in place to combat the Italian debt crisis.", "concept": "mario monti"}, {"text": "This is a Wikipedia passage about pino palladino. Pino Palladino (born 24 October 1957) is a Welsh bass guitarist.", "labels": "He is a prolific session musician who has recorded and performed with many well-known artists and groups since the mid-1970s.", "concept": "pino palladino"}, {"text": "This is a Wikipedia passage about pino palladino. Pino Palladino (born 24 October 1957) is a Welsh bass guitarist. He is a prolific session musician who has recorded and performed with many well-known artists and groups since the mid-1970s.", "labels": "He is best known for his long-time collaboration with The Who, and his work with D'Angelo, Eric Clapton, John Mayer, and The RH Factor.", "concept": "pino palladino"}, {"text": "This is a Wikipedia passage about pino palladino. Pino Palladino (born 24 October 1957) is a Welsh bass guitarist. He is a prolific session musician who has recorded and performed with many well-known artists and groups since the mid-1970s. He is best known for his long-time collaboration with The Who, and his work with D'Angelo, Eric Clapton, John Mayer, and The RH Factor.", "labels": "He has also been a member of the John Mayer Trio, Paul Rodgers' band, and The Winery Dogs.", "concept": "pino palladino"}, {"text": "This is a Wikipedia passage about pino palladino. Pino Palladino (born 24 October 1957) is a Welsh bass guitarist. He is a prolific session musician who has recorded and performed with many well-known artists and groups since the mid-1970s. He is best known for his long-time collaboration with The Who, and his work with D'Angelo, Eric Clapton, John Mayer, and The RH Factor. He has also been a member of the John Mayer Trio, Paul Rodgers' band, and The Winery Dogs.", "labels": "Palladino's signature bass sound is characterized by a deep, warm tone and a \"slap\" technique that is heavily influenced by funk music.", "concept": "pino palladino"}, {"text": "This is a Wikipedia passage about pino palladino. Pino Palladino (born 24 October 1957) is a Welsh bass guitarist. He is a prolific session musician who has recorded and performed with many well-known artists and groups since the mid-1970s. He is best known for his long-time collaboration with The Who, and his work with D'Angelo, Eric Clapton, John Mayer, and The RH Factor. He has also been a member of the John Mayer Trio, Paul Rodgers' band, and The Winery Dogs. Palladino's signature bass sound is characterized by a deep, warm tone and a \"slap\" technique that is heavily influenced by funk music.", "labels": "He is widely regarded as one of the most influential bass players of the modern era.", "concept": "pino palladino"}, {"text": "This is a Wikipedia passage about tony la russa. ", "labels": "Tony La Russa Jr. (born October 4, 1944) is an American professional baseball manager and executive currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB).", "concept": "tony la russa"}, {"text": "This is a Wikipedia passage about tony la russa. Tony La Russa Jr. (born October 4, 1944) is an American professional baseball manager and executive currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB).", "labels": "He is best known for his tenures as manager of the Chicago White Sox (1979–1986), Oakland Athletics (1986–1995), and St. Louis Cardinals (1996–2011).", "concept": "tony la russa"}, {"text": "This is a Wikipedia passage about tony la russa. Tony La Russa Jr. (born October 4, 1944) is an American professional baseball manager and executive currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB). He is best known for his tenures as manager of the Chicago White Sox (1979–1986), Oakland Athletics (1986–1995), and St. Louis Cardinals (1996–2011).", "labels": "His MLB career has spanned from 1963 to the present, in several roles.", "concept": "tony la russa"}, {"text": "This is a Wikipedia passage about tony la russa. Tony La Russa Jr. (born October 4, 1944) is an American professional baseball manager and executive currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB). He is best known for his tenures as manager of the Chicago White Sox (1979–1986), Oakland Athletics (1986–1995), and St. Louis Cardinals (1996–2011). His MLB career has spanned from 1963 to the present, in several roles.", "labels": "La Russa ranks third all-time in major league wins as a manager, trailing only Connie Mack and John McGraw.", "concept": "tony la russa"}, {"text": "This is a Wikipedia passage about tony la russa. Tony La Russa Jr. (born October 4, 1944) is an American professional baseball manager and executive currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB). He is best known for his tenures as manager of the Chicago White Sox (1979–1986), Oakland Athletics (1986–1995), and St. Louis Cardinals (1996–2011). His MLB career has spanned from 1963 to the present, in several roles. La Russa ranks third all-time in major league wins as a manager, trailing only Connie Mack and John McGraw. He led his teams to six World Series titles, and is the only manager to win the World Series in both the American and National Leagues. His 2,728 wins are the sixth-most by any manager in major league history. He also won three pennants and six division titles with the three teams for which he managed.", "labels": "La Russa was named Manager of the Year in 1983, 1988, and 1992.", "concept": "tony la russa"}, {"text": "This is a Wikipedia passage about tony la russa. Tony La Russa Jr. (born October 4, 1944) is an American professional baseball manager and executive currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB). He is best known for his tenures as manager of the Chicago White Sox (1979–1986), Oakland Athletics (1986–1995), and St. Louis Cardinals (1996–2011). His MLB career has spanned from 1963 to the present, in several roles. La Russa ranks third all-time in major league wins as a manager, trailing only Connie Mack and John McGraw. He led his teams to six World Series titles, and is the only manager to win the World Series in both the American and National Leagues. His 2,728 wins are the sixth-most by any manager in major league history. He also won three pennants and six division titles with the three teams for which he managed. La Russa was named Manager of the Year in 1983, 1988, and 1992.", "labels": "He was elected to the Baseball Hall of Fame in 2014.", "concept": "tony la russa"}, {"text": "This is a Wikipedia passage about malcolm brogdon. ", "labels": "Malcolm Brogdon (born December 11, 1992) is an American professional basketball player for the Indiana Pacers of the National Basketball Association (NBA).", "concept": "malcolm brogdon"}, {"text": "This is a Wikipedia passage about malcolm brogdon. Malcolm Brogdon (born December 11, 1992) is an American professional basketball player for the Indiana Pacers of the National Basketball Association (NBA).", "labels": "He played college basketball for the Virginia Cavaliers, where he was the ACC Player of the Year and an All-American in 2016.", "concept": "malcolm brogdon"}, {"text": "This is a Wikipedia passage about malcolm brogdon. Malcolm Brogdon (born December 11, 1992) is an American professional basketball player for the Indiana Pacers of the National Basketball Association (NBA). He played college basketball for the Virginia Cavaliers, where he was the ACC Player of the Year and an All-American in 2016.", "labels": "He was selected in the second round of the 2016 NBA draft by the Milwaukee Bucks with the 36th overall pick.", "concept": "malcolm brogdon"}, {"text": "This is a Wikipedia passage about malcolm brogdon. Malcolm Brogdon (born December 11, 1992) is an American professional basketball player for the Indiana Pacers of the National Basketball Association (NBA). He played college basketball for the Virginia Cavaliers, where he was the ACC Player of the Year and an All-American in 2016. He was selected in the second round of the 2016 NBA draft by the Milwaukee Bucks with the 36th overall pick.", "labels": "Brogdon was named the NBA Rookie of the Year in 2017.", "concept": "malcolm brogdon"}, {"text": "This is a Wikipedia passage about malcolm brogdon. Malcolm Brogdon (born December 11, 1992) is an American professional basketball player for the Indiana Pacers of the National Basketball Association (NBA). He played college basketball for the Virginia Cavaliers, where he was the ACC Player of the Year and an All-American in 2016. He was selected in the second round of the 2016 NBA draft by the Milwaukee Bucks with the 36th overall pick. Brogdon was named the NBA Rookie of the Year in 2017.", "labels": "He was traded to the Pacers in 2019.", "concept": "malcolm brogdon"}, {"text": "This is a Wikipedia passage about malcolm brogdon. Malcolm Brogdon (born December 11, 1992) is an American professional basketball player for the Indiana Pacers of the National Basketball Association (NBA). He played college basketball for the Virginia Cavaliers, where he was the ACC Player of the Year and an All-American in 2016. He was selected in the second round of the 2016 NBA draft by the Milwaukee Bucks with the 36th overall pick. Brogdon was named the NBA Rookie of the Year in 2017. He was traded to the Pacers in 2019. Brogdon is a two-time NBA All-Star and was named to the All-Defensive Second Team in 2019.", "labels": "He is known for his defensive prowess and his ability to shoot from long range.", "concept": "malcolm brogdon"}, {"text": "This is a Wikipedia passage about john les. ", "labels": "John Les (born October 28, 1951) is a Canadian politician who served as the Member of the Legislative Assembly of British Columbia for the riding of Chilliwack-Hope from 2001 to 2013.", "concept": "john les"}, {"text": "This is a Wikipedia passage about john les. John Les (born October 28, 1951) is a Canadian politician who served as the Member of the Legislative Assembly of British Columbia for the riding of Chilliwack-Hope from 2001 to 2013.", "labels": "He was first elected in the 2001 provincial election as a member of the British Columbia Liberal Party.", "concept": "john les"}, {"text": "This is a Wikipedia passage about evan rachel wood. ", "labels": "Evan Rachel Wood (born September 7, 1987) is an American actress, model, and musician.", "concept": "evan rachel wood"}, {"text": "This is a Wikipedia passage about evan rachel wood. Evan Rachel Wood (born September 7, 1987) is an American actress, model, and musician.", "labels": "She began acting in the 1990s, appearing in several television series, including American Gothic (1995–96) and Once and Again (1999–2002).", "concept": "evan rachel wood"}, {"text": "This is a Wikipedia passage about evan rachel wood. Evan Rachel Wood (born September 7, 1987) is an American actress, model, and musician. She began acting in the 1990s, appearing in several television series, including American Gothic (1995–96) and Once and Again (1999–2002).", "labels": "Wood made her debut as a leading film actress at the age of nine in Digging to China (1997) and garnered acclaim for her Golden Globe-nominated role as the troubled teenager Tracy Freeland in the teen drama film Thirteen (2003).", "concept": "evan rachel wood"}, {"text": "This is a Wikipedia passage about evan rachel wood. Evan Rachel Wood (born September 7, 1987) is an American actress, model, and musician. She began acting in the 1990s, appearing in several television series, including American Gothic (1995–96) and Once and Again (1999–2002). Wood made her debut as a leading film actress at the age of nine in Digging to China (1997) and garnered acclaim for her Golden Globe-nominated role as the troubled teenager Tracy Freeland in the teen drama film Thirteen (2003).", "labels": "She is also known for her roles in the films Across the Universe (2007), The Wrestler (2008), and The Ides of March (2011).", "concept": "evan rachel wood"}, {"text": "This is a Wikipedia passage about frank abagnale. ", "labels": "Frank Abagnale Jr. (born April 27, 1948) is an American security consultant known for his history as a former con artist, check forger, and impostor between the ages of 15 and 21.", "concept": "frank abagnale"}, {"text": "This is a Wikipedia passage about frank abagnale. Frank Abagnale Jr. (born April 27, 1948) is an American security consultant known for his history as a former con artist, check forger, and impostor between the ages of 15 and 21. He became one of the most famous impostors ever, claiming to have assumed no fewer than eight identities, including an airline pilot, a physician, a U.S. Bureau of Prisons agent, and a lawyer.", "labels": "He escaped from police custody twice (once from a taxiing airliner and once from a U.S. federal penitentiary).", "concept": "frank abagnale"}, {"text": "This is a Wikipedia passage about frank abagnale. Frank Abagnale Jr. (born April 27, 1948) is an American security consultant known for his history as a former con artist, check forger, and impostor between the ages of 15 and 21. He became one of the most famous impostors ever, claiming to have assumed no fewer than eight identities, including an airline pilot, a physician, a U.S. Bureau of Prisons agent, and a lawyer. He escaped from police custody twice (once from a taxiing airliner and once from a U.S. federal penitentiary). He served less than five years in prison before starting to work for the federal government.", "labels": "He is currently a consultant and lecturer for the FBI academy and field offices.", "concept": "frank abagnale"}, {"text": "This is a Wikipedia passage about frank abagnale. Frank Abagnale Jr. (born April 27, 1948) is an American security consultant known for his history as a former con artist, check forger, and impostor between the ages of 15 and 21. He became one of the most famous impostors ever, claiming to have assumed no fewer than eight identities, including an airline pilot, a physician, a U.S. Bureau of Prisons agent, and a lawyer. He escaped from police custody twice (once from a taxiing airliner and once from a U.S. federal penitentiary). He served less than five years in prison before starting to work for the federal government. He is currently a consultant and lecturer for the FBI academy and field offices.", "labels": "Abagnale's story was depicted in the film Catch Me If You Can, directed by Steven Spielberg and starring Leonardo DiCaprio as Abagnale and Tom Hanks as an FBI agent.", "concept": "frank abagnale"}, {"text": "This is a Wikipedia passage about reezal merican naina merican. Reezal Merican Naina Merican (born 28 April 1988) is a Malaysian politician and the Member of Parliament for the constituency of Kuala Nerus in the state of Terengganu. He is a member of the United Malays National Organisation (UMNO) and is the current Deputy Minister of Youth and Sports.", "labels": "He was elected to the Dewan Rakyat in the 2018 general election.", "concept": "reezal merican naina merican"}, {"text": "This is a Wikipedia passage about reezal merican naina merican. Reezal Merican Naina Merican (born 28 April 1988) is a Malaysian politician and the Member of Parliament for the constituency of Kuala Nerus in the state of Terengganu. He is a member of the United Malays National Organisation (UMNO) and is the current Deputy Minister of Youth and Sports. He was elected to the Dewan Rakyat in the 2018 general election. Reezal Merican was born in Kuala Terengganu, Terengganu, Malaysia. He graduated from the University of Malaya with a Bachelor of Laws (LL.B) in 2012. He was a member of the Malaysian Youth Council from 2012 to 2014. He was also a member of the Malaysian Bar Council from 2013 to 2014.", "labels": "Reezal Merican was elected to the Dewan Rakyat in the 2018 general election.", "concept": "reezal merican naina merican"}, {"text": "This is a Wikipedia passage about reezal merican naina merican. Reezal Merican Naina Merican (born 28 April 1988) is a Malaysian politician and the Member of Parliament for the constituency of Kuala Nerus in the state of Terengganu. He is a member of the United Malays National Organisation (UMNO) and is the current Deputy Minister of Youth and Sports. He was elected to the Dewan Rakyat in the 2018 general election. Reezal Merican was born in Kuala Terengganu, Terengganu, Malaysia. He graduated from the University of Malaya with a Bachelor of Laws (LL.B) in 2012. He was a member of the Malaysian Youth Council from 2012 to 2014. He was also a member of the Malaysian Bar Council from 2013 to 2014. Reezal Merican was elected to the Dewan Rakyat in the 2018 general election. He was appointed as the Deputy Minister of Youth and Sports in the Pakatan Harapan government in July 2018. He was re-elected in the 2020 general election.", "labels": "He is currently a member of the UMNO Supreme Council.", "concept": "reezal merican naina merican"}, {"text": "This is a Wikipedia passage about lindsay crouse. ", "labels": "Lindsay Crouse (born May 12, 1948) is an American actress.", "concept": "lindsay crouse"}, {"text": "This is a Wikipedia passage about lindsay crouse. Lindsay Crouse (born May 12, 1948) is an American actress.", "labels": "She is known for her roles in the films House of Games (1987), Places in the Heart (1984), and Slap Shot (1977).", "concept": "lindsay crouse"}, {"text": "This is a Wikipedia passage about lindsay crouse. Lindsay Crouse (born May 12, 1948) is an American actress. She is known for her roles in the films House of Games (1987), Places in the Heart (1984), and Slap Shot (1977). She has also appeared in the television series The West Wing, Law & Order, and The Good Wife. Crouse was born in New York City and raised in nearby Scarsdale. She attended Harvard University, where she studied English and American literature.", "labels": "After graduating in 1970, she moved to New York City and began her acting career.", "concept": "lindsay crouse"}, {"text": "This is a Wikipedia passage about lindsay crouse. Lindsay Crouse (born May 12, 1948) is an American actress. She is known for her roles in the films House of Games (1987), Places in the Heart (1984), and Slap Shot (1977). She has also appeared in the television series The West Wing, Law & Order, and The Good Wife. Crouse was born in New York City and raised in nearby Scarsdale. She attended Harvard University, where she studied English and American literature. After graduating in 1970, she moved to New York City and began her acting career. She made her Broadway debut in 1972 in the play That Championship Season.", "labels": "Crouse has appeared in numerous films and television shows throughout her career.", "concept": "lindsay crouse"}, {"text": "This is a Wikipedia passage about lindsay crouse. Lindsay Crouse (born May 12, 1948) is an American actress. She is known for her roles in the films House of Games (1987), Places in the Heart (1984), and Slap Shot (1977). She has also appeared in the television series The West Wing, Law & Order, and The Good Wife. Crouse was born in New York City and raised in nearby Scarsdale. She attended Harvard University, where she studied English and American literature. After graduating in 1970, she moved to New York City and began her acting career. She made her Broadway debut in 1972 in the play That Championship Season. Crouse has appeared in numerous films and television shows throughout her career. She won an Obie Award for her performance in the play The Marriage of Bette and Boo in 1985.", "labels": "She was nominated for an Academy Award for Best Supporting Actress for her role in Places in the Heart.", "concept": "lindsay crouse"}, {"text": "This is a Wikipedia passage about ha jung-woo. Ha Jung-woo (born Kim Sung-hoon on March 11, 1979) is a South Korean actor, film director, producer and writer.", "labels": "He is best known for his leading roles in the films The Chaser (2008), The Yellow Sea (2010), Nameless Gangster (2012), The Terror Live (2013), and Tunnel (2016).", "concept": "ha jung-woo"}, {"text": "This is a Wikipedia passage about ha jung-woo. Ha Jung-woo (born Kim Sung-hoon on March 11, 1979) is a South Korean actor, film director, producer and writer. He is best known for his leading roles in the films The Chaser (2008), The Yellow Sea (2010), Nameless Gangster (2012), The Terror Live (2013), and Tunnel (2016). He has also starred in the television series Super Rookie (2005) and The K2 (2016). Ha made his acting debut in the 2003 film, Too Beautiful to Lie. He then starred in the 2005 television series Super Rookie, and the 2006 film, The Unforgiven.", "labels": "He rose to fame with his leading role in the 2008 film The Chaser, for which he won Best Actor at the Grand Bell Awards and Blue Dragon Film Awards.", "concept": "ha jung-woo"}, {"text": "This is a Wikipedia passage about ha jung-woo. Ha Jung-woo (born Kim Sung-hoon on March 11, 1979) is a South Korean actor, film director, producer and writer. He is best known for his leading roles in the films The Chaser (2008), The Yellow Sea (2010), Nameless Gangster (2012), The Terror Live (2013), and Tunnel (2016). He has also starred in the television series Super Rookie (2005) and The K2 (2016). Ha made his acting debut in the 2003 film, Too Beautiful to Lie. He then starred in the 2005 television series Super Rookie, and the 2006 film, The Unforgiven. He rose to fame with his leading role in the 2008 film The Chaser, for which he won Best Actor at the Grand Bell Awards and Blue Dragon Film Awards.", "labels": "He then starred in the 2010 film The Yellow Sea, for which he won Best Actor at the Asian Film Awards.", "concept": "ha jung-woo"}, {"text": "This is a Wikipedia passage about stereophonics. ", "labels": "Stereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in Cynon Valley, Wales.", "concept": "stereophonics"}, {"text": "This is a Wikipedia passage about stereophonics. Stereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in Cynon Valley, Wales.", "labels": "The band consists of Kelly Jones (lead vocals, lead guitar), Richard Jones (bass guitar, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards).", "concept": "stereophonics"}, {"text": "This is a Wikipedia passage about stereophonics. Stereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in Cynon Valley, Wales. The band consists of Kelly Jones (lead vocals, lead guitar), Richard Jones (bass guitar, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards).", "labels": "The group previously included Stuart Cable (drums, percussion, backing vocals) from 1992 until his departure in 2003.", "concept": "stereophonics"}, {"text": "This is a Wikipedia passage about stereophonics. Stereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in Cynon Valley, Wales. The band consists of Kelly Jones (lead vocals, lead guitar), Richard Jones (bass guitar, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (drums, percussion, backing vocals) from 1992 until his departure in 2003. Stereophonics have released nine studio albums, including six UK number one albums. The band have sold over 10 million albums worldwide.", "labels": "The band have also achieved seventeen Top 10 singles on the UK Singles Chart, including \"Dakota\" which hit number one in 2005.", "concept": "stereophonics"}, {"text": "This is a Wikipedia passage about roy beggs , jr. .. Roy Beggs Jr. (born 28 April 1956) is a Northern Irish politician who has been a Member of the Legislative Assembly (MLA) for East Antrim since 1998.", "labels": "He is a member of the Ulster Unionist Party (UUP).", "concept": "roy beggs , jr. ."}, {"text": "This is a Wikipedia passage about roy beggs , jr. .. Roy Beggs Jr. (born 28 April 1956) is a Northern Irish politician who has been a Member of the Legislative Assembly (MLA) for East Antrim since 1998. He is a member of the Ulster Unionist Party (UUP). Beggs was born in Larne, County Antrim, and was educated at Larne Grammar School and the University of Ulster.", "labels": "He worked as a civil servant before entering politics.", "concept": "roy beggs , jr. ."}, {"text": "This is a Wikipedia passage about roy beggs , jr. .. Roy Beggs Jr. (born 28 April 1956) is a Northern Irish politician who has been a Member of the Legislative Assembly (MLA) for East Antrim since 1998. He is a member of the Ulster Unionist Party (UUP). Beggs was born in Larne, County Antrim, and was educated at Larne Grammar School and the University of Ulster. He worked as a civil servant before entering politics. Beggs was first elected to the Northern Ireland Forum in 1996, representing East Antrim.", "labels": "He was re-elected to the Northern Ireland Assembly in 1998, and has held the seat ever since.", "concept": "roy beggs , jr. ."}, {"text": "This is a Wikipedia passage about roy beggs , jr. .. Roy Beggs Jr. (born 28 April 1956) is a Northern Irish politician who has been a Member of the Legislative Assembly (MLA) for East Antrim since 1998. He is a member of the Ulster Unionist Party (UUP). Beggs was born in Larne, County Antrim, and was educated at Larne Grammar School and the University of Ulster. He worked as a civil servant before entering politics. Beggs was first elected to the Northern Ireland Forum in 1996, representing East Antrim. He was re-elected to the Northern Ireland Assembly in 1998, and has held the seat ever since. He was appointed as the UUP's spokesperson on the environment in the Assembly in 2007.", "labels": "In 2011, he was appointed as the UUP's spokesperson on health.", "concept": "roy beggs , jr. ."}, {"text": "This is a Wikipedia passage about adiele afigbo. Adiele Afigbo (1941–2006) was a Nigerian historian and professor of African history at the University of Nigeria, Nsukka.", "labels": "He was a pioneer in the field of African history and was known for his work on the history of the Igbo people of Nigeria.", "concept": "adiele afigbo"}, {"text": "This is a Wikipedia passage about adiele afigbo. Adiele Afigbo (1941–2006) was a Nigerian historian and professor of African history at the University of Nigeria, Nsukka. He was a pioneer in the field of African history and was known for his work on the history of the Igbo people of Nigeria.", "labels": "He was also a major contributor to the development of African historiography.", "concept": "adiele afigbo"}, {"text": "This is a Wikipedia passage about adiele afigbo. Adiele Afigbo (1941–2006) was a Nigerian historian and professor of African history at the University of Nigeria, Nsukka. He was a pioneer in the field of African history and was known for his work on the history of the Igbo people of Nigeria. He was also a major contributor to the development of African historiography. Afigbo was born in 1941 in the town of Abiriba in Abia State, Nigeria. He attended the University of Ibadan, where he obtained a Bachelor of Arts degree in History in 1965. He then went on to pursue a Master of Arts degree in History at the University of London in 1967. He returned to Nigeria in 1968 and joined the faculty of the University of Nigeria, Nsukka, where he taught until his death in 2006.", "labels": "Afigbo was a prolific writer and researcher, and his works include The Warrant Chiefs: Indirect Rule in Southeastern Nigeria, 1891–1929 (1972), Ropes of Sand: Studies in Igbo History and Culture (1981), and The Abolition of the Slave Trade in S", "concept": "adiele afigbo"}, {"text": "This is a Wikipedia passage about brian petrovek. Brian Petrovek (born October 28, 1959) is an American businessman and former professional ice hockey executive.", "labels": "He is the former president and CEO of the Portland Pirates, a professional ice hockey team in the American Hockey League (AHL).", "concept": "brian petrovek"}, {"text": "This is a Wikipedia passage about john cushnahan. John Cushnahan (born 28 April 1945) is an Irish politician and former Member of the European Parliament (MEP) for the Dublin constituency. He was a member of the European Parliament from 1989 to 2004, and was a member of the Irish Senate from 1981 to 1989. He was a member of the Progressive Democrats from 1985 to 2007. Cushnahan was born in Dublin and educated at University College Dublin, where he studied law. He was called to the Bar in 1969 and practised as a barrister until 1981. He was a member of the Irish Senate from 1981 to 1989, and was elected to the European Parliament in 1989.", "labels": "He was re-elected in 1994 and 1999.", "concept": "john cushnahan"}, {"text": "This is a Wikipedia passage about bill tobin american football. Bill Tobin (born October 28, 1945) is an American football executive who has served in various capacities in the National Football League (NFL). He is currently the Vice President of Player Personnel for the Indianapolis Colts. Tobin began his NFL career in 1975 as a scout for the Chicago Bears. He was promoted to Director of Player Personnel in 1979 and held that position until 1987. During his tenure with the Bears, the team won Super Bowl XX. In 1988, Tobin joined the Phoenix Cardinals as Vice President of Player Personnel. He was promoted to General Manager in 1989 and held that position until 1993. During his time with the Cardinals, the team made the playoffs in 1998. In 1994, Tobin joined the Indianapolis Colts as Vice President of Player Personnel. He has held that position ever since. During his tenure with the Colts, the team won Super Bowl XLI. Tobin has been credited with helping to build the Bears and Colts teams that won Super Bowls.", "labels": "He has also been credited with helping to develop the careers of many NFL players, including Hall of Fam", "concept": "bill tobin american football"}, {"text": "This is a Wikipedia passage about william luther pierce. ", "labels": "William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white nationalist, neo-Nazi, and author.", "concept": "william luther pierce"}, {"text": "This is a Wikipedia passage about william luther pierce. William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white nationalist, neo-Nazi, and author.", "labels": "He was the founder and chairman of the National Alliance, a white nationalist group, from 1970 until his death in 2002.", "concept": "william luther pierce"}, {"text": "This is a Wikipedia passage about william luther pierce. William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white nationalist, neo-Nazi, and author. He was the founder and chairman of the National Alliance, a white nationalist group, from 1970 until his death in 2002.", "labels": "He was also the primary author of The Turner Diaries, a novel which depicts a violent revolution in the United States leading to the overthrow of the federal government and the extermination of non-whites and Jews.", "concept": "william luther pierce"}, {"text": "This is a Wikipedia passage about william luther pierce. William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white nationalist, neo-Nazi, and author. He was the founder and chairman of the National Alliance, a white nationalist group, from 1970 until his death in 2002. He was also the primary author of The Turner Diaries, a novel which depicts a violent revolution in the United States leading to the overthrow of the federal government and the extermination of non-whites and Jews.", "labels": "Pierce was born in Atlanta, Georgia, and attended Rice University and the University of Colorado Boulder.", "concept": "william luther pierce"}, {"text": "This is a Wikipedia passage about william luther pierce. William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white nationalist, neo-Nazi, and author. He was the founder and chairman of the National Alliance, a white nationalist group, from 1970 until his death in 2002. He was also the primary author of The Turner Diaries, a novel which depicts a violent revolution in the United States leading to the overthrow of the federal government and the extermination of non-whites and Jews. Pierce was born in Atlanta, Georgia, and attended Rice University and the University of Colorado Boulder. He was a physicist and worked on the staff of the American Institute of Physics and the George Washington University.", "labels": "He was also a member of the National Socialist White People's Party and the American Nazi Party.", "concept": "william luther pierce"}, {"text": "This is a Wikipedia passage about william luther pierce. William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white nationalist, neo-Nazi, and author. He was the founder and chairman of the National Alliance, a white nationalist group, from 1970 until his death in 2002. He was also the primary author of The Turner Diaries, a novel which depicts a violent revolution in the United States leading to the overthrow of the federal government and the extermination of non-whites and Jews. Pierce was born in Atlanta, Georgia, and attended Rice University and the University of Colorado Boulder. He was a physicist and worked on the staff of the American Institute of Physics and the George Washington University. He was also a member of the National Socialist White People's Party and the American Nazi Party.", "labels": "He was a vocal advocate of white separatism and white supremacy, and was a Holocaust denier.", "concept": "william luther pierce"}, {"text": "This is a Wikipedia passage about martina sorbara. ", "labels": "Martina Sorbara is a Canadian singer-songwriter and multi-instrumentalist.", "concept": "martina sorbara"}, {"text": "This is a Wikipedia passage about martina sorbara. Martina Sorbara is a Canadian singer-songwriter and multi-instrumentalist.", "labels": "She is best known as the lead singer and songwriter of the indie pop band Dragonette.", "concept": "martina sorbara"}, {"text": "This is a Wikipedia passage about martina sorbara. Martina Sorbara is a Canadian singer-songwriter and multi-instrumentalist. She is best known as the lead singer and songwriter of the indie pop band Dragonette. She has released two solo albums, Little Wild Life (2011) and Colours (2015).", "labels": "Sorbara was born in Toronto, Ontario, and began playing music at a young age.", "concept": "martina sorbara"}, {"text": "This is a Wikipedia passage about martina sorbara. Martina Sorbara is a Canadian singer-songwriter and multi-instrumentalist. She is best known as the lead singer and songwriter of the indie pop band Dragonette. She has released two solo albums, Little Wild Life (2011) and Colours (2015). Sorbara was born in Toronto, Ontario, and began playing music at a young age. She studied classical piano and voice, and later attended the University of Toronto, where she studied jazz and composition. She has also studied at the Royal Conservatory of Music.", "labels": "She has written and produced music for film and television, and has collaborated with artists such as Kaskade, Martin Solveig, and Basement Jaxx.", "concept": "martina sorbara"}, {"text": "This is a Wikipedia passage about tom wise. Tom Wise (born 28 April 1962) is a former British politician who was the Member of Parliament (MP) for the Isle of Wight from 2001 to 2005.", "labels": "He was elected as a member of the UK Independence Party (UKIP) but later sat as an independent.", "concept": "tom wise"}, {"text": "This is a Wikipedia passage about eden natan-zada. Eden Natan-Zada (Hebrew: עדן נתן-זדה‎; August 5, 1984 – August 4, 2005) was an Israeli soldier who perpetrated a shooting attack on a bus in the Israeli Arab town of Shfaram on August 4, 2005.", "labels": "Natan-Zada was a deserter from the Israel Defense Forces (IDF) who had been discharged from the army after being diagnosed with a mental disorder.", "concept": "eden natan-zada"}, {"text": "This is a Wikipedia passage about eden natan-zada. Eden Natan-Zada (Hebrew: עדן נתן-זדה‎; August 5, 1984 – August 4, 2005) was an Israeli soldier who perpetrated a shooting attack on a bus in the Israeli Arab town of Shfaram on August 4, 2005. Natan-Zada was a deserter from the Israel Defense Forces (IDF) who had been discharged from the army after being diagnosed with a mental disorder.", "labels": "He was killed by a mob of angry townspeople after he opened fire on the bus, killing four people and wounding several others.", "concept": "eden natan-zada"}, {"text": "This is a Wikipedia passage about wayne allyn root. ", "labels": "Wayne Allyn Root (born July 20, 1961) is an American businessman, political commentator, television and radio personality, author, and political candidate.", "concept": "wayne allyn root"}, {"text": "This is a Wikipedia passage about wayne allyn root. Wayne Allyn Root (born July 20, 1961) is an American businessman, political commentator, television and radio personality, author, and political candidate.", "labels": "He was the Libertarian Party's nominee for Vice President of the United States in the 2008 presidential election.", "concept": "wayne allyn root"}, {"text": "This is a Wikipedia passage about assassination of robert f. kennedy. ", "labels": "Robert F. Kennedy, the United States Senator from New York and brother of President John F. Kennedy, was assassinated on June 5, 1968, in Los Angeles, California, while campaigning for the Democratic nomination for President of the United States.", "concept": "assassination of robert f. kennedy"}, {"text": "This is a Wikipedia passage about assassination of robert f. kennedy. Robert F. Kennedy, the United States Senator from New York and brother of President John F. Kennedy, was assassinated on June 5, 1968, in Los Angeles, California, while campaigning for the Democratic nomination for President of the United States.", "labels": "Kennedy was mortally wounded shortly after midnight on June 5, 1968, in the Ambassador Hotel on Wilshire Boulevard in Los Angeles, and died 26 hours later at Good Samaritan Hospital.", "concept": "assassination of robert f. kennedy"}, {"text": "This is a Wikipedia passage about assassination of robert f. kennedy. Robert F. Kennedy, the United States Senator from New York and brother of President John F. Kennedy, was assassinated on June 5, 1968, in Los Angeles, California, while campaigning for the Democratic nomination for President of the United States. Kennedy was mortally wounded shortly after midnight on June 5, 1968, in the Ambassador Hotel on Wilshire Boulevard in Los Angeles, and died 26 hours later at Good Samaritan Hospital. He was shot by Sirhan Sirhan, a 24-year-old Palestinian man who had become a naturalized United States citizen 10 months earlier.", "labels": "Sirhan was convicted of Kennedy's murder and is serving a life sentence for the crime.", "concept": "assassination of robert f. kennedy"}, {"text": "This is a Wikipedia passage about paul caddis. Paul Caddis (born 28 October 1988) is a Scottish professional footballer who plays as a right back for League One club Burton Albion. Caddis began his career with Celtic, making his debut in 2006.", "labels": "He spent time on loan at Dundee and Dundee United before joining Swindon Town in 2010.", "concept": "paul caddis"}, {"text": "This is a Wikipedia passage about paul caddis. Paul Caddis (born 28 October 1988) is a Scottish professional footballer who plays as a right back for League One club Burton Albion. Caddis began his career with Celtic, making his debut in 2006. He spent time on loan at Dundee and Dundee United before joining Swindon Town in 2010. He was named in the PFA League One Team of the Year in 2012–13, and was appointed captain of Swindon in 2013. He joined Birmingham City in 2014, and was part of the team that won the Football League Trophy in the same year. He joined Blackburn Rovers in 2016, and was loaned to Burton Albion in 2017. He signed permanently for Burton in 2018.", "labels": "Caddis has represented Scotland at under-19 and under-21 level.", "concept": "paul caddis"}, {"text": "This is a Wikipedia passage about paul taylor winger. Paul Taylor (born Paul Taylor Winger on April 19, 1959) is an American singer-songwriter, multi-instrumentalist, and record producer. He is best known as the lead singer and songwriter of the band Winger. Taylor is also a solo artist, having released two albums, and has written and produced songs for other artists. Taylor was born in Cleveland, Ohio, and grew up in the suburbs of Chicago. He began playing guitar at the age of 12, and by the time he was 15, he was playing in local bands. He attended the University of Illinois at Urbana-Champaign, where he studied music and theater. After college, he moved to Los Angeles and formed the band Winger with Kip Winger, Reb Beach, and Rod Morgenstein.", "labels": "The band released four albums between 1988 and 1993, and had several hit singles, including \"Seventeen\" and \"Headed for a Heartbreak\".", "concept": "paul taylor winger"}, {"text": "This is a Wikipedia passage about linda hunt. ", "labels": "Linda Hunt (born April 2, 1945) is an American film, stage, and television actress.", "concept": "linda hunt"}, {"text": "This is a Wikipedia passage about linda hunt. Linda Hunt (born April 2, 1945) is an American film, stage, and television actress.", "labels": "After making her film debut playing Mrs. Oxheart in Popeye (1980), Hunt won the Academy Award for Best Supporting Actress for her performance as Billy Kwan, a male Chinese-Australian photographer, in The Year of Living Dangerously (1982).", "concept": "linda hunt"}, {"text": "This is a Wikipedia passage about linda hunt. Linda Hunt (born April 2, 1945) is an American film, stage, and television actress. After making her film debut playing Mrs. Oxheart in Popeye (1980), Hunt won the Academy Award for Best Supporting Actress for her performance as Billy Kwan, a male Chinese-Australian photographer, in The Year of Living Dangerously (1982).", "labels": "Her other film appearances include Dune (1984), Silverado (1985), Eleni (1985), Waiting for the Moon (1987), She-Devil (1989), Kindergarten Cop (1990), If Looks Could Kill (1991), The Relic (1997), and The Incredibles (2004).", "concept": "linda hunt"}, {"text": "This is a Wikipedia passage about linda hunt. Linda Hunt (born April 2, 1945) is an American film, stage, and television actress. After making her film debut playing Mrs. Oxheart in Popeye (1980), Hunt won the Academy Award for Best Supporting Actress for her performance as Billy Kwan, a male Chinese-Australian photographer, in The Year of Living Dangerously (1982). Her other film appearances include Dune (1984), Silverado (1985), Eleni (1985), Waiting for the Moon (1987), She-Devil (1989), Kindergarten Cop (1990), If Looks Could Kill (1991), The Relic (1997), and The Incredibles (2004).", "labels": "She has also had a successful career on television, with roles in shows such as NCIS:", "concept": "linda hunt"}, {"text": "This is a Wikipedia passage about jerry leger. ", "labels": "Jerry Leger is a Canadian singer-songwriter from Toronto, Ontario.", "concept": "jerry leger"}, {"text": "This is a Wikipedia passage about 3rd dalai lama. The Third Dalai Lama, Sonam Gyatso (1543–1588), was identified as the reincarnation of the Second Dalai Lama, Gendun Gyatso, and enthroned at the age of seven in 1550.", "labels": "He was a monk of the Gelug school of Tibetan Buddhism, and is credited with unifying the political and spiritual authority of Tibet.", "concept": "3rd dalai lama"}, {"text": "This is a Wikipedia passage about 3rd dalai lama. The Third Dalai Lama, Sonam Gyatso (1543–1588), was identified as the reincarnation of the Second Dalai Lama, Gendun Gyatso, and enthroned at the age of seven in 1550. He was a monk of the Gelug school of Tibetan Buddhism, and is credited with unifying the political and spiritual authority of Tibet. He established the Ganden Phodrang government, which governed Tibet until the mid-17th century. He was a prolific writer, and wrote many important works on Tibetan Buddhism, including a commentary on the Kalachakra Tantra. He also wrote a treatise on the unification of Tibet and the Mongolian regions to the east. He was also a great patron of the arts, and was responsible for the construction of many temples and monasteries.", "labels": "He died in 1588 at the age of 45.", "concept": "3rd dalai lama"}, {"text": "This is a Wikipedia passage about jack straw. ", "labels": "Jack Straw (born 3 August 1946) is a British Labour Party politician who served as the Member of Parliament (MP) for Blackburn from 1979 to 2015.", "concept": "jack straw"}, {"text": "This is a Wikipedia passage about jack straw. Jack Straw (born 3 August 1946) is a British Labour Party politician who served as the Member of Parliament (MP) for Blackburn from 1979 to 2015.", "labels": "He served in the Cabinet from 1997 to 2010 under the governments of Tony Blair and Gordon Brown.", "concept": "jack straw"}, {"text": "This is a Wikipedia passage about jack straw. Jack Straw (born 3 August 1946) is a British Labour Party politician who served as the Member of Parliament (MP) for Blackburn from 1979 to 2015. He served in the Cabinet from 1997 to 2010 under the governments of Tony Blair and Gordon Brown.", "labels": "Straw held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001 and Foreign Secretary from 2001 to 2006 under Blair.", "concept": "jack straw"}, {"text": "This is a Wikipedia passage about jack straw. Jack Straw (born 3 August 1946) is a British Labour Party politician who served as the Member of Parliament (MP) for Blackburn from 1979 to 2015. He served in the Cabinet from 1997 to 2010 under the governments of Tony Blair and Gordon Brown. Straw held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001 and Foreign Secretary from 2001 to 2006 under Blair.", "labels": "From 2007 to 2010 he served as Lord Chancellor and Secretary of State for Justice throughout Brown's premiership.", "concept": "jack straw"}, {"text": "This is a Wikipedia passage about jack straw. Jack Straw (born 3 August 1946) is a British Labour Party politician who served as the Member of Parliament (MP) for Blackburn from 1979 to 2015. He served in the Cabinet from 1997 to 2010 under the governments of Tony Blair and Gordon Brown. Straw held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001 and Foreign Secretary from 2001 to 2006 under Blair. From 2007 to 2010 he served as Lord Chancellor and Secretary of State for Justice throughout Brown's premiership.", "labels": "A former chair of the Labour Party, Straw was one of the few remaining links between the Labour governments led by Blair and Brown and the party's previous incarnation under Tony Benn, John Smith and Neil Kinnock.", "concept": "jack straw"}, {"text": "This is a Wikipedia passage about syd rapson. Syd Rapson (born Sydney Rapson, 28 April 1932 – 28 April 2017) was an English Labour Party politician who served as Member of Parliament (MP) for Portsmouth South from 1997 to 2010. Rapson was born in Portsmouth and educated at Portsmouth Grammar School and the University of Southampton. He worked as a teacher and a lecturer before entering politics.", "labels": "He was a councillor on Portsmouth City Council from 1973 to 1997, and was leader of the council from 1983 to 1997.", "concept": "syd rapson"}, {"text": "This is a Wikipedia passage about catherine johnson playwright. Catherine Johnson (born 1964) is a British playwright.", "labels": "She is best known for writing the book for the musical Mamma Mia!, which has been seen by over 60 million people worldwide.", "concept": "catherine johnson playwright"}, {"text": "This is a Wikipedia passage about sara montiel. ", "labels": "Sara Montiel (born María Antonia Abad Fernández; 10 March 1928 – 8 April 2013) was a Spanish singer, dancer, and actress.", "concept": "sara montiel"}, {"text": "This is a Wikipedia passage about sara montiel. Sara Montiel (born María Antonia Abad Fernández; 10 March 1928 – 8 April 2013) was a Spanish singer, dancer, and actress.", "labels": "She was a major figure in Spanish culture from the 1950s through the 1970s.", "concept": "sara montiel"}, {"text": "This is a Wikipedia passage about sara montiel. Sara Montiel (born María Antonia Abad Fernández; 10 March 1928 – 8 April 2013) was a Spanish singer, dancer, and actress. She was a major figure in Spanish culture from the 1950s through the 1970s.", "labels": "Montiel was born in Campo de Criptana, Ciudad Real, Castile-La Mancha, Spain.", "concept": "sara montiel"}, {"text": "This is a Wikipedia passage about sara montiel. Sara Montiel (born María Antonia Abad Fernández; 10 March 1928 – 8 April 2013) was a Spanish singer, dancer, and actress. She was a major figure in Spanish culture from the 1950s through the 1970s. Montiel was born in Campo de Criptana, Ciudad Real, Castile-La Mancha, Spain. She began her career as a singer in the early 1940s, and by the 1950s had become a major film star in Spain and Latin America. She starred in films such as La Violetera (1958), El Último Cuplé (1957), and La Belleza del Día (1962).", "labels": "Montiel was also a successful recording artist, releasing several albums throughout her career.", "concept": "sara montiel"}, {"text": "This is a Wikipedia passage about sara montiel. Sara Montiel (born María Antonia Abad Fernández; 10 March 1928 – 8 April 2013) was a Spanish singer, dancer, and actress. She was a major figure in Spanish culture from the 1950s through the 1970s. Montiel was born in Campo de Criptana, Ciudad Real, Castile-La Mancha, Spain. She began her career as a singer in the early 1940s, and by the 1950s had become a major film star in Spain and Latin America. She starred in films such as La Violetera (1958), El Último Cuplé (1957), and La Belleza del Día (1962). Montiel was also a successful recording artist, releasing several albums throughout her career. She was known for her flamboyant style and her signature song, \"Amor de Mis Amores\".", "labels": "Montiel died in Madrid in 2013 at the age of 85.", "concept": "sara montiel"}, {"text": "This is a Wikipedia passage about lucy akhurst. Lucy Akhurst (born 28 April 1971) is an English actress. She is best known for her roles in the films The Mummy Returns (2001), The Libertine (2004), and The Descent (2005).", "labels": "Akhurst was born in London, England.", "concept": "lucy akhurst"}, {"text": "This is a Wikipedia passage about william allan neilson. ", "labels": "William Allan Neilson (1869–1946) was an American educator and scholar.", "concept": "william allan neilson"}, {"text": "This is a Wikipedia passage about william allan neilson. William Allan Neilson (1869–1946) was an American educator and scholar. He was the president of Smith College from 1910 to 1939, and was a major figure in the development of the modern liberal arts college. Neilson was born in 1869 in New York City. He attended Harvard University, where he earned his bachelor's degree in 1891 and his master's degree in 1892.", "labels": "He then went on to teach at Harvard, eventually becoming a professor of English literature.", "concept": "william allan neilson"}, {"text": "This is a Wikipedia passage about william allan neilson. William Allan Neilson (1869–1946) was an American educator and scholar. He was the president of Smith College from 1910 to 1939, and was a major figure in the development of the modern liberal arts college. Neilson was born in 1869 in New York City. He attended Harvard University, where he earned his bachelor's degree in 1891 and his master's degree in 1892. He then went on to teach at Harvard, eventually becoming a professor of English literature. In 1910, he was appointed president of Smith College, a position he held until 1939.", "labels": "During his tenure at Smith, Neilson was instrumental in transforming the college from a small, local institution into a major national university.", "concept": "william allan neilson"}, {"text": "This is a Wikipedia passage about william allan neilson. William Allan Neilson (1869–1946) was an American educator and scholar. He was the president of Smith College from 1910 to 1939, and was a major figure in the development of the modern liberal arts college. Neilson was born in 1869 in New York City. He attended Harvard University, where he earned his bachelor's degree in 1891 and his master's degree in 1892. He then went on to teach at Harvard, eventually becoming a professor of English literature. In 1910, he was appointed president of Smith College, a position he held until 1939. During his tenure at Smith, Neilson was instrumental in transforming the college from a small, local institution into a major national university.", "labels": "He increased the size of the faculty, expanded the curriculum, and improved the college's financial stability.", "concept": "william allan neilson"}, {"text": "This is a Wikipedia passage about josiah mason. ", "labels": "Josiah Mason (1795–1881) was an English industrialist and philanthropist.", "concept": "josiah mason"}, {"text": "This is a Wikipedia passage about josiah mason. Josiah Mason (1795–1881) was an English industrialist and philanthropist.", "labels": "He was born in Kidderminster, Worcestershire, the son of a weaver.", "concept": "josiah mason"}, {"text": "This is a Wikipedia passage about josiah mason. Josiah Mason (1795–1881) was an English industrialist and philanthropist. He was born in Kidderminster, Worcestershire, the son of a weaver. He was apprenticed to a button maker in Birmingham, and in 1824 he established his own button-making business.", "labels": "He soon expanded into other metalworking trades, and by 1851 he had become one of the largest employers in Birmingham.", "concept": "josiah mason"}, {"text": "This is a Wikipedia passage about josiah mason. Josiah Mason (1795–1881) was an English industrialist and philanthropist. He was born in Kidderminster, Worcestershire, the son of a weaver. He was apprenticed to a button maker in Birmingham, and in 1824 he established his own button-making business. He soon expanded into other metalworking trades, and by 1851 he had become one of the largest employers in Birmingham.", "labels": "He was a major benefactor of the city, donating money to build a hospital, a college, and a school.", "concept": "josiah mason"}, {"text": "This is a Wikipedia passage about josiah mason. Josiah Mason (1795–1881) was an English industrialist and philanthropist. He was born in Kidderminster, Worcestershire, the son of a weaver. He was apprenticed to a button maker in Birmingham, and in 1824 he established his own button-making business. He soon expanded into other metalworking trades, and by 1851 he had become one of the largest employers in Birmingham. He was a major benefactor of the city, donating money to build a hospital, a college, and a school.", "labels": "He also founded Mason Science College, which later became part of the University of Birmingham.", "concept": "josiah mason"}, {"text": "This is a Wikipedia passage about josiah mason. Josiah Mason (1795–1881) was an English industrialist and philanthropist. He was born in Kidderminster, Worcestershire, the son of a weaver. He was apprenticed to a button maker in Birmingham, and in 1824 he established his own button-making business. He soon expanded into other metalworking trades, and by 1851 he had become one of the largest employers in Birmingham. He was a major benefactor of the city, donating money to build a hospital, a college, and a school. He also founded Mason Science College, which later became part of the University of Birmingham.", "labels": "He was knighted in 1872 for his philanthropic work.", "concept": "josiah mason"}, {"text": "This is a Wikipedia passage about george bovell. George Bovell III (born August 8, 1982) is a Trinidadian swimmer. He is a three-time Olympic medalist, a two-time world champion, and a former world record holder in the 50-meter freestyle.", "labels": "He is the first swimmer from Trinidad and Tobago to win an Olympic medal.", "concept": "george bovell"}, {"text": "This is a Wikipedia passage about anne de gaulle. ", "labels": "Anne de Gaulle (1928–1948) was the daughter of French President Charles de Gaulle and his wife Yvonne de Gaulle.", "concept": "anne de gaulle"}, {"text": "This is a Wikipedia passage about rusty stevens. \"Rusty Stevens (born Russell Stevens Jr., October 5, 1932 – October 24, 2000) was an American actor.", "labels": "He is best known for his role as Larry Mondello on the television series Leave It to Beaver.", "concept": "rusty stevens"}, {"text": "This is a Wikipedia passage about rusty stevens. \"Rusty Stevens (born Russell Stevens Jr., October 5, 1932 – October 24, 2000) was an American actor. He is best known for his role as Larry Mondello on the television series Leave It to Beaver. Stevens was born in Los Angeles, California, the son of Russell Stevens Sr. and his wife, the former Dorothy M. Smith. He began his acting career at the age of seven, appearing in the 1939 film The Story of Alexander Graham Bell. He went on to appear in numerous films and television shows, including The Adventures of Ozzie and Harriet, The Donna Reed Show, The Many Loves of Dobie Gillis, and The Monkees.", "labels": "In 1957, Stevens was cast as Larry Mondello, the Beaver's best friend, on Leave It to Beaver.", "concept": "rusty stevens"}, {"text": "This is a Wikipedia passage about john cameron alberta politician. John Cameron (1860–1937) was a Canadian politician who served in the Legislative Assembly of Alberta from 1921 to 1935. He was born in Scotland and immigrated to Canada in 1883. Cameron was first elected to the Alberta Legislature in the 1921 Alberta general election. He was re-elected in the 1926 Alberta general election and the 1930 Alberta general election. He served as a member of the United Farmers of Alberta caucus. Cameron was a strong advocate for rural Alberta and was a vocal opponent of the provincial government's policy of centralization. He was a proponent of the development of the province's natural resources and was a strong supporter of the Alberta Wheat Pool. He was also a strong advocate for the rights of farmers and was a vocal opponent of the Alberta government's policy of taxation. Cameron retired from politics in 1935 and died in 1937.", "labels": "He was buried in Edmonton's Beechmount Cemetery.", "concept": "john cameron alberta politician"}, {"text": "This is a Wikipedia passage about carole gist. Carole Gist (born April 28, 1969) is an American beauty pageant titleholder from Detroit, Michigan who was crowned Miss USA 1990.", "labels": "She was the first African-American woman to win the Miss USA title.", "concept": "carole gist"}, {"text": "This is a Wikipedia passage about carole gist. Carole Gist (born April 28, 1969) is an American beauty pageant titleholder from Detroit, Michigan who was crowned Miss USA 1990. She was the first African-American woman to win the Miss USA title. Gist represented the United States at the Miss Universe 1990 pageant held in Los Angeles, California, where she placed first runner-up to Mona Grudt of Norway.", "labels": "Gist was the first African-American woman to place in the Miss Universe pageant.", "concept": "carole gist"}, {"text": "This is a Wikipedia passage about david collings. David Collings (born 3 May 1940) is an English actor.", "labels": "He is best known for his roles in television series such as Doctor Who, Blake's 7, The Professionals, Minder, and EastEnders.", "concept": "david collings"}, {"text": "This is a Wikipedia passage about matt striebel. Matt Striebel (born October 15, 1978) is a former American lacrosse player who played professionally in Major League Lacrosse (MLL) and the National Lacrosse League (NLL). He was a four-time All-American at Princeton University, where he was a member of the 2001 NCAA championship team. He was drafted by the Philadelphia Barrage in the first round of the 2002 MLL draft and played for the Barrage until the team folded in 2008. He then joined the Boston Cannons, where he played until his retirement in 2013.", "labels": "Striebel was also a member of the United States men's national lacrosse team, winning a gold medal at the 2010 FIL World Lacrosse Championship.", "concept": "matt striebel"}, {"text": "This is a Wikipedia passage about bryan mcclendon. Bryan McClendon (born April 28, 1983) is an American football coach and former player.", "labels": "He is currently the offensive coordinator and quarterbacks coach at the University of Georgia.", "concept": "bryan mcclendon"}, {"text": "This is a Wikipedia passage about bryan mcclendon. Bryan McClendon (born April 28, 1983) is an American football coach and former player. He is currently the offensive coordinator and quarterbacks coach at the University of Georgia.", "labels": "He previously served as the co-offensive coordinator and running backs coach at the University of South Carolina.", "concept": "bryan mcclendon"}, {"text": "This is a Wikipedia passage about bryan mcclendon. Bryan McClendon (born April 28, 1983) is an American football coach and former player. He is currently the offensive coordinator and quarterbacks coach at the University of Georgia. He previously served as the co-offensive coordinator and running backs coach at the University of South Carolina.", "labels": "McClendon played college football at the University of Georgia, where he was a four-year letterman and two-year starter at wide receiver.", "concept": "bryan mcclendon"}, {"text": "This is a Wikipedia passage about bryan mcclendon. Bryan McClendon (born April 28, 1983) is an American football coach and former player. He is currently the offensive coordinator and quarterbacks coach at the University of Georgia. He previously served as the co-offensive coordinator and running backs coach at the University of South Carolina. McClendon played college football at the University of Georgia, where he was a four-year letterman and two-year starter at wide receiver. He was a member of the Bulldogs' 2002 SEC Championship team and the 2005 Sugar Bowl team.", "labels": "After his playing career, McClendon served as a graduate assistant at Georgia from 2006 to 2008.", "concept": "bryan mcclendon"}, {"text": "This is a Wikipedia passage about bryan mcclendon. Bryan McClendon (born April 28, 1983) is an American football coach and former player. He is currently the offensive coordinator and quarterbacks coach at the University of Georgia. He previously served as the co-offensive coordinator and running backs coach at the University of South Carolina. McClendon played college football at the University of Georgia, where he was a four-year letterman and two-year starter at wide receiver. He was a member of the Bulldogs' 2002 SEC Championship team and the 2005 Sugar Bowl team. After his playing career, McClendon served as a graduate assistant at Georgia from 2006 to 2008. He then served as the wide receivers coach at the University of Tennessee from 2009 to 2011.", "labels": "In 2012, he returned to Georgia as the running backs coach.", "concept": "bryan mcclendon"}, {"text": "This is a Wikipedia passage about bryan mcclendon. Bryan McClendon (born April 28, 1983) is an American football coach and former player. He is currently the offensive coordinator and quarterbacks coach at the University of Georgia. He previously served as the co-offensive coordinator and running backs coach at the University of South Carolina. McClendon played college football at the University of Georgia, where he was a four-year letterman and two-year starter at wide receiver. He was a member of the Bulldogs' 2002 SEC Championship team and the 2005 Sugar Bowl team. After his playing career, McClendon served as a graduate assistant at Georgia from 2006 to 2008. He then served as the wide receivers coach at the University of Tennessee from 2009 to 2011. In 2012, he returned to Georgia as the running backs coach. In 2014, he was promoted to co-offensive coordinator and running backs coach.", "labels": "In 2016, he left Georgia to become the co-offensive coordinator and running backs coach at South Carolina.", "concept": "bryan mcclendon"}, {"text": "This is a Wikipedia passage about carlos arniches. ", "labels": "Carlos Arniches y Barrera (1866–1943) was a Spanish dramatist and novelist.", "concept": "carlos arniches"}, {"text": "This is a Wikipedia passage about carlos arniches. Carlos Arniches y Barrera (1866–1943) was a Spanish dramatist and novelist. He was born in Alicante, Spain, and studied law in Madrid. He began writing plays in 1891, and his first success was El cabo primero (1893). He wrote more than fifty plays, many of which were adapted for the cinema.", "labels": "He also wrote novels, short stories, and essays.", "concept": "carlos arniches"}, {"text": "This is a Wikipedia passage about carlos arniches. Carlos Arniches y Barrera (1866–1943) was a Spanish dramatist and novelist. He was born in Alicante, Spain, and studied law in Madrid. He began writing plays in 1891, and his first success was El cabo primero (1893). He wrote more than fifty plays, many of which were adapted for the cinema. He also wrote novels, short stories, and essays.", "labels": "He was a member of the Generation of '98, a group of Spanish writers who sought to revive Spanish literature after the decline of Romanticism.", "concept": "carlos arniches"}, {"text": "This is a Wikipedia passage about carlos arniches. Carlos Arniches y Barrera (1866–1943) was a Spanish dramatist and novelist. He was born in Alicante, Spain, and studied law in Madrid. He began writing plays in 1891, and his first success was El cabo primero (1893). He wrote more than fifty plays, many of which were adapted for the cinema. He also wrote novels, short stories, and essays. He was a member of the Generation of '98, a group of Spanish writers who sought to revive Spanish literature after the decline of Romanticism. He was also a member of the Royal Spanish Academy.", "labels": "He died in Madrid in 1943.", "concept": "carlos arniches"}, {"text": "This is a Wikipedia passage about frankie lymon. ", "labels": "Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about frankie lymon. Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers.", "labels": "Lymon was one of the first African-American teenagers to be widely accepted as a teen idol.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about frankie lymon. Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers. Lymon was one of the first African-American teenagers to be widely accepted as a teen idol.", "labels": "He was noted for his high-pitched voice and his ability to sing in a \"whining\" style.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about frankie lymon. Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers. Lymon was one of the first African-American teenagers to be widely accepted as a teen idol. He was noted for his high-pitched voice and his ability to sing in a \"whining\" style.", "labels": "His group, The Teenagers, was composed of five boys, all of whom were in their mid-teens.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about frankie lymon. Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers. Lymon was one of the first African-American teenagers to be widely accepted as a teen idol. He was noted for his high-pitched voice and his ability to sing in a \"whining\" style. His group, The Teenagers, was composed of five boys, all of whom were in their mid-teens.", "labels": "The group had a number of hit singles, including \"Why Do Fools Fall in Love\", which was Lymon's biggest hit and one of the biggest hits of the rock and roll era.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about frankie lymon. Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers. Lymon was one of the first African-American teenagers to be widely accepted as a teen idol. He was noted for his high-pitched voice and his ability to sing in a \"whining\" style. His group, The Teenagers, was composed of five boys, all of whom were in their mid-teens. The group had a number of hit singles, including \"Why Do Fools Fall in Love\", which was Lymon's biggest hit and one of the biggest hits of the rock and roll era.", "labels": "Lymon's success as a singer and a performer was short-lived, however, as he struggled with drug addiction and personal problems.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about frankie lymon. Frankie Lymon (September 30, 1942 – February 27, 1968) was an American rock and roll/rhythm and blues singer and songwriter, best known as the lead singer of the New York City-based early rock and roll group The Teenagers. Lymon was one of the first African-American teenagers to be widely accepted as a teen idol. He was noted for his high-pitched voice and his ability to sing in a \"whining\" style. His group, The Teenagers, was composed of five boys, all of whom were in their mid-teens. The group had a number of hit singles, including \"Why Do Fools Fall in Love\", which was Lymon's biggest hit and one of the biggest hits of the rock and roll era. Lymon's success as a singer and a performer was short-lived, however, as he struggled with drug addiction and personal problems.", "labels": "He died of a drug overdose at the age of 25.", "concept": "frankie lymon"}, {"text": "This is a Wikipedia passage about ayn rand. ", "labels": "Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about ayn rand. Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher.", "labels": "She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about ayn rand. Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher. She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism.", "labels": "Educated in Russia, she moved to the United States in 1926.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about ayn rand. Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher. She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism. Educated in Russia, she moved to the United States in 1926.", "labels": "She had a play produced on Broadway in 1935 and 1936.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about ayn rand. Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher. She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism. Educated in Russia, she moved to the United States in 1926. She had a play produced on Broadway in 1935 and 1936.", "labels": "After two early novels that were initially unsuccessful, she achieved fame with her 1943 novel, The Fountainhead.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about ayn rand. Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher. She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism. Educated in Russia, she moved to the United States in 1926. She had a play produced on Broadway in 1935 and 1936. After two early novels that were initially unsuccessful, she achieved fame with her 1943 novel, The Fountainhead.", "labels": "In 1957, Rand published her best-known work, the novel Atlas Shrugged.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about ayn rand. Ayn Rand (born Alisa Zinov'yevna Rosenbaum; February 2 [O.S. January 20] 1905 – March 6, 1982) was a Russian-American writer and philosopher. She is known for her two best-selling novels, The Fountainhead and Atlas Shrugged, and for developing a philosophical system she called Objectivism. Educated in Russia, she moved to the United States in 1926. She had a play produced on Broadway in 1935 and 1936. After two early novels that were initially unsuccessful, she achieved fame with her 1943 novel, The Fountainhead. In 1957, Rand published her best-known work, the novel Atlas Shrugged.", "labels": "Afterward, she turned to non-fiction to promote her philosophy, publishing her own magazines and releasing several collections of essays until her death in 1982.", "concept": "ayn rand"}, {"text": "This is a Wikipedia passage about richard allen epstein. Richard Allen Epstein (born April 15, 1943) is an American legal scholar known for his writings on classical liberal topics such as torts, contracts, property law, and civil procedure.", "labels": "He is the Laurence A. Tisch Professor of Law at New York University School of Law, and the Peter and Kirsten Bedford Senior Fellow at the Hoover Institution.", "concept": "richard allen epstein"}, {"text": "This is a Wikipedia passage about richard allen epstein. Richard Allen Epstein (born April 15, 1943) is an American legal scholar known for his writings on classical liberal topics such as torts, contracts, property law, and civil procedure. He is the Laurence A. Tisch Professor of Law at New York University School of Law, and the Peter and Kirsten Bedford Senior Fellow at the Hoover Institution.", "labels": "He is also a visiting professor at the University of Chicago Law School.", "concept": "richard allen epstein"}, {"text": "This is a Wikipedia passage about richard allen epstein. Richard Allen Epstein (born April 15, 1943) is an American legal scholar known for his writings on classical liberal topics such as torts, contracts, property law, and civil procedure. He is the Laurence A. Tisch Professor of Law at New York University School of Law, and the Peter and Kirsten Bedford Senior Fellow at the Hoover Institution. He is also a visiting professor at the University of Chicago Law School.", "labels": "Epstein is a prolific author, having written more than twenty books and over two hundred articles.", "concept": "richard allen epstein"}, {"text": "This is a Wikipedia passage about tom butler actor. ", "labels": "Tom Butler is a Canadian actor.", "concept": "tom butler actor"}, {"text": "This is a Wikipedia passage about gordon hogg. Gordon Hogg (born October 28, 1951) is a Canadian politician who served as the Member of the Legislative Assembly of British Columbia for Surrey-White Rock from 2001 to 2017.", "labels": "He was a member of the British Columbia Liberal Party.", "concept": "gordon hogg"}, {"text": "This is a Wikipedia passage about gordon hogg. Gordon Hogg (born October 28, 1951) is a Canadian politician who served as the Member of the Legislative Assembly of British Columbia for Surrey-White Rock from 2001 to 2017. He was a member of the British Columbia Liberal Party. Hogg was first elected to the Legislative Assembly in the 2001 provincial election.", "labels": "He was re-elected in the 2005, 2009, and 2013 provincial elections.", "concept": "gordon hogg"}, {"text": "This is a Wikipedia passage about gordon hogg. Gordon Hogg (born October 28, 1951) is a Canadian politician who served as the Member of the Legislative Assembly of British Columbia for Surrey-White Rock from 2001 to 2017. He was a member of the British Columbia Liberal Party. Hogg was first elected to the Legislative Assembly in the 2001 provincial election. He was re-elected in the 2005, 2009, and 2013 provincial elections. He served as Minister of State for Mining, Minister of State for ActNow BC, Minister of State for Deregulation, Minister of State for Intergovernmental Relations, Minister of State for Climate Action, Minister of State for Seniors, and Minister of State for Rural Development.", "labels": "Hogg announced his retirement from politics in April 2017.", "concept": "gordon hogg"}, {"text": "This is a Wikipedia passage about gordon hogg. Gordon Hogg (born October 28, 1951) is a Canadian politician who served as the Member of the Legislative Assembly of British Columbia for Surrey-White Rock from 2001 to 2017. He was a member of the British Columbia Liberal Party. Hogg was first elected to the Legislative Assembly in the 2001 provincial election. He was re-elected in the 2005, 2009, and 2013 provincial elections. He served as Minister of State for Mining, Minister of State for ActNow BC, Minister of State for Deregulation, Minister of State for Intergovernmental Relations, Minister of State for Climate Action, Minister of State for Seniors, and Minister of State for Rural Development. Hogg announced his retirement from politics in April 2017.", "labels": "He was succeeded by Tracy Redies in the 2017 provincial election.", "concept": "gordon hogg"}, {"text": "This is a Wikipedia passage about vagos motorcycle club. ", "labels": "Vagos Motorcycle Club (Vagos) is an outlaw motorcycle club that was formed in San Bernardino, California in 1965.", "concept": "vagos motorcycle club"}, {"text": "This is a Wikipedia passage about vagos motorcycle club. Vagos Motorcycle Club (Vagos) is an outlaw motorcycle club that was formed in San Bernardino, California in 1965.", "labels": "The club is known for its involvement in criminal activities such as drug trafficking, extortion, and murder.", "concept": "vagos motorcycle club"}, {"text": "This is a Wikipedia passage about vagos motorcycle club. Vagos Motorcycle Club (Vagos) is an outlaw motorcycle club that was formed in San Bernardino, California in 1965. The club is known for its involvement in criminal activities such as drug trafficking, extortion, and murder.", "labels": "The Vagos have a presence in the United States, Mexico, and Canada, and are estimated to have over 2,000 members.", "concept": "vagos motorcycle club"}, {"text": "This is a Wikipedia passage about vagos motorcycle club. Vagos Motorcycle Club (Vagos) is an outlaw motorcycle club that was formed in San Bernardino, California in 1965. The club is known for its involvement in criminal activities such as drug trafficking, extortion, and murder. The Vagos have a presence in the United States, Mexico, and Canada, and are estimated to have over 2,000 members.", "labels": "The club is also known for its rivalry with the Hells Angels Motorcycle Club.", "concept": "vagos motorcycle club"}, {"text": "This is a Wikipedia passage about vagos motorcycle club. Vagos Motorcycle Club (Vagos) is an outlaw motorcycle club that was formed in San Bernardino, California in 1965. The club is known for its involvement in criminal activities such as drug trafficking, extortion, and murder. The Vagos have a presence in the United States, Mexico, and Canada, and are estimated to have over 2,000 members. The club is also known for its rivalry with the Hells Angels Motorcycle Club. The Vagos Motorcycle Club was founded in 1965 by a group of Mexican-American war veterans in San Bernardino, California. The club was originally formed as a social club for Mexican-American bikers, but soon began to engage in criminal activities such as drug trafficking, extortion, and murder.", "labels": "The Vagos have a presence in the United States, Mexico, and Canada, and are estimated to have over 2,000 members.", "concept": "vagos motorcycle club"}, {"text": "This is a Wikipedia passage about vagos motorcycle club. Vagos Motorcycle Club (Vagos) is an outlaw motorcycle club that was formed in San Bernardino, California in 1965. The club is known for its involvement in criminal activities such as drug trafficking, extortion, and murder. The Vagos have a presence in the United States, Mexico, and Canada, and are estimated to have over 2,000 members. The club is also known for its rivalry with the Hells Angels Motorcycle Club. The Vagos Motorcycle Club was founded in 1965 by a group of Mexican-American war veterans in San Bernardino, California. The club was originally formed as a social club for Mexican-American bikers, but soon began to engage in criminal activities such as drug trafficking, extortion, and murder. The Vagos have a presence in the United States, Mexico, and Canada, and are estimated to have over 2,000 members.", "labels": "The club is also known for its rivalry with the Hells Angels Motorcycle Club.", "concept": "vagos motorcycle club"}, {"text": "This is a Wikipedia passage about katie ledecky. ", "labels": "Katie Ledecky (born March 17, 1997) is an American competitive swimmer.", "concept": "katie ledecky"}, {"text": "This is a Wikipedia passage about katie ledecky. Katie Ledecky (born March 17, 1997) is an American competitive swimmer. She has won five Olympic gold medals and 15 world championship gold medals, the most in history for a female swimmer.", "labels": "Ledecky holds the world records in the women's 400-, 800-, and 1500-meter freestyle (long course).", "concept": "katie ledecky"}, {"text": "This is a Wikipedia passage about katie ledecky. Katie Ledecky (born March 17, 1997) is an American competitive swimmer. She has won five Olympic gold medals and 15 world championship gold medals, the most in history for a female swimmer. Ledecky holds the world records in the women's 400-, 800-, and 1500-meter freestyle (long course).", "labels": "She also holds the fastest-ever times in the women's 500-, 1000-, and 1650-yard freestyle (short course).", "concept": "katie ledecky"}, {"text": "This is a Wikipedia passage about katie ledecky. Katie Ledecky (born March 17, 1997) is an American competitive swimmer. She has won five Olympic gold medals and 15 world championship gold medals, the most in history for a female swimmer. Ledecky holds the world records in the women's 400-, 800-, and 1500-meter freestyle (long course). She also holds the fastest-ever times in the women's 500-, 1000-, and 1650-yard freestyle (short course). Ledecky has broken 28 world records in her career. She is the first woman to have won the 200-, 400-, 800-, and 1500-meter freestyle events at a major international competition.", "labels": "Ledecky is the most decorated female swimmer in World Championship history, and the second-most decorated swimmer of either gender, behind only Michael Phelps.", "concept": "katie ledecky"}, {"text": "This is a Wikipedia passage about michael savage. ", "labels": "Michael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and conservative political commentator.", "concept": "michael savage"}, {"text": "This is a Wikipedia passage about michael savage. Michael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and conservative political commentator.", "labels": "He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States.", "concept": "michael savage"}, {"text": "This is a Wikipedia passage about michael savage. Michael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and conservative political commentator. He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States.", "labels": "Since October 23, 2012, Michael Savage has been syndicated by Cumulus Media Networks.", "concept": "michael savage"}, {"text": "This is a Wikipedia passage about michael savage. Michael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and conservative political commentator. He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. Since October 23, 2012, Michael Savage has been syndicated by Cumulus Media Networks.", "labels": "He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine.", "concept": "michael savage"}, {"text": "This is a Wikipedia passage about michael savage. Michael Alan Weiner (born March 31, 1942), better known by his professional name Michael Savage, is an American radio host, author, activist, nutritionist, and conservative political commentator. He is the host of The Savage Nation, a nationally syndicated talk show that aired on Talk Radio Network across the United States until 2012, and in 2009 was the second most listened-to radio talk show in the country with an audience of over 20 million listeners on 400 stations across the United States. Since October 23, 2012, Michael Savage has been syndicated by Cumulus Media Networks. He holds master's degrees from the University of Hawaii in medical botany and medical anthropology, and a Ph.D. from the University of California, Berkeley in nutritional ethnomedicine.", "labels": "As Michael Weiner, he has written books on nutrition, herbal medicine, and homeopathy.", "concept": "michael savage"}, {"text": "This is a Wikipedia passage about john howe illustrator. ", "labels": "John Howe (born August 21, 1957) is a Canadian illustrator, living in Neuchâtel, Switzerland.", "concept": "john howe illustrator"}, {"text": "This is a Wikipedia passage about john howe illustrator. John Howe (born August 21, 1957) is a Canadian illustrator, living in Neuchâtel, Switzerland.", "labels": "He is best known for his illustrations for J. R. R. Tolkien's works, such as The Lord of the Rings and The Hobbit.", "concept": "john howe illustrator"}, {"text": "This is a Wikipedia passage about john howe illustrator. John Howe (born August 21, 1957) is a Canadian illustrator, living in Neuchâtel, Switzerland. He is best known for his illustrations for J. R. R. Tolkien's works, such as The Lord of the Rings and The Hobbit. He has also illustrated books for other authors, such as The King of Elfland's Daughter by Lord Dunsany, The Worm Ouroboros by E. R. Eddison, and The Mabinogion Tetralogy by Evangeline Walton.", "labels": "Howe has also worked as a conceptual designer for films, including The Lord of the Rings film trilogy, directed by Peter Jackson.", "concept": "john howe illustrator"}, {"text": "This is a Wikipedia passage about john howe illustrator. John Howe (born August 21, 1957) is a Canadian illustrator, living in Neuchâtel, Switzerland. He is best known for his illustrations for J. R. R. Tolkien's works, such as The Lord of the Rings and The Hobbit. He has also illustrated books for other authors, such as The King of Elfland's Daughter by Lord Dunsany, The Worm Ouroboros by E. R. Eddison, and The Mabinogion Tetralogy by Evangeline Walton. Howe has also worked as a conceptual designer for films, including The Lord of the Rings film trilogy, directed by Peter Jackson.", "labels": "He was also a conceptual designer for the films The Chronicles of Narnia: The Lion, the Witch and the Wardrobe and The Golden Compass.", "concept": "john howe illustrator"}, {"text": "This is a Wikipedia passage about alana davis. Alana Davis (born October 3, 1968) is an American singer-songwriter and musician.", "labels": "She is best known for her hit single \"32 Flavors\", which was released in 1997 and reached number 28 on the Billboard Hot 100.", "concept": "alana davis"}, {"text": "This is a Wikipedia passage about arthur sewall. Arthur Sewall (August 9, 1835 – April 14, 1900) was an American businessman and politician from Maine.", "labels": "He was the Democratic Party's nominee for Vice President of the United States in 1896, running on a ticket with William Jennings Bryan.", "concept": "arthur sewall"}, {"text": "This is a Wikipedia passage about arthur sewall. Arthur Sewall (August 9, 1835 – April 14, 1900) was an American businessman and politician from Maine. He was the Democratic Party's nominee for Vice President of the United States in 1896, running on a ticket with William Jennings Bryan. Sewall was born in Bath, Maine, the son of Hannah and Samuel Sewall. He attended Bowdoin College, graduating in 1856. He then worked in the family lumber business, and later became a partner in the shipbuilding firm of Sewall & Benson. He was a member of the Maine House of Representatives from 1871 to 1872 and served in the Maine Senate from 1873 to 1874. He was a delegate to the Democratic National Convention in 1876 and 1880.", "labels": "In 1896, Sewall was chosen as the Democratic vice presidential nominee, running with William Jennings Bryan.", "concept": "arthur sewall"}, {"text": "This is a Wikipedia passage about arthur sewall. Arthur Sewall (August 9, 1835 – April 14, 1900) was an American businessman and politician from Maine. He was the Democratic Party's nominee for Vice President of the United States in 1896, running on a ticket with William Jennings Bryan. Sewall was born in Bath, Maine, the son of Hannah and Samuel Sewall. He attended Bowdoin College, graduating in 1856. He then worked in the family lumber business, and later became a partner in the shipbuilding firm of Sewall & Benson. He was a member of the Maine House of Representatives from 1871 to 1872 and served in the Maine Senate from 1873 to 1874. He was a delegate to the Democratic National Convention in 1876 and 1880. In 1896, Sewall was chosen as the Democratic vice presidential nominee, running with William Jennings Bryan.", "labels": "The ticket was defeated by the Republican ticket of William McKinley and Garret Hobart.", "concept": "arthur sewall"}, {"text": "This is a Wikipedia passage about arthur sewall. Arthur Sewall (August 9, 1835 – April 14, 1900) was an American businessman and politician from Maine. He was the Democratic Party's nominee for Vice President of the United States in 1896, running on a ticket with William Jennings Bryan. Sewall was born in Bath, Maine, the son of Hannah and Samuel Sewall. He attended Bowdoin College, graduating in 1856. He then worked in the family lumber business, and later became a partner in the shipbuilding firm of Sewall & Benson. He was a member of the Maine House of Representatives from 1871 to 1872 and served in the Maine Senate from 1873 to 1874. He was a delegate to the Democratic National Convention in 1876 and 1880. In 1896, Sewall was chosen as the Democratic vice presidential nominee, running with William Jennings Bryan. The ticket was defeated by the Republican ticket of William McKinley and Garret Hobart.", "labels": "Sewall died in 1900 in Bath, Maine.", "concept": "arthur sewall"}, {"text": "This is a Wikipedia passage about ithamara koorax. Ithamara Koorax (born Ithamara Koorax de Castro Lobo, April 28, 1958) is a Brazilian jazz singer.", "labels": "She has released more than 20 albums, and has performed with many of the world's leading jazz musicians, including Herbie Hancock, Ron Carter, and Wynton Marsalis.", "concept": "ithamara koorax"}, {"text": "This is a Wikipedia passage about ithamara koorax. Ithamara Koorax (born Ithamara Koorax de Castro Lobo, April 28, 1958) is a Brazilian jazz singer. She has released more than 20 albums, and has performed with many of the world's leading jazz musicians, including Herbie Hancock, Ron Carter, and Wynton Marsalis.", "labels": "Koorax has been praised for her ability to combine Brazilian rhythms with jazz, and for her powerful and emotive vocal style.", "concept": "ithamara koorax"}, {"text": "This is a Wikipedia passage about ithamara koorax. Ithamara Koorax (born Ithamara Koorax de Castro Lobo, April 28, 1958) is a Brazilian jazz singer. She has released more than 20 albums, and has performed with many of the world's leading jazz musicians, including Herbie Hancock, Ron Carter, and Wynton Marsalis. Koorax has been praised for her ability to combine Brazilian rhythms with jazz, and for her powerful and emotive vocal style.", "labels": "She has been described as \"one of the most important Brazilian jazz singers of the last two decades\".", "concept": "ithamara koorax"}, {"text": "This is a Wikipedia passage about thomas wolfe. ", "labels": "Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about thomas wolfe. Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century.", "labels": "Wolfe wrote four lengthy novels, plus many short stories, dramatic works, and novellas.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about thomas wolfe. Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century. Wolfe wrote four lengthy novels, plus many short stories, dramatic works, and novellas.", "labels": "He is known for mixing highly original, poetic, rhapsodic, and impressionistic prose with autobiographical writing.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about thomas wolfe. Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century. Wolfe wrote four lengthy novels, plus many short stories, dramatic works, and novellas. He is known for mixing highly original, poetic, rhapsodic, and impressionistic prose with autobiographical writing.", "labels": "His books, written and published from the 1920s to the 1940s, vividly reflect on American culture and the mores of that period.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about thomas wolfe. Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century. Wolfe wrote four lengthy novels, plus many short stories, dramatic works, and novellas. He is known for mixing highly original, poetic, rhapsodic, and impressionistic prose with autobiographical writing. His books, written and published from the 1920s to the 1940s, vividly reflect on American culture and the mores of that period.", "labels": "His first novel, Look Homeward, Angel (1929), was a success.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about thomas wolfe. Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century. Wolfe wrote four lengthy novels, plus many short stories, dramatic works, and novellas. He is known for mixing highly original, poetic, rhapsodic, and impressionistic prose with autobiographical writing. His books, written and published from the 1920s to the 1940s, vividly reflect on American culture and the mores of that period. His first novel, Look Homeward, Angel (1929), was a success.", "labels": "Wolfe's other novels—Of Time and the River (1935), The Web and the Rock (1939), and You Can't Go Home Again (1940)—were less successful but remain highly regarded.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about thomas wolfe. Thomas Clayton Wolfe (October 3, 1900 – September 15, 1938) was an American novelist of the early twentieth century. Wolfe wrote four lengthy novels, plus many short stories, dramatic works, and novellas. He is known for mixing highly original, poetic, rhapsodic, and impressionistic prose with autobiographical writing. His books, written and published from the 1920s to the 1940s, vividly reflect on American culture and the mores of that period. His first novel, Look Homeward, Angel (1929), was a success. Wolfe's other novels—Of Time and the River (1935), The Web and the Rock (1939), and You Can't Go Home Again (1940)—were less successful but remain highly regarded.", "labels": "He is considered a major American modernist writer.", "concept": "thomas wolfe"}, {"text": "This is a Wikipedia passage about rickey paulding. Rickey Paulding (born October 5, 1981) is an American professional basketball player who last played for the Austin Spurs of the NBA G League. He played college basketball for the University of Detroit Mercy.", "labels": "Paulding was selected by the Detroit Pistons in the second round of the 2004 NBA draft.", "concept": "rickey paulding"}, {"text": "This is a Wikipedia passage about charles melville hays. ", "labels": "Charles Melville Hays (1856 – 15 April 1912) was a Canadian railway executive.", "concept": "charles melville hays"}, {"text": "This is a Wikipedia passage about charles melville hays. Charles Melville Hays (1856 – 15 April 1912) was a Canadian railway executive. He was the president of the Grand Trunk Railway (GTR) from 1899 until his death in 1912.", "labels": "He was responsible for the construction of the GTR's transcontinental line from Montreal to Vancouver, and for the construction of the Grand Trunk Pacific Railway (GTPR) from Winnipeg to Prince Rupert, British Columbia.", "concept": "charles melville hays"}, {"text": "This is a Wikipedia passage about charles melville hays. Charles Melville Hays (1856 – 15 April 1912) was a Canadian railway executive. He was the president of the Grand Trunk Railway (GTR) from 1899 until his death in 1912. He was responsible for the construction of the GTR's transcontinental line from Montreal to Vancouver, and for the construction of the Grand Trunk Pacific Railway (GTPR) from Winnipeg to Prince Rupert, British Columbia.", "labels": "He was also responsible for the construction of the GTR's network of hotels, including the Château Laurier in Ottawa.", "concept": "charles melville hays"}, {"text": "This is a Wikipedia passage about charles melville hays. Charles Melville Hays (1856 – 15 April 1912) was a Canadian railway executive. He was the president of the Grand Trunk Railway (GTR) from 1899 until his death in 1912. He was responsible for the construction of the GTR's transcontinental line from Montreal to Vancouver, and for the construction of the Grand Trunk Pacific Railway (GTPR) from Winnipeg to Prince Rupert, British Columbia. He was also responsible for the construction of the GTR's network of hotels, including the Château Laurier in Ottawa. Hays was born in Rockwood, Ontario, and began his career as a railway clerk in 1872. He rose through the ranks of the GTR, becoming general manager in 1892 and president in 1899.", "labels": "He was a strong advocate of the transcontinental railway, and was instrumental in securing the necessary funding from the Canadian government.", "concept": "charles melville hays"}, {"text": "This is a Wikipedia passage about charles melville hays. Charles Melville Hays (1856 – 15 April 1912) was a Canadian railway executive. He was the president of the Grand Trunk Railway (GTR) from 1899 until his death in 1912. He was responsible for the construction of the GTR's transcontinental line from Montreal to Vancouver, and for the construction of the Grand Trunk Pacific Railway (GTPR) from Winnipeg to Prince Rupert, British Columbia. He was also responsible for the construction of the GTR's network of hotels, including the Château Laurier in Ottawa. Hays was born in Rockwood, Ontario, and began his career as a railway clerk in 1872. He rose through the ranks of the GTR, becoming general manager in 1892 and president in 1899. He was a strong advocate of the transcontinental railway, and was instrumental in securing the necessary funding from the Canadian government.", "labels": "He was also responsible for the construction of the GTR's network of hotels, including the Château Laurier in Ottawa.", "concept": "charles melville hays"}, {"text": "This is a Wikipedia passage about charles melville hays. Charles Melville Hays (1856 – 15 April 1912) was a Canadian railway executive. He was the president of the Grand Trunk Railway (GTR) from 1899 until his death in 1912. He was responsible for the construction of the GTR's transcontinental line from Montreal to Vancouver, and for the construction of the Grand Trunk Pacific Railway (GTPR) from Winnipeg to Prince Rupert, British Columbia. He was also responsible for the construction of the GTR's network of hotels, including the Château Laurier in Ottawa. Hays was born in Rockwood, Ontario, and began his career as a railway clerk in 1872. He rose through the ranks of the GTR, becoming general manager in 1892 and president in 1899. He was a strong advocate of the transcontinental railway, and was instrumental in securing the necessary funding from the Canadian government. He was also responsible for the construction of the GTR's network of hotels, including the Château Laurier in Ottawa.", "labels": "Hays was a visionary leader who was determined to make the GTR a success.", "concept": "charles melville hays"}, {"text": "This is a Wikipedia passage about bane band. Bane is a hardcore punk band from Washington, D.C., formed in 1995. The band consists of Aaron Bedard (vocals), Zach Jordan (guitar), Aaron Dalbec (guitar), Joe Trohman (bass) and Damian Genuardi (drums). Bane is known for their intense live shows and their positive lyrics.", "labels": "They have released five full-length albums, as well as several EPs and splits.", "concept": "bane band"}, {"text": "This is a Wikipedia passage about bane band. Bane is a hardcore punk band from Washington, D.C., formed in 1995. The band consists of Aaron Bedard (vocals), Zach Jordan (guitar), Aaron Dalbec (guitar), Joe Trohman (bass) and Damian Genuardi (drums). Bane is known for their intense live shows and their positive lyrics. They have released five full-length albums, as well as several EPs and splits.", "labels": "Their most recent album, Don't Wait Up, was released in 2014.", "concept": "bane band"}, {"text": "This is a Wikipedia passage about bane band. Bane is a hardcore punk band from Washington, D.C., formed in 1995. The band consists of Aaron Bedard (vocals), Zach Jordan (guitar), Aaron Dalbec (guitar), Joe Trohman (bass) and Damian Genuardi (drums). Bane is known for their intense live shows and their positive lyrics. They have released five full-length albums, as well as several EPs and splits. Their most recent album, Don't Wait Up, was released in 2014.", "labels": "The band has toured extensively throughout the United States, Europe, and Japan.", "concept": "bane band"}, {"text": "This is a Wikipedia passage about bane band. Bane is a hardcore punk band from Washington, D.C., formed in 1995. The band consists of Aaron Bedard (vocals), Zach Jordan (guitar), Aaron Dalbec (guitar), Joe Trohman (bass) and Damian Genuardi (drums). Bane is known for their intense live shows and their positive lyrics. They have released five full-length albums, as well as several EPs and splits. Their most recent album, Don't Wait Up, was released in 2014. The band has toured extensively throughout the United States, Europe, and Japan.", "labels": "They have also performed at festivals such as Hellfest, Groezrock, and Sound and Fury.", "concept": "bane band"}, {"text": "This is a Wikipedia passage about alan dinehart. Alan Dinehart (April 17, 1888 – October 28, 1944) was an American actor of the silent and early sound film eras. He appeared in more than 200 films between 1915 and 1944, often playing suave, debonair leading men. Dinehart was born in New York City and began his career on the stage. He made his film debut in 1915 and quickly became a popular leading man in silent films. He was often cast as a romantic lead opposite stars such as Mary Pickford, Lillian Gish, and Clara Bow. He also appeared in a number of westerns, including The Covered Wagon (1923) and The Iron Horse (1924). In the early 1930s, Dinehart transitioned to sound films, appearing in a number of popular films such as The Big Broadcast (1932), The Invisible Man (1933), and The Little Minister (1934).", "labels": "He continued to appear in films until his death in 1944.", "concept": "alan dinehart"}, {"text": "This is a Wikipedia passage about sylvain barrier. Sylvain Barrier (born 28 April 1992) is a French motorcycle racer. He is the 2014 FIM Superstock 1000 Cup champion. Barrier began his career in the French 125cc Championship in 2006, before moving to the European Superstock 600 Championship in 2008. He finished third in the championship in 2009, and second in 2010. In 2011, he moved to the FIM Superstock 1000 Cup, where he finished fourth in the championship.", "labels": "In 2012, Barrier won the FIM Superstock 1000 Cup championship, becoming the first French rider to do so.", "concept": "sylvain barrier"}, {"text": "This is a Wikipedia passage about robert emmett keane. Robert Emmett Keane (1886–1947) was an American actor, director, and producer.", "labels": "He was born in New York City and began his career in vaudeville.", "concept": "robert emmett keane"}, {"text": "This is a Wikipedia passage about robert emmett keane. Robert Emmett Keane (1886–1947) was an American actor, director, and producer. He was born in New York City and began his career in vaudeville.", "labels": "He later moved to Broadway, where he appeared in a number of plays and musicals.", "concept": "robert emmett keane"}, {"text": "This is a Wikipedia passage about charlotte rae. ", "labels": "Charlotte Rae (born Charlotte Rae Lubotsky; April 22, 1926 – August 5, 2018) was an American character actress, comedian, singer, and dancer whose career spanned seven decades.", "concept": "charlotte rae"}, {"text": "This is a Wikipedia passage about charlotte rae. Charlotte Rae (born Charlotte Rae Lubotsky; April 22, 1926 – August 5, 2018) was an American character actress, comedian, singer, and dancer whose career spanned seven decades.", "labels": "She was known for her portrayal of Edna Garrett in the sitcoms Diff'rent Strokes and The Facts of Life.", "concept": "charlotte rae"}, {"text": "This is a Wikipedia passage about charlotte rae. Charlotte Rae (born Charlotte Rae Lubotsky; April 22, 1926 – August 5, 2018) was an American character actress, comedian, singer, and dancer whose career spanned seven decades. She was known for her portrayal of Edna Garrett in the sitcoms Diff'rent Strokes and The Facts of Life. She received a Primetime Emmy Award nomination for her performance in the ABC Afterschool Special The Loneliest Runner (1976).", "labels": "She also appeared in many other television shows and films, including Car 54, Where Are You?, All in the Family, Pretty Little Liars, and You Again?.", "concept": "charlotte rae"}, {"text": "This is a Wikipedia passage about riccardo tisci. ", "labels": "Riccardo Tisci (born 1974) is an Italian fashion designer.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer.", "labels": "He is the former Creative Director of Givenchy, a French luxury fashion and perfume house.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house.", "labels": "He was the first designer of Italian origin to be appointed to the position.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position.", "labels": "Tisci was born in 1974 in Taranto, Italy.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy.", "labels": "He studied at the London College of Fashion and Central Saint Martins College of Art and Design.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy. He studied at the London College of Fashion and Central Saint Martins College of Art and Design.", "labels": "He began his career in fashion in the early 2000s, working as a freelance designer for various fashion houses.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy. He studied at the London College of Fashion and Central Saint Martins College of Art and Design. He began his career in fashion in the early 2000s, working as a freelance designer for various fashion houses.", "labels": "In 2005, he was appointed Creative Director of Givenchy, where he remained until 2017.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy. He studied at the London College of Fashion and Central Saint Martins College of Art and Design. He began his career in fashion in the early 2000s, working as a freelance designer for various fashion houses. In 2005, he was appointed Creative Director of Givenchy, where he remained until 2017.", "labels": "During his tenure at Givenchy, Tisci was credited with reviving the brand's fortunes.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy. He studied at the London College of Fashion and Central Saint Martins College of Art and Design. He began his career in fashion in the early 2000s, working as a freelance designer for various fashion houses. In 2005, he was appointed Creative Director of Givenchy, where he remained until 2017. During his tenure at Givenchy, Tisci was credited with reviving the brand's fortunes. He was praised for his modern, edgy designs, which often featured bold prints and streetwear-inspired silhouettes.", "labels": "He also collaborated with a number of high-profile celebrities, including Madonna, Kanye West, and Beyoncé.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy. He studied at the London College of Fashion and Central Saint Martins College of Art and Design. He began his career in fashion in the early 2000s, working as a freelance designer for various fashion houses. In 2005, he was appointed Creative Director of Givenchy, where he remained until 2017. During his tenure at Givenchy, Tisci was credited with reviving the brand's fortunes. He was praised for his modern, edgy designs, which often featured bold prints and streetwear-inspired silhouettes. He also collaborated with a number of high-profile celebrities, including Madonna, Kanye West, and Beyoncé.", "labels": "Tisci left Givenchy in 2017 and was succeeded by Clare Waight Keller.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about riccardo tisci. Riccardo Tisci (born 1974) is an Italian fashion designer. He is the former Creative Director of Givenchy, a French luxury fashion and perfume house. He was the first designer of Italian origin to be appointed to the position. Tisci was born in 1974 in Taranto, Italy. He studied at the London College of Fashion and Central Saint Martins College of Art and Design. He began his career in fashion in the early 2000s, working as a freelance designer for various fashion houses. In 2005, he was appointed Creative Director of Givenchy, where he remained until 2017. During his tenure at Givenchy, Tisci was credited with reviving the brand's fortunes. He was praised for his modern, edgy designs, which often featured bold prints and streetwear-inspired silhouettes. He also collaborated with a number of high-profile celebrities, including Madonna, Kanye West, and Beyoncé. Tisci left Givenchy in 2017 and was succeeded by Clare Waight Keller.", "labels": "He is currently the Creative Director of Burberry.", "concept": "riccardo tisci"}, {"text": "This is a Wikipedia passage about lester germer. ", "labels": "Lester Germer (1896–1971) was an American physicist who is best known for his work in the field of low-temperature physics.", "concept": "lester germer"}, {"text": "This is a Wikipedia passage about lester germer. Lester Germer (1896–1971) was an American physicist who is best known for his work in the field of low-temperature physics. He was a pioneer in the development of the field of cryogenics, and was the first to liquefy helium in the United States.", "labels": "He was also a key figure in the development of the electron microscope.", "concept": "lester germer"}, {"text": "This is a Wikipedia passage about lester germer. Lester Germer (1896–1971) was an American physicist who is best known for his work in the field of low-temperature physics. He was a pioneer in the development of the field of cryogenics, and was the first to liquefy helium in the United States. He was also a key figure in the development of the electron microscope. Germer was born in New York City and received his Ph.D. in physics from Columbia University in 1921.", "labels": "He worked at Bell Laboratories from 1921 to 1956, where he made significant contributions to the development of the electron microscope and the study of low-temperature physics.", "concept": "lester germer"}, {"text": "This is a Wikipedia passage about laurent koscielny. ", "labels": "Laurent Koscielny (born 10 September 1985) is a French professional footballer who plays as a centre-back for Ligue 1 club Bordeaux and the France national team.", "concept": "laurent koscielny"}, {"text": "This is a Wikipedia passage about laurent koscielny. Laurent Koscielny (born 10 September 1985) is a French professional footballer who plays as a centre-back for Ligue 1 club Bordeaux and the France national team.", "labels": "He began his career at Guingamp in 2004, spending three seasons at the club before joining Tours in 2007.", "concept": "laurent koscielny"}, {"text": "This is a Wikipedia passage about laurent koscielny. Laurent Koscielny (born 10 September 1985) is a French professional footballer who plays as a centre-back for Ligue 1 club Bordeaux and the France national team. He began his career at Guingamp in 2004, spending three seasons at the club before joining Tours in 2007.", "labels": "After two seasons at Tours, he joined Lorient in 2009.", "concept": "laurent koscielny"}, {"text": "This is a Wikipedia passage about laurent koscielny. Laurent Koscielny (born 10 September 1985) is a French professional footballer who plays as a centre-back for Ligue 1 club Bordeaux and the France national team. He began his career at Guingamp in 2004, spending three seasons at the club before joining Tours in 2007. After two seasons at Tours, he joined Lorient in 2009. He spent three seasons at the club, making over 100 appearances, before joining Arsenal in 2010.", "labels": "Koscielny has made over 300 appearances for Arsenal, winning three FA Cups and two FA Community Shields.", "concept": "laurent koscielny"}, {"text": "This is a Wikipedia passage about laurent koscielny. Laurent Koscielny (born 10 September 1985) is a French professional footballer who plays as a centre-back for Ligue 1 club Bordeaux and the France national team. He began his career at Guingamp in 2004, spending three seasons at the club before joining Tours in 2007. After two seasons at Tours, he joined Lorient in 2009. He spent three seasons at the club, making over 100 appearances, before joining Arsenal in 2010. Koscielny has made over 300 appearances for Arsenal, winning three FA Cups and two FA Community Shields. He was named in the PFA Team of the Year in 2012–13 and was included in the UEFA Team of the Year in 2015. He was also named in the FIFPro World XI in 2016.", "labels": "He has also represented France at the 2014 FIFA World Cup and UEFA Euro 2016, helping them to the final of the latter tournament.", "concept": "laurent koscielny"}, {"text": "This is a Wikipedia passage about bridget moynahan. ", "labels": "Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model.", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about bridget moynahan. Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model.", "labels": "She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling.", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about bridget moynahan. Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling.", "labels": "She appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons.", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about bridget moynahan. Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling. She appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons.", "labels": "Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she later had a recurring role as Natasha.", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about bridget moynahan. Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling. She appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she later had a recurring role as Natasha.", "labels": "She also appeared in films such as Coyote Ugly (2000), Serendipity (2001), The Sum of All Fears (2002), I, Robot (2004), Lord of War (2005), and Gray Matters (2007).", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about bridget moynahan. Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling. She appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she later had a recurring role as Natasha. She also appeared in films such as Coyote Ugly (2000), Serendipity (2001), The Sum of All Fears (2002), I, Robot (2004), Lord of War (2005), and Gray Matters (2007).", "labels": "She starred in the ABC television series Six Degrees, which premiered in September 2006, but was cancelled after one season.", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about bridget moynahan. Bridget Moynahan (born Kathryn Bridget Moynahan; April 28, 1971) is an American actress and model. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling. She appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she later had a recurring role as Natasha. She also appeared in films such as Coyote Ugly (2000), Serendipity (2001), The Sum of All Fears (2002), I, Robot (2004), Lord of War (2005), and Gray Matters (2007). She starred in the ABC television series Six Degrees, which premiered in September 2006, but was cancelled after one season.", "labels": "She also had a recurring role in the CBS drama Blue Bloods.", "concept": "bridget moynahan"}, {"text": "This is a Wikipedia passage about merle oberon. ", "labels": "Merle Oberon (born Estelle Merle O'Brien Thompson; 19 February 1911 – 23 November 1979) was an Anglo-Indian actress.", "concept": "merle oberon"}, {"text": "This is a Wikipedia passage about merle oberon. Merle Oberon (born Estelle Merle O'Brien Thompson; 19 February 1911 – 23 November 1979) was an Anglo-Indian actress.", "labels": "She began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933).", "concept": "merle oberon"}, {"text": "This is a Wikipedia passage about merle oberon. Merle Oberon (born Estelle Merle O'Brien Thompson; 19 February 1911 – 23 November 1979) was an Anglo-Indian actress. She began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933).", "labels": "After her success in The Scarlet Pimpernel (1934), she travelled to the United States to make films for Samuel Goldwyn.", "concept": "merle oberon"}, {"text": "This is a Wikipedia passage about merle oberon. Merle Oberon (born Estelle Merle O'Brien Thompson; 19 February 1911 – 23 November 1979) was an Anglo-Indian actress. She began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933). After her success in The Scarlet Pimpernel (1934), she travelled to the United States to make films for Samuel Goldwyn.", "labels": "She was nominated for an Academy Award for Best Actress for her performance in The Dark Angel (1935).", "concept": "merle oberon"}, {"text": "This is a Wikipedia passage about merle oberon. Merle Oberon (born Estelle Merle O'Brien Thompson; 19 February 1911 – 23 November 1979) was an Anglo-Indian actress. She began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933). After her success in The Scarlet Pimpernel (1934), she travelled to the United States to make films for Samuel Goldwyn. She was nominated for an Academy Award for Best Actress for her performance in The Dark Angel (1935). Throughout her career, she appeared in a variety of films, including Wuthering Heights (1939), which earned her an Academy Award nomination for Best Actress. Other notable films include The Ghost Goes West (1935), The Citadel (1938), and The Lodger (1944). She received critical acclaim for her performances in The Bishop's Wife (1947) and I Want to Live! (1958).", "labels": "Her later years were marred by personal problems and illness.", "concept": "merle oberon"}, {"text": "This is a Wikipedia passage about merle oberon. Merle Oberon (born Estelle Merle O'Brien Thompson; 19 February 1911 – 23 November 1979) was an Anglo-Indian actress. She began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933). After her success in The Scarlet Pimpernel (1934), she travelled to the United States to make films for Samuel Goldwyn. She was nominated for an Academy Award for Best Actress for her performance in The Dark Angel (1935). Throughout her career, she appeared in a variety of films, including Wuthering Heights (1939), which earned her an Academy Award nomination for Best Actress. Other notable films include The Ghost Goes West (1935), The Citadel (1938), and The Lodger (1944). She received critical acclaim for her performances in The Bishop's Wife (1947) and I Want to Live! (1958). Her later years were marred by personal problems and illness.", "labels": "She died in 1979, aged 68.", "concept": "merle oberon"}, {"text": "This is a Wikipedia passage about hephaestion. ", "labels": "Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great.", "labels": "He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\"", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\"", "labels": "This friendship was compared, by others as well as themselves, to that of Achilles and Patroclus.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship was compared, by others as well as themselves, to that of Achilles and Patroclus.", "labels": "His military career was distinguished.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship was compared, by others as well as themselves, to that of Achilles and Patroclus. His military career was distinguished.", "labels": "He was the first to scale the walls of Tyre in 332 BC, which was the primary cause of the fall of the city.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship was compared, by others as well as themselves, to that of Achilles and Patroclus. His military career was distinguished. He was the first to scale the walls of Tyre in 332 BC, which was the primary cause of the fall of the city.", "labels": "He was also the first to conquer the Malli in India in 326 BC.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship was compared, by others as well as themselves, to that of Achilles and Patroclus. His military career was distinguished. He was the first to scale the walls of Tyre in 332 BC, which was the primary cause of the fall of the city. He was also the first to conquer the Malli in India in 326 BC.", "labels": "He was also in command of the Companion cavalry on the left wing in the Battle of Gaugamela in 331 BC.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about hephaestion. Hephaestion (Ancient Greek: Ἡφαιστίων, Hēphaistíōn; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship was compared, by others as well as themselves, to that of Achilles and Patroclus. His military career was distinguished. He was the first to scale the walls of Tyre in 332 BC, which was the primary cause of the fall of the city. He was also the first to conquer the Malli in India in 326 BC. He was also in command of the Companion cavalry on the left wing in the Battle of Gaugamela in 331 BC.", "labels": "He died of illness in 324 BC.", "concept": "hephaestion"}, {"text": "This is a Wikipedia passage about thomas biagi. Thomas Biagi (born 28 April 1972 in Bologna, Italy) is an Italian professional racing driver.", "labels": "He has competed in such series as the FIA GT Championship, the European Le Mans Series, the International GT Open, the Italian GT Championship, and the 24 Hours of Le Mans.", "concept": "thomas biagi"}, {"text": "This is a Wikipedia passage about thomas biagi. Thomas Biagi (born 28 April 1972 in Bologna, Italy) is an Italian professional racing driver. He has competed in such series as the FIA GT Championship, the European Le Mans Series, the International GT Open, the Italian GT Championship, and the 24 Hours of Le Mans. Biagi began his career in karting in 1988, and moved up to single-seaters in 1991.", "labels": "He competed in the Italian Formula Three Championship from 1992 to 1994, and then moved to the International Formula 3000 Championship in 1995.", "concept": "thomas biagi"}, {"text": "This is a Wikipedia passage about thomas biagi. Thomas Biagi (born 28 April 1972 in Bologna, Italy) is an Italian professional racing driver. He has competed in such series as the FIA GT Championship, the European Le Mans Series, the International GT Open, the Italian GT Championship, and the 24 Hours of Le Mans. Biagi began his career in karting in 1988, and moved up to single-seaters in 1991. He competed in the Italian Formula Three Championship from 1992 to 1994, and then moved to the International Formula 3000 Championship in 1995.", "labels": "He raced in the series until 1998, when he switched to sports car racing.", "concept": "thomas biagi"}, {"text": "This is a Wikipedia passage about casey serin. Casey Serin (born February 11, 1984) is an American blogger and former real estate investor.", "labels": "He gained notoriety in 2006 when he began blogging about his experiences as a real estate investor.", "concept": "casey serin"}, {"text": "This is a Wikipedia passage about casey serin. Casey Serin (born February 11, 1984) is an American blogger and former real estate investor. He gained notoriety in 2006 when he began blogging about his experiences as a real estate investor. Serin purchased eight properties in Arizona, California, and Virginia between 2004 and 2006, using a combination of subprime and stated income loans.", "labels": "He quickly became overwhelmed by the debt and was unable to make payments on the mortgages.", "concept": "casey serin"}, {"text": "This is a Wikipedia passage about casey serin. Casey Serin (born February 11, 1984) is an American blogger and former real estate investor. He gained notoriety in 2006 when he began blogging about his experiences as a real estate investor. Serin purchased eight properties in Arizona, California, and Virginia between 2004 and 2006, using a combination of subprime and stated income loans. He quickly became overwhelmed by the debt and was unable to make payments on the mortgages. He declared bankruptcy in 2008. Serin's blog, which he began in 2006, documented his experiences with real estate investing and his attempts to avoid foreclosure. He also wrote about his personal life, including his marriage and the birth of his daughter.", "labels": "His blog was widely read and attracted the attention of the media, who reported on his financial struggles.", "concept": "casey serin"}, {"text": "This is a Wikipedia passage about jean hugo. ", "labels": "Jean Hugo (1894–1984) was a French painter, illustrator, engraver, and sculptor.", "concept": "jean hugo"}, {"text": "This is a Wikipedia passage about jean hugo. Jean Hugo (1894–1984) was a French painter, illustrator, engraver, and sculptor. He was born in Paris, the son of the writer Victor Hugo and his wife, Juliette Drouet.", "labels": "He was the grandson of the poet, novelist, and dramatist Victor Hugo.", "concept": "jean hugo"}, {"text": "This is a Wikipedia passage about jean hugo. Jean Hugo (1894–1984) was a French painter, illustrator, engraver, and sculptor. He was born in Paris, the son of the writer Victor Hugo and his wife, Juliette Drouet. He was the grandson of the poet, novelist, and dramatist Victor Hugo.", "labels": "Jean Hugo was a prolific artist, best known for his drawings and engravings.", "concept": "jean hugo"}, {"text": "This is a Wikipedia passage about jean hugo. Jean Hugo (1894–1984) was a French painter, illustrator, engraver, and sculptor. He was born in Paris, the son of the writer Victor Hugo and his wife, Juliette Drouet. He was the grandson of the poet, novelist, and dramatist Victor Hugo. Jean Hugo was a prolific artist, best known for his drawings and engravings.", "labels": "He also produced paintings, lithographs, sculptures, tapestries, and ceramics.", "concept": "jean hugo"}, {"text": "This is a Wikipedia passage about jean hugo. Jean Hugo (1894–1984) was a French painter, illustrator, engraver, and sculptor. He was born in Paris, the son of the writer Victor Hugo and his wife, Juliette Drouet. He was the grandson of the poet, novelist, and dramatist Victor Hugo. Jean Hugo was a prolific artist, best known for his drawings and engravings. He also produced paintings, lithographs, sculptures, tapestries, and ceramics.", "labels": "He was associated with the art movements of Fauvism, Cubism, and Surrealism.", "concept": "jean hugo"}, {"text": "This is a Wikipedia passage about heinz christian pander. ", "labels": "Heinz Christian Pander (1794–1865) was a German anatomist and embryologist who was born in Riga, Latvia.", "concept": "heinz christian pander"}, {"text": "This is a Wikipedia passage about heinz christian pander. Heinz Christian Pander (1794–1865) was a German anatomist and embryologist who was born in Riga, Latvia. He studied medicine at the University of Dorpat and later at the University of Berlin. He was a professor of anatomy at the University of Dorpat from 1820 to 1845.", "labels": "Pander is best known for his work on the development of chick embryos, which he described in his 1817 book Beiträge zur Entwickelungsgeschichte des Hühnereies (Contributions to the Developmental History of the Chicken Egg).", "concept": "heinz christian pander"}, {"text": "This is a Wikipedia passage about heinz christian pander. Heinz Christian Pander (1794–1865) was a German anatomist and embryologist who was born in Riga, Latvia. He studied medicine at the University of Dorpat and later at the University of Berlin. He was a professor of anatomy at the University of Dorpat from 1820 to 1845. Pander is best known for his work on the development of chick embryos, which he described in his 1817 book Beiträge zur Entwickelungsgeschichte des Hühnereies (Contributions to the Developmental History of the Chicken Egg).", "labels": "He was the first to describe the three germ layers of the embryo, the ectoderm, mesoderm, and endoderm, and he was the first to describe the notochord.", "concept": "heinz christian pander"}, {"text": "This is a Wikipedia passage about arthur tedder , 1st baron tedder. ", "labels": "Arthur William Tedder, 1st Baron Tedder, GCB (11 July 1890 – 3 June 1967) was a senior Royal Air Force commander.", "concept": "arthur tedder , 1st baron tedder"}, {"text": "This is a Wikipedia passage about arthur tedder , 1st baron tedder. Arthur William Tedder, 1st Baron Tedder, GCB (11 July 1890 – 3 June 1967) was a senior Royal Air Force commander.", "labels": "During the Second World War he was Deputy Supreme Allied Commander in Europe, serving under General Dwight D. Eisenhower.", "concept": "arthur tedder , 1st baron tedder"}, {"text": "This is a Wikipedia passage about arthur tedder , 1st baron tedder. Arthur William Tedder, 1st Baron Tedder, GCB (11 July 1890 – 3 June 1967) was a senior Royal Air Force commander. During the Second World War he was Deputy Supreme Allied Commander in Europe, serving under General Dwight D. Eisenhower.", "labels": "He was also a key figure in the planning of the Normandy landings in 1944.", "concept": "arthur tedder , 1st baron tedder"}, {"text": "This is a Wikipedia passage about willie naulls. Willie Naulls (born December 7, 1934) is an American former professional basketball player.", "labels": "He was a 6'6\" forward/center who played in the National Basketball Association (NBA) from 1956 to 1966.", "concept": "willie naulls"}, {"text": "This is a Wikipedia passage about willie naulls. Willie Naulls (born December 7, 1934) is an American former professional basketball player. He was a 6'6\" forward/center who played in the National Basketball Association (NBA) from 1956 to 1966. He was a four-time NBA All-Star and a three-time All-NBA Second Team selection.", "labels": "Naulls was born in Dallas, Texas, and attended the University of California, Los Angeles (UCLA).", "concept": "willie naulls"}, {"text": "This is a Wikipedia passage about willie naulls. Willie Naulls (born December 7, 1934) is an American former professional basketball player. He was a 6'6\" forward/center who played in the National Basketball Association (NBA) from 1956 to 1966. He was a four-time NBA All-Star and a three-time All-NBA Second Team selection. Naulls was born in Dallas, Texas, and attended the University of California, Los Angeles (UCLA). He was a three-time All-American at UCLA and was named the Most Valuable Player of the 1956 Final Four. He was drafted by the St. Louis Hawks in the 1956 NBA draft and was traded to the New York Knicks in 1958. He was named to the All-Star team in 1959, 1960, 1961, and 1962. He was also named to the All-NBA Second Team in 1959, 1960, and 1962. He was traded to the San Francisco Warriors in 1963 and then to the Boston Celtics in 1965.", "labels": "He retired from the NBA in 1966.", "concept": "willie naulls"}, {"text": "This is a Wikipedia passage about andy hurley. ", "labels": "Andy Hurley is an American musician and songwriter.", "concept": "andy hurley"}, {"text": "This is a Wikipedia passage about andy hurley. Andy Hurley is an American musician and songwriter. He is best known as the drummer of the rock band Fall Out Boy, with whom he has recorded six studio albums.", "labels": "Hurley also founded the heavy metal band The Damned Things.", "concept": "andy hurley"}, {"text": "This is a Wikipedia passage about andy hurley. Andy Hurley is an American musician and songwriter. He is best known as the drummer of the rock band Fall Out Boy, with whom he has recorded six studio albums. Hurley also founded the heavy metal band The Damned Things.", "labels": "He was previously involved with several other bands, including Project Rocket, Racetraitor, and Enabler.", "concept": "andy hurley"}, {"text": "This is a Wikipedia passage about andy hurley. Andy Hurley is an American musician and songwriter. He is best known as the drummer of the rock band Fall Out Boy, with whom he has recorded six studio albums. Hurley also founded the heavy metal band The Damned Things. He was previously involved with several other bands, including Project Rocket, Racetraitor, and Enabler.", "labels": "Hurley was born in Menomonee Falls, Wisconsin.", "concept": "andy hurley"}, {"text": "This is a Wikipedia passage about andy hurley. Andy Hurley is an American musician and songwriter. He is best known as the drummer of the rock band Fall Out Boy, with whom he has recorded six studio albums. Hurley also founded the heavy metal band The Damned Things. He was previously involved with several other bands, including Project Rocket, Racetraitor, and Enabler. Hurley was born in Menomonee Falls, Wisconsin. He began playing music with his first drum kit at the age of five.", "labels": "He attended Menomonee Falls High School and played in several local bands throughout his teenage years.", "concept": "andy hurley"}, {"text": "This is a Wikipedia passage about dara torres. ", "labels": "Dara Grace Torres (born April 15, 1967) is an American former competitive swimmer who is a twelve-time Olympic medalist and former world record-holder in three events.", "concept": "dara torres"}, {"text": "This is a Wikipedia passage about dara torres. Dara Grace Torres (born April 15, 1967) is an American former competitive swimmer who is a twelve-time Olympic medalist and former world record-holder in three events.", "labels": "Torres is the first swimmer in history to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, the oldest swimmer to earn a place on the U.S. Olympic team.", "concept": "dara torres"}, {"text": "This is a Wikipedia passage about dara torres. Dara Grace Torres (born April 15, 1967) is an American former competitive swimmer who is a twelve-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer in history to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, the oldest swimmer to earn a place on the U.S. Olympic team.", "labels": "At the 2008 Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.", "concept": "dara torres"}, {"text": "This is a Wikipedia passage about dara torres. Dara Grace Torres (born April 15, 1967) is an American former competitive swimmer who is a twelve-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer in history to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.", "labels": "She won twelve Olympic medals, including four gold medals, and, at age 41, became the oldest swimmer to win an Olympic medal.", "concept": "dara torres"}, {"text": "This is a Wikipedia passage about john hughes archbishop of new york. John Joseph Hughes (July 19, 1797 – January 3, 1864) was an Irish-born prelate of the Roman Catholic Church in the United States.", "labels": "He served as the fourth Archbishop of New York from 1842 until his death in 1864.", "concept": "john hughes archbishop of new york"}, {"text": "This is a Wikipedia passage about john hughes archbishop of new york. John Joseph Hughes (July 19, 1797 – January 3, 1864) was an Irish-born prelate of the Roman Catholic Church in the United States. He served as the fourth Archbishop of New York from 1842 until his death in 1864. He was created a cardinal in 1842.", "labels": "Hughes was born in Ireland, the son of a farmer.", "concept": "john hughes archbishop of new york"}, {"text": "This is a Wikipedia passage about john hughes archbishop of new york. John Joseph Hughes (July 19, 1797 – January 3, 1864) was an Irish-born prelate of the Roman Catholic Church in the United States. He served as the fourth Archbishop of New York from 1842 until his death in 1864. He was created a cardinal in 1842. Hughes was born in Ireland, the son of a farmer. He was educated at the Royal College of St. Patrick in Maynooth, and was ordained a priest in 1819.", "labels": "He emigrated to the United States in 1817, and served as a pastor in Philadelphia and Lancaster, Pennsylvania.", "concept": "john hughes archbishop of new york"}, {"text": "This is a Wikipedia passage about john hughes archbishop of new york. John Joseph Hughes (July 19, 1797 – January 3, 1864) was an Irish-born prelate of the Roman Catholic Church in the United States. He served as the fourth Archbishop of New York from 1842 until his death in 1864. He was created a cardinal in 1842. Hughes was born in Ireland, the son of a farmer. He was educated at the Royal College of St. Patrick in Maynooth, and was ordained a priest in 1819. He emigrated to the United States in 1817, and served as a pastor in Philadelphia and Lancaster, Pennsylvania. In 1826, he was appointed the first president of St. John's College in Fordham, New York. He was consecrated Bishop of New York in 1838, and was made Archbishop of New York in 1842. As Archbishop, Hughes was a strong advocate for the establishment of the Catholic Church in the United States.", "labels": "He was a vocal opponent of anti-Catholicism, and was instrumental in the establishment of the first Catholic schools and orphanages in New York", "concept": "john hughes archbishop of new york"}, {"text": "This is a Wikipedia passage about millicent shelton. ", "labels": "Millicent Shelton is an American television and film director.", "concept": "millicent shelton"}, {"text": "This is a Wikipedia passage about millicent shelton. Millicent Shelton is an American television and film director. She has directed episodes of many popular television series, including The Office, 30 Rock, Girlfriends, Everybody Hates Chris, The Game, and The Boondocks. She has also directed several feature films, including the romantic comedy Jumping the Broom (2011) and the drama The Perfect Guy (2015). Shelton was born in Los Angeles, California. She attended the University of Southern California, where she earned a degree in film production. After graduating, she worked as an assistant director on several television shows, including The Fresh Prince of Bel-Air and Martin. She then moved into directing, helming episodes of Moesha, The Parkers, and Girlfriends.", "labels": "Shelton has been nominated for several awards, including a Primetime Emmy Award for Outstanding Directing for a Comedy Series for her work on 30 Rock.", "concept": "millicent shelton"}, {"text": "This is a Wikipedia passage about whitey kurowski. Whitey Kurowski (April 4, 1916 – October 15, 1999) was an American professional baseball player. He played in Major League Baseball as a third baseman for the St. Louis Cardinals (1938–1948) and Philadelphia Phillies (1949–1951).", "labels": "Kurowski was a five-time All-Star and was the National League MVP in 1943.", "concept": "whitey kurowski"}, {"text": "This is a Wikipedia passage about nofx. ", "labels": "NoFX is an American punk rock band from Los Angeles, California.", "concept": "nofx"}, {"text": "This is a Wikipedia passage about nofx. NoFX is an American punk rock band from Los Angeles, California.", "labels": "Formed in 1983, the band is currently composed of vocalist/bassist Fat Mike, lead guitarist Eric Melvin, rhythm guitarist El Hefe, and drummer Erik Sandin.", "concept": "nofx"}, {"text": "This is a Wikipedia passage about nofx. NoFX is an American punk rock band from Los Angeles, California. Formed in 1983, the band is currently composed of vocalist/bassist Fat Mike, lead guitarist Eric Melvin, rhythm guitarist El Hefe, and drummer Erik Sandin.", "labels": "They are often credited as one of the most successful independent bands of all time, having sold over 8 million records worldwide.", "concept": "nofx"}, {"text": "This is a Wikipedia passage about nofx. NoFX is an American punk rock band from Los Angeles, California. Formed in 1983, the band is currently composed of vocalist/bassist Fat Mike, lead guitarist Eric Melvin, rhythm guitarist El Hefe, and drummer Erik Sandin. They are often credited as one of the most successful independent bands of all time, having sold over 8 million records worldwide. NoFX's sound is often characterized by irreverent and humorous lyrics, catchy melodies, and a fast, energetic sound.", "labels": "Their lyrics often focus on punk politics, humor, and pop culture.", "concept": "nofx"}, {"text": "This is a Wikipedia passage about nofx. NoFX is an American punk rock band from Los Angeles, California. Formed in 1983, the band is currently composed of vocalist/bassist Fat Mike, lead guitarist Eric Melvin, rhythm guitarist El Hefe, and drummer Erik Sandin. They are often credited as one of the most successful independent bands of all time, having sold over 8 million records worldwide. NoFX's sound is often characterized by irreverent and humorous lyrics, catchy melodies, and a fast, energetic sound. Their lyrics often focus on punk politics, humor, and pop culture.", "labels": "The band has released twelve studio albums, fifteen extended plays, four live albums, and numerous 7\" singles.", "concept": "nofx"}, {"text": "This is a Wikipedia passage about nofx. NoFX is an American punk rock band from Los Angeles, California. Formed in 1983, the band is currently composed of vocalist/bassist Fat Mike, lead guitarist Eric Melvin, rhythm guitarist El Hefe, and drummer Erik Sandin. They are often credited as one of the most successful independent bands of all time, having sold over 8 million records worldwide. NoFX's sound is often characterized by irreverent and humorous lyrics, catchy melodies, and a fast, energetic sound. Their lyrics often focus on punk politics, humor, and pop culture. The band has released twelve studio albums, fifteen extended plays, four live albums, and numerous 7\" singles.", "labels": "They have also collaborated with other artists, including NOFX/Rancid split albums, and the Fat Wreck Chords compilation albums.", "concept": "nofx"}, {"text": "This is a Wikipedia passage about hisashi iwakuma. ", "labels": "Hisashi Iwakuma (岩隈 久志, Iwakuma Hisashi, born April 12, 1981) is a Japanese professional baseball pitcher for the Seattle Mariners of Major League Baseball (MLB).", "concept": "hisashi iwakuma"}, {"text": "This is a Wikipedia passage about hisashi iwakuma. Hisashi Iwakuma (岩隈 久志, Iwakuma Hisashi, born April 12, 1981) is a Japanese professional baseball pitcher for the Seattle Mariners of Major League Baseball (MLB). He previously played for the Tokyo Yakult Swallows of Nippon Professional Baseball's (NPB) Central League.", "labels": "He is a three-time NPB All-Star and won the Sawamura Award in 2008.", "concept": "hisashi iwakuma"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician.", "labels": "She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97).", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97).", "labels": "She was made a life peer in 2005.", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97). She was made a life peer in 2005. Bottomley was born in London and educated at the independent Putney High School and the University of Leicester, where she graduated with a degree in economics. She worked as a management consultant before entering politics.", "labels": "She was elected as MP for South West Surrey in 1984, and served as a junior minister in the Department of Health from 1989 to 1992.", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97). She was made a life peer in 2005. Bottomley was born in London and educated at the independent Putney High School and the University of Leicester, where she graduated with a degree in economics. She worked as a management consultant before entering politics. She was elected as MP for South West Surrey in 1984, and served as a junior minister in the Department of Health from 1989 to 1992.", "labels": "In 1992, she was promoted to Secretary of State for Health, a post she held until 1995.", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97). She was made a life peer in 2005. Bottomley was born in London and educated at the independent Putney High School and the University of Leicester, where she graduated with a degree in economics. She worked as a management consultant before entering politics. She was elected as MP for South West Surrey in 1984, and served as a junior minister in the Department of Health from 1989 to 1992. In 1992, she was promoted to Secretary of State for Health, a post she held until 1995.", "labels": "She then served as Secretary of State for National Heritage until 1997.", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97). She was made a life peer in 2005. Bottomley was born in London and educated at the independent Putney High School and the University of Leicester, where she graduated with a degree in economics. She worked as a management consultant before entering politics. She was elected as MP for South West Surrey in 1984, and served as a junior minister in the Department of Health from 1989 to 1992. In 1992, she was promoted to Secretary of State for Health, a post she held until 1995. She then served as Secretary of State for National Heritage until 1997.", "labels": "After the 1997 general election, she returned to the backbenches.", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about virginia bottomley. Virginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (born 12 May 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) from 1984 to 2005, and held several ministerial posts in the government of John Major, including Secretary of State for Health (1992–95) and Secretary of State for National Heritage (1995–97). She was made a life peer in 2005. Bottomley was born in London and educated at the independent Putney High School and the University of Leicester, where she graduated with a degree in economics. She worked as a management consultant before entering politics. She was elected as MP for South West Surrey in 1984, and served as a junior minister in the Department of Health from 1989 to 1992. In 1992, she was promoted to Secretary of State for Health, a post she held until 1995. She then served as Secretary of State for National Heritage until 1997. After the 1997 general election, she returned to the backbenches.", "labels": "She stood down from the House of Commons at the 2005 general election.", "concept": "virginia bottomley"}, {"text": "This is a Wikipedia passage about john liscio. John Liscio (born October 28, 1951) is an American financial analyst, author, and entrepreneur.", "labels": "He is the founder and president of John Liscio Report, a financial research and analysis firm.", "concept": "john liscio"}, {"text": "This is a Wikipedia passage about john liscio. John Liscio (born October 28, 1951) is an American financial analyst, author, and entrepreneur. He is the founder and president of John Liscio Report, a financial research and analysis firm. He is also the author of several books on investing, including The Wall Street Journal Guide to Understanding Money & Investing, The Wall Street Journal Guide to the New Rules of Personal Finance, and The Wall Street Journal Guide to Understanding Money & Investing.", "labels": "Liscio began his career in the financial services industry in the early 1970s, working as a stockbroker and financial analyst.", "concept": "john liscio"}, {"text": "This is a Wikipedia passage about john liscio. John Liscio (born October 28, 1951) is an American financial analyst, author, and entrepreneur. He is the founder and president of John Liscio Report, a financial research and analysis firm. He is also the author of several books on investing, including The Wall Street Journal Guide to Understanding Money & Investing, The Wall Street Journal Guide to the New Rules of Personal Finance, and The Wall Street Journal Guide to Understanding Money & Investing. Liscio began his career in the financial services industry in the early 1970s, working as a stockbroker and financial analyst. He later founded his own firm, John Liscio Report, in 1982.", "labels": "The firm provides research and analysis on the stock market, mutual funds, and other investments.", "concept": "john liscio"}, {"text": "This is a Wikipedia passage about john vallely. John Vallely (born April 28, 1947) is an American former professional basketball player. He played in the National Basketball Association (NBA) from 1970 to 1980 as a guard for the Los Angeles Lakers, Atlanta Hawks, and Houston Rockets.", "labels": "Vallely was born in Los Angeles, California.", "concept": "john vallely"}, {"text": "This is a Wikipedia passage about john vallely. John Vallely (born April 28, 1947) is an American former professional basketball player. He played in the National Basketball Association (NBA) from 1970 to 1980 as a guard for the Los Angeles Lakers, Atlanta Hawks, and Houston Rockets. Vallely was born in Los Angeles, California.", "labels": "He attended the University of California, Los Angeles (UCLA), where he was a member of the school's 1969–70 NCAA championship team.", "concept": "john vallely"}, {"text": "This is a Wikipedia passage about guðlaugur Þór Þórðarson. Guðlaugur Þór Þórðarson (born 28 April 1956) is an Icelandic politician who has been a Member of the Althing (the Icelandic parliament) for the Independence Party since 2003. He was Minister of Fisheries from 2009 to 2013 and Minister of Finance from 2013 to 2017. He was born in Reykjavík and graduated from the University of Iceland in 1980 with a degree in economics. He worked as a journalist for the newspaper Morgunblaðið from 1980 to 1983 and then as a financial analyst for the Central Bank of Iceland from 1983 to 1989. He was a member of the board of directors of the Central Bank from 1989 to 2003.", "labels": "In 2003, he was elected to the Althing for the Independence Party.", "concept": "guðlaugur Þór Þórðarson"}, {"text": "This is a Wikipedia passage about guðlaugur Þór Þórðarson. Guðlaugur Þór Þórðarson (born 28 April 1956) is an Icelandic politician who has been a Member of the Althing (the Icelandic parliament) for the Independence Party since 2003. He was Minister of Fisheries from 2009 to 2013 and Minister of Finance from 2013 to 2017. He was born in Reykjavík and graduated from the University of Iceland in 1980 with a degree in economics. He worked as a journalist for the newspaper Morgunblaðið from 1980 to 1983 and then as a financial analyst for the Central Bank of Iceland from 1983 to 1989. He was a member of the board of directors of the Central Bank from 1989 to 2003. In 2003, he was elected to the Althing for the Independence Party.", "labels": "He was re-elected in 2007 and 2013.", "concept": "guðlaugur Þór Þórðarson"}, {"text": "This is a Wikipedia passage about micky moody. ", "labels": "Micky Moody (born Michael Robert Moody, 28 August 1950) is an English guitarist, best known for his work with Whitesnake, Juicy Lucy, Snafu, and The Snakes.", "concept": "micky moody"}, {"text": "This is a Wikipedia passage about micky moody. Micky Moody (born Michael Robert Moody, 28 August 1950) is an English guitarist, best known for his work with Whitesnake, Juicy Lucy, Snafu, and The Snakes.", "labels": "He has also released several solo albums.", "concept": "micky moody"}, {"text": "This is a Wikipedia passage about micky moody. Micky Moody (born Michael Robert Moody, 28 August 1950) is an English guitarist, best known for his work with Whitesnake, Juicy Lucy, Snafu, and The Snakes. He has also released several solo albums. Moody was born in London, England.", "labels": "He began playing guitar at the age of 12, and by the age of 15 he was playing in local bands.", "concept": "micky moody"}, {"text": "This is a Wikipedia passage about micky moody. Micky Moody (born Michael Robert Moody, 28 August 1950) is an English guitarist, best known for his work with Whitesnake, Juicy Lucy, Snafu, and The Snakes. He has also released several solo albums. Moody was born in London, England. He began playing guitar at the age of 12, and by the age of 15 he was playing in local bands. He joined Juicy Lucy in 1969, and played on their first two albums. He then joined Snafu in 1974, and played on their first three albums. In 1978, he joined Whitesnake, and played on their first five albums. He left the band in 1982, and went on to form The Snakes, with whom he released two albums.", "labels": "He has also released several solo albums, and has collaborated with many other artists.", "concept": "micky moody"}, {"text": "This is a Wikipedia passage about michael replogle. ", "labels": "Michael Replogle (born 1951) is an American environmentalist and transportation planner.", "concept": "michael replogle"}, {"text": "This is a Wikipedia passage about michael replogle. Michael Replogle (born 1951) is an American environmentalist and transportation planner.", "labels": "He is the founder and director of the Institute for Transportation and Development Policy (ITDP), a global non-profit organization that works to promote sustainable transport solutions in cities around the world.", "concept": "michael replogle"}, {"text": "This is a Wikipedia passage about michael replogle. Michael Replogle (born 1951) is an American environmentalist and transportation planner. He is the founder and director of the Institute for Transportation and Development Policy (ITDP), a global non-profit organization that works to promote sustainable transport solutions in cities around the world.", "labels": "Replogle has been a leader in the field of sustainable transportation for more than four decades, and has been credited with helping to shape the modern urban transport landscape.", "concept": "michael replogle"}, {"text": "This is a Wikipedia passage about michael replogle. Michael Replogle (born 1951) is an American environmentalist and transportation planner. He is the founder and director of the Institute for Transportation and Development Policy (ITDP), a global non-profit organization that works to promote sustainable transport solutions in cities around the world. Replogle has been a leader in the field of sustainable transportation for more than four decades, and has been credited with helping to shape the modern urban transport landscape.", "labels": "He has worked with cities in more than 40 countries to develop and implement sustainable transport policies and projects, including bus rapid transit, bike-sharing, and pedestrian-friendly streets.", "concept": "michael replogle"}, {"text": "This is a Wikipedia passage about michael replogle. Michael Replogle (born 1951) is an American environmentalist and transportation planner. He is the founder and director of the Institute for Transportation and Development Policy (ITDP), a global non-profit organization that works to promote sustainable transport solutions in cities around the world. Replogle has been a leader in the field of sustainable transportation for more than four decades, and has been credited with helping to shape the modern urban transport landscape. He has worked with cities in more than 40 countries to develop and implement sustainable transport policies and projects, including bus rapid transit, bike-sharing, and pedestrian-friendly streets.", "labels": "He has also been a vocal advocate for the use of pricing mechanisms to reduce traffic congestion and air pollution.", "concept": "michael replogle"}, {"text": "This is a Wikipedia passage about edward synge archbishop of tuam. Edward Synge (1714–1798) was an Irish Anglican prelate who served as the Church of Ireland Archbishop of Tuam from 1781 to 1798. Synge was born in Dublin in 1714, the son of the Rev. Edward Synge, rector of St. Werburgh's Church, Dublin.", "labels": "He was educated at Trinity College, Dublin, and was ordained in 1737.", "concept": "edward synge archbishop of tuam"}]